[
{"url": "https://www.goodreads.com/book/show/197123.Brand", "num_ratings": "601", "num_reviews": "38", "avg_ratings": 3.75, "genres": ["Plays", "Classics", "Drama", "Fiction", "Plays", "Theatre"], "title": "Brand", "description": ["Brand is a play by the Norwegian playwright Henrik Ibsen. It is a verse tragedy, written in 1865 and first performed in Stockholm, Sweden on 24 March 1867. Brand was an intellectual play that provoked much original thought.", "Brand is a priest who wants to take consequence of his choices, and is therefore deeply bound to doing the \"right thing\". He believes primarily in the w", "Brand is a play by the Norwegian playwright Henrik Ibsen. It is a verse tragedy, written in 1865 and first performed in Stockholm, Sweden on 24 March 1867. Brand was an intellectual play that provoked much original thought.", "Brand is a priest who wants to take consequence of his choices, and is therefore deeply bound to doing the \"right thing\". He believes primarily in the will of man, and lives by the device \"all or nothing\". To make compromises is therefore difficult, or by his moral standards questionable at best."], "author": "Henrik Ibsen", "num_pages": "232", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-01-31 00:00:00", "ISBN": "1406790109"},
{"url": "https://www.goodreads.com/book/show/238953.Das_Kapital", "num_ratings": "6,483", "num_reviews": "207", "avg_ratings": 3.82, "genres": ["Philosophy", "Economics", "Politics", "Nonfiction", "Classics", "History", "Sociology", "European Literature", "German Literature", "Politics", "Political Science", "Academic"], "title": "Das Kapital", "description": [", Karl Marx's seminal work, is the book that above all others formed the twentieth century. From ", " sprung the economic and political systems that at one time dominated half the earth and for nearly a century kept the world on the brink of war. Even today, more than one billion Chinese citizens live under a regime that proclaims fealty to Marxist ideology.", ", Karl Marx's seminal work, is the book that above all others formed the twentieth century. From ", " sprung the economic and political systems that at one time dominated half the earth and for nearly a century kept the world on the brink of war. Even today, more than one billion Chinese citizens live under a regime that proclaims fealty to Marxist ideology. Yet this important tome has been passed over by many readers frustrated by Marx’s difficult style and his preoccupation with nineteenth-century events of little relevance to today's reader.", "Here Serge Levitsky presents a revised version of ", ", abridged to emphasize the political and philosophical core of Marx’s work while trimming away much that is now unimportant. Pointing out Marx’s many erroneous predictions about the development of capitalism, Levitsky's introduction nevertheless argues for ", " relevance as a prime example of a philosophy of economic determinism that \"subordinates the problems of human freedom and human dignity to the issues of who should own the means of production and how wealth should be distributed.\"", "Here then is a fresh and highly readable version of a work whose ideas provided inspiration for communist regimes' ideological war against capitalism, a struggle that helped to shape the world today."], "author": "Karl Marx", "num_pages": "356", "awards": [], "places": [], "character_names": [], "language": "German", "publish_date": "1996-07-01 00:00:00", "ISBN": "089526711X"},
{"url": "https://www.goodreads.com/book/show/1520801.Les_Paradis_artificiels", "num_ratings": "1,010", "num_reviews": "35", "avg_ratings": 3.8, "genres": ["Poetry", "Nonfiction", "Cultural", "France", "Writing", "Essays", "Classics"], "title": "Les Paradis artificiels", "description": ["At the time of its release in 1860, Charles Baudelaire's Artificial Paradises (Les Paradis Artificiels) met with immediate praise. One of the most important French symbolists, Baudelaire led a debauched, violent, and ultimately tragic life, dying an opium addict in 1867. This book, a response to Thomas De Quincey's Confessions of an Opium Eater, serves as a memoir of Baude", "At the time of its release in 1860, Charles Baudelaire's Artificial Paradises (Les Paradis Artificiels) met with immediate praise. One of the most important French symbolists, Baudelaire led a debauched, violent, and ultimately tragic life, dying an opium addict in 1867. This book, a response to Thomas De Quincey's Confessions of an Opium Eater, serves as a memoir of Baudelaire's last years. In this beautifully wrought portrait of the effects of wine, opium, and hashish on the mind, Baudelaire captures the dreamlike visions he experienced during his narcotic trances. These hallucinations, sometimes exquisite, sometimes disturbing, and the delusions of grandeur that often accompanied them, constitute the Paradis Artificiels, the gorgeous yet false worlds of ecstasy that eventually led to his ruin. Contrasting the effects of hashish and opium with those of wine, Baudelaire concludes that \"wine exalts the will, hashish destroys it\" and makes idlers of all those who use it."], "author": "Charles Baudelaire", "num_pages": "248", "awards": [], "places": [], "character_names": [], "language": "French", "publish_date": "1977-09-08 00:00:00", "ISBN": "2070369641"},
{"url": "https://www.goodreads.com/book/show/3655801-modern-painters", "num_ratings": "33", "num_reviews": "4", "avg_ratings": 4.15, "genres": ["Art", "Nonfiction", "Historical", "Victorian", "Biography"], "title": "Modern Painters (Vol. 1-6)", "description": ["Volume: 1-2 Publisher: Albany J.B. Lyon Subjects: Painting Aesthetics Notes: This is an OCR reprint. There may be numerous typos or missing text. There are no illustrations or indexes. When you buy the General Books edition of this book you get free trial access to Million-Books.com where you can select from more than a million books for free. You can also preview the book", "Volume: 1-2 Publisher: Albany J.B. Lyon Subjects: Painting Aesthetics Notes: This is an OCR reprint. There may be numerous typos or missing text. There are no illustrations or indexes. When you buy the General Books edition of this book you get free trial access to Million-Books.com where you can select from more than a million books for free. You can also preview the book there."], "author": "John Ruskin", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1888-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/70069.My_Past_and_Thoughts", "num_ratings": "239", "num_reviews": "25", "avg_ratings": 4.07, "genres": ["Cultural", "Russia", "Biography", "History", "Nonfiction", "Autobiography", "Memoir", "Literature", "Russian Literature"], "title": "My Past and Thoughts: The Memoirs of Alexander Herzen", "description": ["Alexander Herzen's own brilliance and the extraordinary circumstances of his life combine to place his memoirs among the greatest works of the modern era. Born in 1812, the illegitimate son of a wealthy Russian landowner, he became one of the most important revolutionary and intellectual figures of his time: as theorist, polemicist, propagandist, and political actor. Fifty", "Alexander Herzen's own brilliance and the extraordinary circumstances of his life combine to place his memoirs among the greatest works of the modern era. Born in 1812, the illegitimate son of a wealthy Russian landowner, he became one of the most important revolutionary and intellectual figures of his time: as theorist, polemicist, propagandist, and political actor. Fifty years after his death, Lenin revered him as the father of Russian revolutionary socialism. Tolstoy said he had never met another man \"with so rare a combination of scintillating brilliance and depth.\" His monumental autobiography is an unparalleled record of his—and his century's—remarkable life.", "Herzen's story of his privileged childhood among the Russian aristocracy is lit with the insight of a great novelist. With a trained historian's sense of the interaction of people and events, he limns the grand line of revolutionary development from the earliest stirrings of Russian radicalism throughthe tumultuous ideological debates of the international. His close friends and enemies—Marx, Wagner, Mill, Bakunin, Garibaldi, Kropotkin—are brought brilliantly alive. Dwight Macdonald's knowledgeable and fluent abridgment makes this great work readily available to the modern reader."], "author": "Alexander Herzen", "num_pages": "752", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1982-04-02 00:00:00", "ISBN": "0520042107"},
{"url": "https://www.goodreads.com/book/show/251264.Culture_and_Anarchy", "num_ratings": "700", "num_reviews": "53", "avg_ratings": 3.49, "genres": ["Philosophy", "Nonfiction", "Writing", "Essays", "Classics", "History", "Historical", "Victorian", "Cultural"], "title": "Culture and Anarchy", "description": ["Matthew Arnold's famous series of essays, which were first published in book form under the title Culture and Anarchy in 1869, debate important questions about the nature of culture and society. Arnold seeks to find out what culture really is, what good it can do, and if it is really necessary. He contrasts culture, which he calls the study of perfection, with anarchy, the", "Matthew Arnold's famous series of essays, which were first published in book form under the title Culture and Anarchy in 1869, debate important questions about the nature of culture and society. Arnold seeks to find out what culture really is, what good it can do, and if it is really necessary. He contrasts culture, which he calls the study of perfection, with anarchy, the mood of unrest and uncertainty that pervaded mid-Victorian England.", " This edition reproduces the original book version, revealing the immediate historical context and controversy of the piece. The introduction and notes broaden out the interpretative approach to Arnold's text, elaborating on the complexities of the religious context. The book also reinforces the continued importance of Arnold's ideas its influences in the face of the challenges of multi-culturalism and post-modernism."], "author": "Matthew Arnold", "num_pages": "221", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-12-01 00:00:00", "ISBN": "0192805118"},
{"url": "https://www.goodreads.com/book/show/584637.Utilitarianism", "num_ratings": "16,900", "num_reviews": "262", "avg_ratings": 3.65, "genres": ["Philosophy", "Nonfiction", "Classics", "Politics"], "title": "Utilitarianism", "description": ["This expanded edition of John Stuart Mill's ", " includes the text of his 1868 speech to the British House of Commons defending the use of capital punishment in cases of aggravated murder. The speech is significant both because its topic remains timely and because its arguments illustrate the applicability of the principle of utility to questions of large-scale s", "This expanded edition of John Stuart Mill's ", " includes the text of his 1868 speech to the British House of Commons defending the use of capital punishment in cases of aggravated murder. The speech is significant both because its topic remains timely and because its arguments illustrate the applicability of the principle of utility to questions of large-scale social policy."], "author": "John Stuart Mill", "num_pages": "71", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-06-15 00:00:00", "ISBN": "087220605X"},
{"url": "https://www.goodreads.com/book/show/43958.Apologia_Pro_Vita_Sua", "num_ratings": "1,032", "num_reviews": "80", "avg_ratings": 4.1, "genres": ["Religion", "Religion", "Theology", "Biography", "Christianity", "Catholic", "Philosophy", "Religion", "Christianity", "Nonfiction"], "title": "Apologia Pro Vita Sua (A Defense of One's Life)", "description": ["A highly influential figure in the Church of England, John Henry Newman stunned the Anglican community in 1843, when he left his position as vicar of St. Mary's, Oxford, to join the Roman Catholic church. Perhaps no one took greater offense than Protestant clergyman Charles Kingsley, whose scathing attacks against Newman's faith and honor inspired this brilliant response.", "A highly influential figure in the Church of England, John Henry Newman stunned the Anglican community in 1843, when he left his position as vicar of St. Mary's, Oxford, to join the Roman Catholic church. Perhaps no one took greater offense than Protestant clergyman Charles Kingsley, whose scathing attacks against Newman's faith and honor inspired this brilliant response. ", " Newman's spiritual autobiography, explores the depths and nature of Christianity with flowing prose and a conversational style that has ensured its status as a classic.", "\"False ideas may be refuted by argument, but by true ideas alone are they expelled. I will vanquish,\" Newman promised, \"not my accuser, but my judges.\" His honest and passionate defense consists of a personal history of his religious convictions, from earliest memory through the Oxford movement and his ultimate conversion. His concluding point-by-point refutation of Kingsley's charges features thought-provoking contentions that strike at the very roots of the principles underlying Protestantism. Newman won respect and admiration with his ", " a work that has helped clarify perceptions of Roman Catholicism among readers of every faith."], "author": "John Henry Newman", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-06-17 00:00:00", "ISBN": "0486442136"},
{"url": "https://www.goodreads.com/book/show/2136244.The_Conduct_of_Life", "num_ratings": "159", "num_reviews": "13", "avg_ratings": 3.9, "genres": ["Philosophy", "Classics", "Writing", "Essays", "Nonfiction", "Literature", "American", "Biography"], "title": "The Conduct of Life: A Philosophical Reading", "description": ["Ralph Waldo Emerson's 1860 book, The Conduct of Life is among the gems of his mature works. First published in the year of Abraham Lincoln's election as President, this work poses the questions of human freedom and fate. This new edition emphasizes Emerson's philosophy and thoughts on such issues as freedom and fate; creativity and established culture; faith, experience, a", "Ralph Waldo Emerson's 1860 book, The Conduct of Life is among the gems of his mature works. First published in the year of Abraham Lincoln's election as President, this work poses the questions of human freedom and fate. This new edition emphasizes Emerson's philosophy and thoughts on such issues as freedom and fate; creativity and established culture; faith, experience, and evidence; the individual, God, and the world; unity and dualism; moral law, grace, and compensation; and wealth and success. Emerson's text has been fully annotated to explain difficult words and to clarify his references. The Introduction, Notes, Bibliography, Index, and Chronology of Emerson's life help the reader understand his distinctive outlook, his contributions to philosophy, and his place in American culture and society."], "author": "Ralph Waldo Emerson", "num_pages": "219", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-04-05 00:00:00", "ISBN": "0761834117"},
{"url": "https://www.goodreads.com/book/show/286971.Unto_This_Last_and_Other_Writings", "num_ratings": "274", "num_reviews": "22", "avg_ratings": 4.03, "genres": ["Philosophy", "Writing", "Essays", "Politics", "Nonfiction", "Art", "Classics", "Economics"], "title": "Unto This Last and Other Writings", "description": ["First and foremost an outcry against injustice and inhumanity, Unto this Last is also a closely argued assault on the science of political economy, which dominated the Victorian period. Ruskin was a profoundly conservative man who looked back to the Middle Ages as a Utopia, yet his ideas had a considerable influence on the British socialist movement. And in making his powe", "First and foremost an outcry against injustice and inhumanity, Unto this Last is also a closely argued assault on the science of political economy, which dominated the Victorian period. Ruskin was a profoundly conservative man who looked back to the Middle Ages as a Utopia, yet his ideas had a considerable influence on the British socialist movement. And in making his powerful moral and aesthetic case against the dangers of unhindered industrialization he was strangely prophetic. This volume shows the astounding range and depth of Ruskin's work, and in an illuminating introduction the editor reveals the consistency of Ruskin's philosophy and his adamant belief that questions of economics, art and science could not be separated from questions of morality. In Ruskin's words, 'There is no Wealth but Life.'"], "author": "John Ruskin", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1985-10-31 00:00:00", "ISBN": "0140432116"},
{"url": "https://www.goodreads.com/book/show/5547034-the-league-of-youth", "num_ratings": "106", "num_reviews": "14", "avg_ratings": 3.23, "genres": ["Plays", "Classics", "Literature", "19th Century", "Drama", "Fiction"], "title": "The League of Youth", "description": ["\"The League of Youth\" is Henrik Ibsen's comedic play which is the story of Stensgaard, a charismatic would-be politician, who forms the 'League of Youth' party and attempts to get elected. The character of Stensgaard is supposedly based on writer Bjornstjerne Bjornson, a contemporary of Ibsen and political opposition leader. Praised for its witty dialogue and cynical humor", "\"The League of Youth\" is Henrik Ibsen's comedic play which is the story of Stensgaard, a charismatic would-be politician, who forms the 'League of Youth' party and attempts to get elected. The character of Stensgaard is supposedly based on writer Bjornstjerne Bjornson, a contemporary of Ibsen and political opposition leader. Praised for its witty dialogue and cynical humor, \"The League of Youth\" was one of Ibsen's most popular 19th century plays."], "author": "Henrik Ibsen", "num_pages": "124", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-01-01 00:00:00", "ISBN": "1420930834"},
{"url": "https://www.goodreads.com/book/show/6784683-die-nibelungen", "num_ratings": "65", "num_reviews": "1", "avg_ratings": 3.85, "genres": ["Classics", "Anthologies", "Collections", "Academic", "Read For School"], "title": "Die Nibelungen", "description": ["Friedrich Hebbel: Werke. Herausgegeben von Gerhard Fricke, Werner Keller und Karl Pörnbacher, Band 1–5, München: Hanser, 1963. Erstdruck: Hamburg (Hoffmann und Campe) 1862. Uraufführung des 1. u. 2. Teils am 31.1.1861, des 3. Teils am 18.5.1861 in Weimar."], "author": "Friedrich Hebbel", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "German", "publish_date": "1986-06-12 00:00:00", "ISBN": "3150031710"},
{"url": "https://www.goodreads.com/book/show/2284289.The_Death_of_Ivan_the_Terrible_a_Tragedy", "num_ratings": "35", "num_reviews": "1", "avg_ratings": 3.69, "genres": ["Classics", "Literature", "Russian Literature", "Fiction", "Cultural", "Russia"], "title": "The Death of Ivan the Terrible, a Tragedy", "author": "Aleksey Konstantinovich Tolstoy", "num_pages": "184", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-07-01 00:00:00", "ISBN": "0548257787"},
{"url": "https://www.goodreads.com/book/show/39878121-les-destinees", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": [], "title": "Les Destinees", "description": ["The texts published by the STFM provide the richest and most varied panorama of French literature from the Renaissance to modern times: alongside the great names of literature (Ronsard, Corneille, Voltaire or Chateaubriand) and major works and collections (Du Bellay, Rotrou, Saint-Evremond, Scarron, Tristan l'Hermite), there are lesser known authors (Angot de l'Eperonniere", "The texts published by the STFM provide the richest and most varied panorama of French literature from the Renaissance to modern times: alongside the great names of literature (Ronsard, Corneille, Voltaire or Chateaubriand) and major works and collections (Du Bellay, Rotrou, Saint-Evremond, Scarron, Tristan l'Hermite), there are lesser known authors (Angot de l'Eperonniere, Boindin, Mareschal) and many rare texts, often in their first modern publication."], "author": "Alfred de Vigny", "num_pages": "174", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2012-12-12 00:00:00", "ISBN": "2865039161"},
{"url": "https://www.goodreads.com/book/show/820486.Recollections_of_the_Lakes_and_the_Lake_Poets", "num_ratings": "39", "num_reviews": "4", "avg_ratings": 3.77, "genres": ["Nonfiction", "Medievalism", "Romanticism", "Autobiography", "Memoir", "Biography", "Classics", "Criticism", "Literary Criticism"], "title": "Recollections of the Lakes and the Lake Poets", "description": ["This book is only part of De Quincey's prolific writings, which taken together form his autobiography. The frankness with which he wrote about Wordsworth, Southey, Coleridge and their lives at Grasmere provoked a storm on publication."], "author": "Thomas de Quincey", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1971-03-30 00:00:00", "ISBN": "0140430563"},
{"url": "https://www.goodreads.com/book/show/729553.Modern_Love", "num_ratings": "93", "num_reviews": "12", "avg_ratings": 3.73, "genres": ["Poetry", "Literature", "19th Century", "Historical", "Victorian", "Fiction"], "title": "Modern Love", "description": ["George Meredith's Modern Love (1862) is a collection of 50 16-line sonnets about the failure of his first marriage. He reflects his own disillusionment after his wife Mary Ellen, the daughter of Thomas Love Peacock, left him for the painter Henry Wallis. It is often thought of as one of the first psychological poems."], "author": "George Meredith", "num_pages": "56", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-12-01 00:00:00", "ISBN": "1425467059"},
{"url": "https://www.goodreads.com/book/show/1240320.Drum_Taps", "num_ratings": "188", "num_reviews": "17", "avg_ratings": 4.11, "genres": ["Poetry", "Literature", "American", "Classics", "History"], "title": "Drum Taps", "description": ["This scarce antiquarian book is a facsimile reprint of the original. Due to its age, it may contain imperfections such as marks, notations, marginalia and flawed pages. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern", "This scarce antiquarian book is a facsimile reprint of the original. Due to its age, it may contain imperfections such as marks, notations, marginalia and flawed pages. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions that are true to the original work."], "author": "Walt Whitman", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-06-17 00:00:00", "ISBN": "1419116975"},
{"url": "https://www.goodreads.com/book/show/23562924-tithonus", "num_ratings": "30", "num_reviews": "2", "avg_ratings": 4.1, "genres": ["Poetry", "Academic", "College"], "title": "Tithonus", "author": "Alfred Tennyson", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1860-02-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/10548255-enoch-arden", "num_ratings": "83", "num_reviews": "10", "avg_ratings": 3.93, "genres": ["Poetry", "Classics", "Literature", "English Literature", "Fiction"], "title": "Enoch Arden", "description": ["Excerpt: ", "Long lines of cliff breaking have left a chasm ;", "And in the chasm are foam and yellow sands ;", "Beyond, red roofs about a narrow wharf", "In cluster ; then a moulder'd church ; and higher", "A long street climbs to one tall-tower'd mill ;", "And high in heaven behind it a gray down", "With Danish barrows ; and a hazelwood,", "By autumn nutters haunted, flourishes", "Green in a cuplike hollow", "Excerpt: ", "Long lines of cliff breaking have left a chasm ;", "And in the chasm are foam and yellow sands ;", "Beyond, red roofs about a narrow wharf", "In cluster ; then a moulder'd church ; and higher", "A long street climbs to one tall-tower'd mill ;", "And high in heaven behind it a gray down", "With Danish barrows ; and a hazelwood,", "By autumn nutters haunted, flourishes", "Green in a cuplike hollow of the down.", "[...]"], "author": "Alfred Tennyson", "num_pages": "118", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-03-09 00:00:00", "ISBN": "1438573138"},
{"url": "https://www.goodreads.com/book/show/11061220-the-prince-s-progress", "num_ratings": "13", "num_reviews": "1", "avg_ratings": 3.85, "genres": ["Poetry", "Classics", "European Literature", "British Literature", "Historical", "Victorian"], "title": "The Prince's Progress: And Other Poems (1866)", "description": ["This scarce antiquarian book is a selection from Kessinger Publishing's Legacy Reprint Series. Due to its age, it may contain imperfections such as marks, notations, marginalia and flawed pages. Because we believe this work is culturally important, we have made it available as part of our commitment to protecting, preserving, and promoting the world's literature. Kessinger", "This scarce antiquarian book is a selection from Kessinger Publishing's Legacy Reprint Series. Due to its age, it may contain imperfections such as marks, notations, marginalia and flawed pages. Because we believe this work is culturally important, we have made it available as part of our commitment to protecting, preserving, and promoting the world's literature. Kessinger Publishing is the place to find hundreds of thousands of rare and hard-to-find books with something of interest for everyone"], "author": "Christina Rossetti", "num_pages": "222", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-09-10 00:00:00", "ISBN": "1165626233"},
{"url": "https://www.goodreads.com/book/show/10057256-dramatis-person", "num_ratings": "9", "num_reviews": "1", "avg_ratings": 4.22, "genres": [], "title": "Dramatis Personæ", "description": ["Excerpt from Dramatis Personae ", "Constance and Norbert. ", "Nor. Now! ", "Con. Not now! ", "Nor. Give me them again, those hands -", "Put them upon my forehead, how it throbs!", "Press them before my eyes, the fire comes through!", "You cruellest, you dearest in the world, ", "Let me! The Queen must grant whate'er I ask -", "How can I gain you and not ask the Queen?", "There she stays waiting for me, here stan", "Excerpt from Dramatis Personae ", "Constance and Norbert. ", "Nor. Now! ", "Con. Not now! ", "Nor. Give me them again, those hands -", "Put them upon my forehead, how it throbs!", "Press them before my eyes, the fire comes through!", "You cruellest, you dearest in the world, ", "Let me! The Queen must grant whate'er I ask -", "How can I gain you and not ask the Queen?", "There she stays waiting for me, here stand you;", "Some time or other this was to be asked;", "Now is the one time - what I ask, I gain: ", "Let me ask now, love! ", "Con. Do, and ruin us! ", "Nor. Let it be now, love! All my soul breaks forth.", "How I do love you! Give my love its way!", "A man can have but one life and one death, ", "One heaven, one hell. Let me fulfil my fate -", "Grant me my heaven now! Let me know you mine, ", "Prove you mine, write my name upon your brow,"], "author": "Robert Browning", "num_pages": "260", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-11-30 00:00:00", "ISBN": "0559828578"},
{"url": "https://www.goodreads.com/book/show/867406.The_Ring_and_the_Book", "num_ratings": "366", "num_reviews": "31", "avg_ratings": 3.9, "genres": ["Poetry", "Classics", "Fiction", "Historical", "Victorian", "Literature", "Historical", "Historical Fiction"], "title": "The Ring and the Book", "description": ["Centered around the scene of a murder trial, the story of The Ring and the Book is narrated in the form of multi-character monologues. The ambitious 21,000 line poem is sure to captivate today's reader just as much as its unconventional form surprised those who first rummaged through its pages when it was first published.", "."], "author": "Robert Browning", "num_pages": "842", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-08-27 00:00:00", "ISBN": "1551113724"},
{"url": "https://www.goodreads.com/book/show/1183959.Phantasmagoria_and_Other_Poems", "num_ratings": "763", "num_reviews": "54", "avg_ratings": 3.7, "genres": ["Poetry", "Classics", "Fiction", "Fantasy", "Humor"], "title": "Phantasmagoria and Other Poems", "description": ["One winter night, at half-past nine, Cold, tired, and cross, and muddy, I had come home, too late to dine, And supper, with cigars and wine, Was waiting in the study. There was a strangeness in the room, And Something white and wavy Was standing near me in the gloom -- I took it for the carpet-broom Left by that careless slavey. But presently the Thing began To shiver and", "One winter night, at half-past nine, Cold, tired, and cross, and muddy, I had come home, too late to dine, And supper, with cigars and wine, Was waiting in the study. There was a strangeness in the room, And Something white and wavy Was standing near me in the gloom -- I took it for the carpet-broom Left by that careless slavey. But presently the Thing began To shiver and to sneeze: On which I said \"Come, come, my man! That's a most inconsiderate plan. Less noise there, if you please!\" \"I've caught a cold,\" the Thing replies, \"Out there upon the landing.\" I turned to look in some surprise, And there, before my very eyes, A little Ghost was standing!"], "author": "Lewis Carroll", "num_pages": "112", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-02-01 00:00:00", "ISBN": "1598187880"},
{"url": "https://www.goodreads.com/book/show/3356987-cantares-gallegos", "num_ratings": "195", "num_reviews": "7", "avg_ratings": 4.07, "genres": ["Poetry", "Classics", "European Literature", "Spanish Literature"], "title": "Cantares gallegos", "description": ["La publicación en 1863 de Cantares gallegos de Rosalía de Castro supuso, en lo que a Galicia se refiere, la consagración de su literatura en lengua vernácula. La intención de la obra sobrepasa la finalidad puramente estética; es una apología de la tierra y la lengua gallegas. La autora, desde un Madrid falto de comprensión hacia lo regional, evoca su tierra, sus paisajes,", "La publicación en 1863 de Cantares gallegos de Rosalía de Castro supuso, en lo que a Galicia se refiere, la consagración de su literatura en lengua vernácula. La intención de la obra sobrepasa la finalidad puramente estética; es una apología de la tierra y la lengua gallegas. La autora, desde un Madrid falto de comprensión hacia lo regional, evoca su tierra, sus paisajes, su gente y sus canciones en este libro clásico. Ricardo Carballo Calero ha aplicado su precisión y saber en el cuidado de esta edición cuya lectura para los no hablantes del gallego queda facilitada por el glosario final."], "author": "Rosalía de Castro", "num_pages": "187", "awards": [], "places": [], "character_names": [], "language": "Galician", "publish_date": "1989-04-12 00:00:00", "ISBN": "8437600308"},
{"url": "https://www.goodreads.com/book/show/18660966-leyendas", "num_ratings": "484", "num_reviews": "35", "avg_ratings": 3.9, "genres": ["Short Stories", "Fiction", "European Literature", "Spanish Literature", "Classics"], "title": "Leyendas", "description": ["Este libro ha sido convertido a formato digital por una comunidad de voluntarios. Puedes encontrarlo gratis en Internet. Comprar la edición Kindle incluye la entrega inalámbrica."], "author": "Gustavo Adolfo Bécquer", "num_pages": "289", "awards": [], "places": [], "character_names": [], "language": "Spanish", "publish_date": "2011-11-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2893157-poems-political-letters-of-f-i-tyutchev", "num_ratings": "17", "num_reviews": "3", "avg_ratings": 4.59, "genres": ["Poetry", "Cultural", "Russia", "Politics"], "title": "Poems & Political Letters of F. I. Tyutchev", "author": "Fyodor Tyutchev", "num_pages": "236", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1974-04-28 00:00:00", "ISBN": "0870491466"},
{"url": "https://www.goodreads.com/book/show/1699874.Sonnets", "num_ratings": "40", "num_reviews": "6", "avg_ratings": 4.13, "genres": ["Poetry", "European Literature", "Italian Literature", "Cultural", "Italy", "Classics"], "title": "Sonnets", "description": ["Writing clandestine sonnets in local dialect for more than 15 years while leading a respectably conformist life of letters and bureaucracy, Giuseppe Gioacchino Belli erected a lasting poetical monument to the people of 19th-century Rome. Set against the checkered background of the city of the six Ps—pope, priests, princes, prostitutes, parasites, and the poor—Belli's somet", "Writing clandestine sonnets in local dialect for more than 15 years while leading a respectably conformist life of letters and bureaucracy, Giuseppe Gioacchino Belli erected a lasting poetical monument to the people of 19th-century Rome. Set against the checkered background of the city of the six Ps—pope, priests, princes, prostitutes, parasites, and the poor—Belli's sometimes scandalous sonnets deal with life's elementals love, death, sex, food, money, family, religion, and politics. In his immense oeuvre, sampled here in a sizeable and varied selection of the best poems, people from every course and manner of life have their say—housewives, mothers, beggars, lovers, businessmen, popes, whores, doctors, thieves, lawyers, priests, pen-pushers, actresses, gossips, and many more. Their voices and preoccupations are brilliantly and accurately rendered in this volume by Mike Stocks, one of the finest sonneteers of our day."], "author": "Giuseppe Gioachino Belli", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "Italian", "publish_date": "2007-06-01 00:00:00", "ISBN": "1847490115"},
{"url": "https://www.goodreads.com/book/show/752712.Dover_Beach_and_Other_Poems", "num_ratings": "1,201", "num_reviews": "15", "avg_ratings": 3.9, "genres": ["Poetry", "Classics", "Historical", "Victorian", "Literature", "19th Century", "Literature"], "title": "Dover Beach and Other Poems", "description": ["This superb selection of the poetry of Matthew Arnold (1822–1888) offers rich evidence of the poetic gifts that made him famous in his day, and that continue to rank him among the most loved and admired of Victorian poets. In addition to the title poem, it includes such masterpieces as \"The Scholar Gipsy,\" \"Thyrsis,\" \"The Forsaken Merman,\" \"Memorial Verses,\" and \"Rugby Cha", "This superb selection of the poetry of Matthew Arnold (1822–1888) offers rich evidence of the poetic gifts that made him famous in his day, and that continue to rank him among the most loved and admired of Victorian poets. In addition to the title poem, it includes such masterpieces as \"The Scholar Gipsy,\" \"Thyrsis,\" \"The Forsaken Merman,\" \"Memorial Verses,\" and \"Rugby Chapel.\"", "Although as a literary critic, Arnold championed the serene poise and impersonal grandeur of the classics, his own poems were often more romantic than classical in nature — intimate, personal, sentimental, even nostalgic. Yet it is these engaging qualities, together with his poems' lyrical inspiration and lofty meditative character, that continue to endear Matthew Arnold to lovers of poetry."], "author": "Matthew Arnold", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-05-17 00:00:00", "ISBN": "0486280373"},
{"url": "https://www.goodreads.com/book/show/11709532-odes-modernas", "num_ratings": "11", "num_reviews": "0", "avg_ratings": 3.91, "genres": [], "title": "Odes Modernas (1875)", "description": ["This scarce antiquarian book is a selection from Kessinger Publishing's Legacy Reprint Series. Due to its age, it may contain imperfections such as marks, notations, marginalia and flawed pages. Because we believe this work is culturally important, we have made it available as part of our commitment to protecting, preserving, and promoting the world's literature. Kessinger", "This scarce antiquarian book is a selection from Kessinger Publishing's Legacy Reprint Series. Due to its age, it may contain imperfections such as marks, notations, marginalia and flawed pages. Because we believe this work is culturally important, we have made it available as part of our commitment to protecting, preserving, and promoting the world's literature. Kessinger Publishing is the place to find hundreds of thousands of rare and hard-to-find books with something of interest for eve"], "author": "Antero de Quental", "awards": [], "places": [], "character_names": [], "language": "Portuguese", "publish_date": "2010-09-10 00:00:00", "ISBN": "1164984519"},
{"url": "https://www.goodreads.com/book/show/3504987-dieu", "num_ratings": "18", "num_reviews": "4", "avg_ratings": 3.89, "genres": ["Cultural", "France"], "title": "Dieu", "description": ["Svako u sebi treba da pronađe Boga koji je svuda i u svemu. To je zaključak kome vodi iole pažljivo čitanje poeme Bog.", "Za Igoa je religija čovekova unutarnja vrednost. Njegov Bog prebivao je samo u njemu, u bezdanima njegovog duha."], "author": "Victor Hugo", "num_pages": "137", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1986-08-12 00:00:00", "ISBN": "2868690742"},
{"url": "https://www.goodreads.com/book/show/1862279.La_Fin_de_Satan", "num_ratings": "25", "num_reviews": "1", "avg_ratings": 3.88, "genres": ["Poetry", "Classics", "Cultural", "France", "Academic", "School"], "title": "La Fin de Satan", "description": ["Ce livre historique peut contenir de nombreuses coquilles et du texte manquant. Les acheteurs peuvent generalement telecharger une copie gratuite scannee du livre original (sans les coquilles) aupres de l'editeur. Non reference. Non illustre. 1886 edition. Extrait: ... C'etait le soir. Jesus avait dit le matin Aux disciples ranges autour de lui: --Vous, Jacques, Vous, Pier", "Ce livre historique peut contenir de nombreuses coquilles et du texte manquant. Les acheteurs peuvent generalement telecharger une copie gratuite scannee du livre original (sans les coquilles) aupres de l'editeur. Non reference. Non illustre. 1886 edition. Extrait: ... C'etait le soir. Jesus avait dit le matin Aux disciples ranges autour de lui: --Vous, Jacques, Vous, Pierre, vous, Thomas, voici le jour de Paques; Vous irez dans la ville ou des gens passeront; Vous trouverez un homme ayant sa cruche au front; A l'endroit ou cet homme ira, quel qu'il puisse etre, Vous irez a sa suite, et vous direz: --Le Maitre Vient faire ici la Paque.--Et pour cette raison Cet homme, quel qu'il soit, donnera sa maison. Il sied que Dieu toujours nous mene ou bon lui semble. Et nous celebrerons la Paque tous ensemble.--Et cela s'etait fait ainsi qu'il l'avait dit. Ce que la Cene vit et ce qu'elle entendit Est ecrit, dans le livre ou pas un mot ne change, Par les quatre hommes purs pres de qui l'on voit l'ange, Le lion, et le b uf, et l'aigle, et le ciel bleu; Cette histoire par eux semble ajoutee a Dieu Comme s'ils ecrivaient en marge de l'abime; Tout leur livre ressemble au rayon d'une cime; Chaque page y fremit sous le frisson sacre; Et c'est pourquoi la terre a dit: je le lirai! Les peuples qui n'ont pas ce livre, le mendient, Et vingt siecles penches dans l'ombre l'etudient. Donc c'etait le soir meme ou cet etre divin Venait de partager le gateau sans levain; Christ, assis, lui treizieme, au centre de la table, --Et ce noir chiffre Treize est reste redoutable, --Avait rompu le pain, verse le vin, disant: Mangez, voici ma chair; buvez, voici mon sang. Puis il avait repris: --Suivons Dieu qui nous mene!--Et tous etaient alles en sortant de la Cene Au..."], "author": "Victor Hugo", "num_pages": "317", "awards": [], "places": [], "character_names": [], "language": "French", "publish_date": "1984-09-01 00:00:00", "ISBN": "2070322548"},
{"url": "https://www.goodreads.com/book/show/2199631.Krylov_s_Fables", "num_ratings": "864", "num_reviews": "11", "avg_ratings": 4.11, "genres": ["Cultural", "Russia", "Literature", "Russian Literature", "Classics", "Short Stories", "Poetry"], "title": "Krylov's Fables (Classics of Russian literature)", "description": ["Крылов считал, что басня, как и всякое произведение искусства, должна быть проста и понятна: \"А ларчик просто открывался!\". Вот такими \"ларчиками\" с сокровищами народной мудрости и были его произведения. Многие выражения из написанных из 200 басен стали крылатыми, превратились в пословицы и поговорки. Пушкин считал, что басенному творчеству Крылова присуще \"весёлое лукавст", "Крылов считал, что басня, как и всякое произведение искусства, должна быть проста и понятна: \"А ларчик просто открывался!\". Вот такими \"ларчиками\" с сокровищами народной мудрости и были его произведения. Многие выражения из написанных из 200 басен стали крылатыми, превратились в пословицы и поговорки. Пушкин считал, что басенному творчеству Крылова присуще \"весёлое лукавство\", характерное для русского склада ума. А после его смерти в 1844 году другой великий писатель, Николай Васильевич Гоголь, сказал о нём так: \"Его притчи - достояние народное и составляют книгу мудрости самого народа\"."], "author": "Ivan Krylov", "num_pages": "271", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1977-06-10 00:00:00", "ISBN": "0883554895"},
{"url": "https://www.goodreads.com/book/show/7504073-dealings-with-the-fairies", "num_ratings": "9", "num_reviews": "1", "avg_ratings": 4.33, "genres": ["Fantasy", "Fiction", "Science Fiction Fantasy"], "title": "Dealings with the Fairies (1867)", "description": ["Here are five incredible tales of fairies and fantasy by George MacDonald, the 19th century Scottish author whose works influenced and were admired by such literary greats as C.S. Lewis, W.H. Auden, C.K. Chesterton and J.R.R. Tolkien. Reprinted from a rare 1867 edition, this work contains stories that are not only wonderful tales on their own, but ones that also convey imp", "Here are five incredible tales of fairies and fantasy by George MacDonald, the 19th century Scottish author whose works influenced and were admired by such literary greats as C.S. Lewis, W.H. Auden, C.K. Chesterton and J.R.R. Tolkien. Reprinted from a rare 1867 edition, this work contains stories that are not only wonderful tales on their own, but ones that also convey important messages and lessons to the reader -- be it through the gravity defying princess in The Light Princess; or by way of Tricksey-Wee and Buffy-Bob in The Giant s Heart; or through the mysterious creatures and their king in The Shadows; or from the tale of Alice and Richard and their journey in fairyland in Cross Purposes; or, finally, by way of the magic and mystery of Tangle and Mossy s journey in The Golden Key. While most fairy tales are written specifically for children, these were not. Instead, wrote the author, they were written for the child-like, whether they be of five, or fifty, or seventy-five. For this edition there are six new illustrations drawn by Kathy Harestad -- one full-color illustration, which you see on the cover and five wonderful black and white drawings, each drawn specifically for a chapter in the book."], "author": "George MacDonald", "num_pages": "346", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-10-01 00:00:00", "ISBN": "1120275458"},
{"url": "https://www.goodreads.com/book/show/3532.First_Love", "num_ratings": "7,551", "num_reviews": "499", "avg_ratings": 3.79, "genres": ["Classics", "Fiction", "Cultural", "Russia", "Literature", "Russian Literature", "Romance"], "title": "First Love", "description": ["This vivid, sensitive tale of adolescent love follows a 16-year-old boy who falls in love with a beautiful, older woman and experiences a whirlwind of changing emotions, from exaltation and jealousy to despair and devotion.", "This beautifully packaged series of classic novellas includes the works of masterful writers. Inexpensive and collectible, they are the first single-vol", "This vivid, sensitive tale of adolescent love follows a 16-year-old boy who falls in love with a beautiful, older woman and experiences a whirlwind of changing emotions, from exaltation and jealousy to despair and devotion.", "This beautifully packaged series of classic novellas includes the works of masterful writers. Inexpensive and collectible, they are the first single-volume publications of these classic tales, offering a closer look at this underappreciated literary form and providing a fresh take on the world's most celebrated authors."], "author": "Ivan Turgenev", "num_pages": "124", "awards": [], "places": ["Moscow"], "character_names": ["Vladimir Petrovich Woldemar", "Zinaida Zasyekin", "Princess Zasyekin", "Count Malevsky", "Looshin", "Maidanov", "Nirmatsky", "Byelovzorov", "Pyotr Vassilitch Woldemar"], "language": "English", "publish_date": "2004-09-01 00:00:00", "ISBN": "0974607894"},
{"url": "https://www.goodreads.com/book/show/267104.He_Knew_He_Was_Right", "num_ratings": "5,238", "num_reviews": "147", "avg_ratings": 3.85, "genres": ["Classics", "Fiction", "Literature", "19th Century", "Historical", "Victorian"], "title": "He Knew He Was Right", "description": ["Louis Trevelyan seems the most fortunate of mid-Victorian gentlemen: young, rich, well-educated, handsome, and with a beautiful wife. But his life is ruined by ungrounded jealousy. In the later mad scenes, in which the unlucky hero has been utterly consumed by an obsession with his wife's imaginary infidelity, Trollope's writing reaches a Shakespearian pitch unmatched anyw", "Louis Trevelyan seems the most fortunate of mid-Victorian gentlemen: young, rich, well-educated, handsome, and with a beautiful wife. But his life is ruined by ungrounded jealousy. In the later mad scenes, in which the unlucky hero has been utterly consumed by an obsession with his wife's imaginary infidelity, Trollope's writing reaches a Shakespearian pitch unmatched anywhere else in his vast fictional output. In the sub-plot dealing with the marriages of his English and American heroines, Trollope engages head-on the issue of women's rights. And in the person of Miss Jemima Stanbury, the virtuous dragon of Exeter Cathedral Close, Trollope created one of his most notable comic characters."], "author": "Anthony Trollope", "num_pages": "952", "awards": [], "places": [], "character_names": ["Louis Trevelyan", "Emily Trevelyan", "Nora Rowley", "Sir Marmaduke Rowley", "Lady Rowley", "Hugh Stanbury", "Jemima Stanbury", "Dorothy Stanbury", "Colonel Osborne"], "language": "English", "publish_date": "1998-09-10 00:00:00", "ISBN": "0192835408"},
{"url": "https://www.goodreads.com/book/show/7698498-gryll-grange", "num_ratings": "38", "num_reviews": "4", "avg_ratings": 3.66, "genres": ["Classics", "Gothic", "Fiction"], "title": "Gryll Grange", "description": ["\"Gryll Grange\" is an 1861 novel by Thomas Love Peacock. His seventh and last novel, it tells the story of Gregory Gryll, a descendant of the ancient and noble Gryllus who, for lack of better options, chooses his niece to be his heir. However, Gryll's plan falls short when his new heir finds it difficult to find a man to her particular tastes.", "Thomas Love Peacock (18 October", "\"Gryll Grange\" is an 1861 novel by Thomas Love Peacock. His seventh and last novel, it tells the story of Gregory Gryll, a descendant of the ancient and noble Gryllus who, for lack of better options, chooses his niece to be his heir. However, Gryll's plan falls short when his new heir finds it difficult to find a man to her particular tastes.", "Thomas Love Peacock (18 October 1785 - 23 January 1866) was an English poet, novelist, and important figure in the East India Company. A good friend of Percy Bysshe Shelley, they both had a significant influence on each other's work. Peacock was most famous for writing satirical novels, which usually involved characters sat around a table discussing contemporary philosophical ideas. Other notable works by this author include: \"Headlong Hall\" (1815), \"Melincourt\" (1817), and \"Nightmare Abbey\" (1818).", "This volume is being republished here in an affordable, modern, high-quality edition complete with a specially-commissioned biography of the author."], "author": "Thomas Love Peacock", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-03-04 00:00:00", "ISBN": "1444600052"},
{"url": "https://www.goodreads.com/book/show/3401591-a-queda-dum-anjo", "num_ratings": "1,316", "num_reviews": "53", "avg_ratings": 3.72, "genres": ["Classics", "European Literature", "Portuguese Literature", "Fiction", "Cultural", "Portugal", "Romance", "Literature", "Academic", "School", "Novels", "Academic", "Read For School", "Literature", "19th Century"], "title": "A Queda dum Anjo", "description": ["Uma das novelas mais célebres de Camilo Castelo Branco (publicada em 1866, no Porto) constitui uma notável caricatura da vida política nacional, mas também uma parábola humorística acerca do desvirtuamento do Portugal antigo.", "O protagonista, Calisto Elói, um fidalgo transmontano, austero e conservador, é uma espécie de encarnação satírica desse Portugal: eleito deputado, Ca", "Uma das novelas mais célebres de Camilo Castelo Branco (publicada em 1866, no Porto) constitui uma notável caricatura da vida política nacional, mas também uma parábola humorística acerca do desvirtuamento do Portugal antigo.", "O protagonista, Calisto Elói, um fidalgo transmontano, austero e conservador, é uma espécie de encarnação satírica desse Portugal: eleito deputado, Calisto vai viver para Lisboa, onde se deixa corromper pelo luxo e pelo prazer que imperam na capital, tomando por amante uma prima afastada, Ifigénia, e transitando da posição miguelista para o partido liberal no governo.", "Ironicamente, a esposa de Calisto, Teodora, uma aldeã prosaica, imita-o na devassidão: vendo-se desprezada pelo marido, une-se a um primo interesseiro e sucumbe ela própria aos vícios da modernidade. "], "author": "Camilo Castelo Branco", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "Portuguese", "publish_date": "2007-12-27 00:00:00", "ISBN": "9720042133"},
{"url": "https://www.goodreads.com/book/show/1093672.Iracema", "num_ratings": "2,889", "num_reviews": "80", "avg_ratings": 2.83, "genres": ["Fiction", "Classics", "Cultural", "Brazil"], "title": "Iracema", "description": ["Neste romance José de Alencar faz uma alegoria da fundação do Ceará, resultando em uma obra essencial do indianismo. A potiguara Iracema, a 'virgem dos lábios de mel', encontra nas florestas da orla cearense o português Martim. É o início de um conturbado amor proibido que revela, com lirismo e aventura, a contradição e o embate entre civilizações."], "author": "José de Alencar", "num_pages": "96", "awards": [], "places": [], "character_names": ["Iracema", "Martim"], "language": "Portuguese", "publish_date": "2005-02-02 00:00:00", "ISBN": "0850515009"},
{"url": "https://www.goodreads.com/book/show/909710.Amor_de_Perdi_o", "num_ratings": "4,319", "num_reviews": "146", "avg_ratings": 3.51, "genres": ["Classics", "European Literature", "Portuguese Literature", "Romance", "Fiction"], "title": "Amor de Perdição", "description": ["Perhaps the height of Portuguese romanticism, Amor de Perdição is a Portuguese Romeo and Juliet. Simão Botelho and Teresa are hopelessly in love, but their families are rivals in Viseu. When Teresa's father, Tadeu, discovers their love, he shuts her in a convent. But, while trying to see his beloved, Simão kills Baltasar, and eventually condemned to death. The sentence is", "Perhaps the height of Portuguese romanticism, Amor de Perdição is a Portuguese Romeo and Juliet. Simão Botelho and Teresa are hopelessly in love, but their families are rivals in Viseu. When Teresa's father, Tadeu, discovers their love, he shuts her in a convent. But, while trying to see his beloved, Simão kills Baltasar, and eventually condemned to death. The sentence is commuted to 10 years of service in India, but before the sentence is executed, both Teresa and Simão die of broken hearts."], "author": "Camilo Castelo Branco", "num_pages": "148", "awards": [], "places": [], "character_names": ["Baltasar", "Simão Botelho", "Teresa de Albuquerque", "Tadeu de Albuquerque", "Mariana"], "language": "Portuguese", "publish_date": "2004-12-01 00:00:00", "ISBN": "0850515092"},
{"url": "https://www.goodreads.com/book/show/2890732-luc-ola", "num_ratings": "1,438", "num_reviews": "22", "avg_ratings": 3.45, "genres": ["Classics", "Fiction", "Romance"], "title": "Lucíola", "description": ["Na melhor tradição romântica, Lucíola é um livro onde se debatem paixões tórridas e contraditórias. O amor que não resiste às barreiras sociais e morais. Assim é o romance da bela Lúcia, a mais rica e cobiçada cortesã do Rio de Janeiro, e Paulo, um jovem modesto e frágil.Um romance que sacode a corte e provoca um excitado burburinho na sociedade. De um lado a mulhoer que,", "Na melhor tradição romântica, Lucíola é um livro onde se debatem paixões tórridas e contraditórias. O amor que não resiste às barreiras sociais e morais. Assim é o romance da bela Lúcia, a mais rica e cobiçada cortesã do Rio de Janeiro, e Paulo, um jovem modesto e frágil.Um romance que sacode a corte e provoca um excitado burburinho na sociedade. De um lado a mulhoer que, sendo de todos, jurava não prender-se a nenhum homem, de outro o homem em dúvida entre o amor e o preconceito. José de Alencar utiliza este instigante argumento para descrever a enorme atração física entre um homem e uma mulher. A pena moralizadora do escritor busca a idealização espiritual da prostituta que quer se modificar e a alma pura de Paulo cujo amor arrebatador supera todas as barreiras. Lucíola é um dos mais curiosos trabalhos de José de Alencar.Há nele um clima de sensualidade constante combinado com o ardor e sofrimento, bem no clima da literatura romântica que predominava na segunda metade do século passado quando foi escrito este romance."], "author": "José de Alencar", "num_pages": "176", "awards": [], "places": ["Brazil"], "character_names": [], "language": "Portuguese", "publish_date": "1999-08-12 00:00:00", "ISBN": "8525409545"},
{"url": "https://www.goodreads.com/book/show/178196.What_Is_to_Be_Done_", "num_ratings": "1,527", "num_reviews": "73", "avg_ratings": 3.4, "genres": ["Fiction", "Literature", "Russian Literature", "Cultural", "Russia", "Classics", "Politics", "Philosophy"], "title": "What Is to Be Done?", "description": ["\"No work in modern literature, with the possible exception of ", ", can compete with ", " in its effect on human lives and its power to make history. For Chernyshevsky's novel, far more than Marx's ", ", supplied the emotional dynamic that eventually went to make the Russian Revolution.\"--Joseph Frank, ", "Almost from the momen", "\"No work in modern literature, with the possible exception of ", ", can compete with ", " in its effect on human lives and its power to make history. For Chernyshevsky's novel, far more than Marx's ", ", supplied the emotional dynamic that eventually went to make the Russian Revolution.\"--Joseph Frank, ", "Almost from the moment of its publication in 1863, Nikolai Chernyshevsky's novel, ", ", had a profound impact on the course of Russian literature and politics. The idealized image it offered of dedicated and self-sacrificing intellectuals transforming society by means of scientific knowledge served as a model of inspiration for Russia's revolutionary intelligentsia. On the one hand, the novel's condemnation of moderate reform helped to bring about the irrevocable break between radical intellectuals and liberal reformers; on the other, Chernyshevsky's socialist vision polarized conservatives' opposition to institutional reform. Lenin himself called Chernyshevsky \"the greatest and most talented representative of socialism before Marx\"; and the controversy surrounding ", " exacerbated the conflicts that eventually led to the Russian Revolution.", "Michael R. Katz's readable and compelling translation is now the definitive unabridged English-language version, brilliantly capturing the extraordinary qualities of the original. William G. Wagner has provided full annotations to Chernyshevsky's allusions and references and to the, sources of his ideas, and has appended a critical bibliography. An introduction by Katz and Wagner places the novel in the context of nineteenth-century Russian social, political, and intellectual history and literature, and explores its importance for several generations of Russian radicals."], "author": "Nikolai Chernyshevsky", "num_pages": "445", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1989-01-20 00:00:00", "ISBN": "0801495474"},
{"url": "https://www.goodreads.com/book/show/8183820-captain-fracasse", "num_ratings": "642", "num_reviews": "29", "avg_ratings": 3.83, "genres": ["Classics", "Cultural", "France", "European Literature", "French Literature", "Fiction", "Adventure", "Historical", "Historical Fiction"], "title": "Captain Fracasse", "description": ["Excerpt: ...enemy; who might have taken it just as well as not, but had spared him, and been content with giving him only a flesh wound, just severe enough to put him hors-de-combat, without doing him any serious injury. This magnanimous conduct, by which a less haughty nature would have been deeply touched, only served to irritate the young duke's pride, and increase his", "Excerpt: ...enemy; who might have taken it just as well as not, but had spared him, and been content with giving him only a flesh wound, just severe enough to put him hors-de-combat, without doing him any serious injury. This magnanimous conduct, by which a less haughty nature would have been deeply touched, only served to irritate the young duke's pride, and increase his resentment. To think that he, the valiant and puissant Duke of Vallombreuse, had been conquered, humiliated, wounded! the bare idea made him frantic. Although he said nothing further to his companion about his revenge, his mind was filled with fierce projects whereby to obtain it, and he swore to himself to be even yet with the author of his present mortification"], "author": "Théophile Gautier", "num_pages": "258", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-08-01 00:00:00", "ISBN": "1443210374"},
{"url": "https://www.goodreads.com/book/show/97369.Prince_Serebryani", "num_ratings": "103", "num_reviews": "3", "avg_ratings": 4.14, "genres": ["Literature", "Russian Literature", "Historical", "Historical Fiction", "Classics", "Cultural", "Russia", "Romance", "Fiction"], "title": "Prince Serebryani: An Historical Novel of the Times of Ivan the Terrible and of the Conquest of Siberia", "description": ["A. K. Tolstoy was above all poet; but he also wrote a historical novel from the time of Ivan The Terrible, Prince Serebryani, which had a great success, partly because in it for the first time censorship had permitted fiction to deal with the half-mad Tsar who played the part of Louis XI. of the Russian Monarchy, but especially on account of its qualities as a historical n", "A. K. Tolstoy was above all poet; but he also wrote a historical novel from the time of Ivan The Terrible, Prince Serebryani, which had a great success, partly because in it for the first time censorship had permitted fiction to deal with the half-mad Tsar who played the part of Louis XI. of the Russian Monarchy, but especially on account of its qualities as a historical novel."], "author": "Aleksey Konstantinovich Tolstoy", "num_pages": "460", "awards": [], "places": ["Russia"], "character_names": [], "language": "English", "publish_date": "2001-03-20 00:00:00", "ISBN": "0898752795"},
{"url": "https://www.goodreads.com/book/show/8588158-the-precipice", "num_ratings": "332", "num_reviews": "15", "avg_ratings": 4.07, "genres": ["Cultural", "Russia", "Classics", "Literature", "Russian Literature", "Fiction", "Audiobook"], "title": "The Precipice", "description": ["Ivan Alexandrovich Goncharov (1812-1891) was one of the leading members of the great circle of Russian writers who, in the middle of the nineteenth century, gathered around the Sovremmenik (Contemporary) under Nekrasov's editorship-a circle including Turgenev, Dostoyevsky, Tolstoy, Byelinsky, and Herzen. He had not the marked genius of the first three of these; but that he", "Ivan Alexandrovich Goncharov (1812-1891) was one of the leading members of the great circle of Russian writers who, in the middle of the nineteenth century, gathered around the Sovremmenik (Contemporary) under Nekrasov's editorship-a circle including Turgenev, Dostoyevsky, Tolstoy, Byelinsky, and Herzen. He had not the marked genius of the first three of these; but that he is so much less known to the western reader is perhaps also due to the fact that there was nothing sensational either in his life or his literary method. His strength was in the steady delineation of character, conscious of, but not deeply disturbed by, the problems which were obsessing and distracting smaller and greater minds."], "author": "Ivan Goncharov", "num_pages": "820", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-05-11 00:00:00", "ISBN": "1434409740"},
{"url": "https://www.goodreads.com/book/show/1514224.A_Plea_For_Captain_John_Brown", "num_ratings": "131", "num_reviews": "12", "avg_ratings": 3.64, "genres": ["History", "Nonfiction", "Politics", "Classics", "Literature", "American", "Writing", "Essays", "Biography"], "title": "A Plea For Captain John Brown", "description": ["He was one of that class of whom we hear a great deal, but, for the most part, see nothing at all- the Puritans. It would be in vain to kill him. He died lately in the time of Cromwell, but he reappeared here. Why should he not? Some of the Puritan stock are said to have come over and settled in New England. They were a class that did something else than celebrate their fo", "He was one of that class of whom we hear a great deal, but, for the most part, see nothing at all- the Puritans. It would be in vain to kill him. He died lately in the time of Cromwell, but he reappeared here. Why should he not? Some of the Puritan stock are said to have come over and settled in New England. They were a class that did something else than celebrate their forefathers' day, and eat parched corn in remembrance of that time."], "author": "Henry David Thoreau", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-06-01 00:00:00", "ISBN": "1419102699"},
{"url": "https://www.goodreads.com/book/show/7406109-the-conduct-of-life", "num_ratings": "159", "num_reviews": "13", "avg_ratings": 3.9, "genres": ["Philosophy", "Classics", "Writing", "Essays", "Nonfiction", "Literature", "American", "Biography"], "title": "The Conduct of Life", "description": ["This collection of essays was published originally in 1860, just before the American Civil War. In it, philosopher Ralph Waldo Emerson turns toward pragmatism and focuses on the practical application of ethics in everyday life. Students of philosophy and literature will enjoy these thoughtful writings from one of America's most celebrated authors. Topics include. . Culture", "This collection of essays was published originally in 1860, just before the American Civil War. In it, philosopher Ralph Waldo Emerson turns toward pragmatism and focuses on the practical application of ethics in everyday life. Students of philosophy and literature will enjoy these thoughtful writings from one of America's most celebrated authors. Topics include. . Culture . Fate . Beauty . Worship American poet and philosopher RALPH WALDO EMERSON (1803-1882), the \"Sage of Concord,\" was a driving force behind the Transcendental Movement of the early 18th century and remains a major figure in American literature. His works include Representative Men (1850), Society and Solitude (1870), and Parnassus (1875)."], "author": "Ralph Waldo Emerson", "num_pages": "312", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-07-25 00:00:00", "ISBN": "0548123470"},
{"url": "https://www.goodreads.com/book/show/25821212-the-evolution-of-woman", "num_ratings": "2", "num_reviews": "0", "avg_ratings": 4.0, "genres": ["Art", "Humor"], "title": "The Evolution of Woman", "author": "Harry Whitney McVickar", "num_pages": "99", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1896-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/64897.Cape_Cod", "num_ratings": "795", "num_reviews": "97", "avg_ratings": 3.75, "genres": ["Travel", "Nonfiction", "Classics", "Environment", "Nature", "Philosophy", "Writing", "Essays", "Literature", "Science", "Natural History", "History", "Autobiography", "Memoir"], "title": "Cape Cod", "description": ["Based on several trips to the Cape and originally published as a series of articles, Henry David Thoreau's ", " is a remarkable work that depicts the natural beauty of Cape Cod and the nature that surrounds it. Thoreau, a consummate lover of the outdoors and nature is right at home in the Cape and he details his excitement of the area with naturalist portraits of the i", "Based on several trips to the Cape and originally published as a series of articles, Henry David Thoreau's ", " is a remarkable work that depicts the natural beauty of Cape Cod and the nature that surrounds it. Thoreau, a consummate lover of the outdoors and nature is right at home in the Cape and he details his excitement of the area with naturalist portraits of the indigenous species and animals. Any lover of nature or of Cape Cod in general will delight in this captivating depiction of the area in the early to mid 1800s."], "author": "Henry David Thoreau", "num_pages": "116", "awards": [], "places": ["Cape Cod, Massachusetts"], "character_names": [], "language": "English", "publish_date": "2006-01-01 00:00:00", "ISBN": "1420927124"},
{"url": "https://www.goodreads.com/book/show/25814735-ye-book-of-copperheads", "num_ratings": "4", "num_reviews": "1", "avg_ratings": 3.25, "genres": [], "title": "Ye Book of Copperheads", "author": "Charles Godfrey Leland", "num_pages": "36", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1863-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2260975.Life_Without_Principle", "num_ratings": "471", "num_reviews": "35", "avg_ratings": 4.01, "genres": ["Philosophy", "Nonfiction", "Classics", "Writing", "Essays", "Literature"], "title": "Life Without Principle", "description": ["Kessinger Publishing is the place to find hundreds of thousands of rare and hard-to-find books with something of interest for everyone"], "author": "Henry David Thoreau", "num_pages": "48", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-03-01 00:00:00", "ISBN": "1432595180"},
{"url": "https://www.goodreads.com/book/show/7017034-on-the-study-of-celtic-literature", "num_ratings": "83", "num_reviews": "3", "avg_ratings": 3.36, "genres": ["Nonfiction", "History", "Academic"], "title": "On the Study of Celtic Literature", "description": ["The following remarks on the study of Celtic Literature formed the substance of four lectures given by me in the chair of poetry at Oxford. They were first published in the Cornhill Magazine, and are now reprinted from thence. Again and again, in the course of them, I have marked the very humble scope intended; which is, not to treat any special branch of scientific Celtic", "The following remarks on the study of Celtic Literature formed the substance of four lectures given by me in the chair of poetry at Oxford. They were first published in the Cornhill Magazine, and are now reprinted from thence. Again and again, in the course of them, I have marked the very humble scope intended; which is, not to treat any special branch of scientific Celtic studies (a task for which I am quite incompetent), but to point out the many directions in which the results of those studies offer matter of general interest, and to insist on the benefit we may all derive from knowing the Celt and things Celtic more thoroughly. It was impossible, however, to avoid touching on certain points of ethnology and philology, which can be securely handled only by those who have made these sciences the object of special study. Here the mere literary critic must owe his whole safety to his tact in choosing authorities to follow, and whatever he advances must be understood as advanced with a sense of the insecurity which, after all, attaches to such a mode of proceeding, and as put forward provisionally, by way of hypothesis rather than of confident assertion."], "author": "Matthew Arnold", "num_pages": "92", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-03-18 00:00:00", "ISBN": "1595477357"},
{"url": "https://www.goodreads.com/book/show/91793.Torture", "num_ratings": "2", "num_reviews": "1", "avg_ratings": 3.5, "genres": [], "title": "Torture (Sources of Medieval History)", "author": "Henry Charles Lea", "num_pages": "209", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1974-07-01 00:00:00", "ISBN": "081221062X"},
{"url": "https://www.goodreads.com/book/show/30219179-the-light-princess", "num_ratings": "5,779", "num_reviews": "360", "avg_ratings": 4.01, "genres": ["Fantasy", "Classics", "Fiction", "Childrens", "Fantasy", "Fairy Tales"], "title": "The Light Princess", "description": ["Notice: This Book is published by Historical Books Limited (", ") as a Public Domain Book, if you have any inquiries, requests or need any help you can just send an email to publications@publicdomain.org.uk This book is found as a public domain and free book based on various online catalogs, if you think there are any problems regard copyright issues ple", "Notice: This Book is published by Historical Books Limited (", ") as a Public Domain Book, if you have any inquiries, requests or need any help you can just send an email to publications@publicdomain.org.uk This book is found as a public domain and free book based on various online catalogs, if you think there are any problems regard copyright issues please contact us immediately via DMCA@publicdomain.org.uk"], "author": "George MacDonald", "num_pages": "124", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-05-11 00:00:00", "ISBN": "1533174636"},
{"url": "https://www.goodreads.com/book/show/2573698-the-gorilla-hunters", "num_ratings": "173", "num_reviews": "10", "avg_ratings": 3.9, "genres": ["Historical", "Historical Fiction", "Adventure", "Classics", "Fiction"], "title": "The Gorilla Hunters: A Tale of the Wilds of Africa", "description": ["In this exciting sequel to ", ", R.M. Ballantyne continues the story of Ralph Rover, Jack Martin, and Peterkin Gay who, after their return to England for rest after their South Seas adventures, are now intent on joining the great hunters in Africa for a journey into the anterior of the Dark Continent.", "In the course of their safari adventures, they fight with sav", "In this exciting sequel to ", ", R.M. Ballantyne continues the story of Ralph Rover, Jack Martin, and Peterkin Gay who, after their return to England for rest after their South Seas adventures, are now intent on joining the great hunters in Africa for a journey into the anterior of the Dark Continent.", "In the course of their safari adventures, they fight with savages, hunt elephants and gorillas, and visit native tribes. Peterkin gets thrown by a wild African buffalo, and Ralph is “hugged” by a gorilla. Upon their return to England, a newfound tribal warrior, King Jambai, sends back their numerous boxes of hunting trophies. Find out how their excursion concludes, and if they all survive the African journey!"], "author": "R.M. Ballantyne", "num_pages": "378", "awards": [], "places": [], "character_names": ["Ralph Rover", "Jack Martin", "Peterkin Gay"], "language": "English", "publish_date": "2007-05-01 00:00:00", "ISBN": "1934554022"},
{"url": "https://www.goodreads.com/book/show/657815.Curious_Myths_of_the_Middle_Ages", "num_ratings": "491", "num_reviews": "38", "avg_ratings": 3.36, "genres": ["History", "Nonfiction", "Fantasy", "Mythology", "Historical", "Medieval", "Classics", "Religion"], "title": "Curious Myths of the Middle Ages: The Sangreal, Pope Joan, The Wandering Jew, and Others", "description": ["One of the most brilliant, eclectic thinkers in Victorian England, the Reverend Sabine Baring-Gould (1834–1924) was intrigued by the grotesque and often savage history of the Middle Ages. The noted author and folklorist’s fascination with the period resulted in this absorbing compilation of vintage tales surrounding such figures as William Tell and the Man in the Moon. ", "Twe", "One of the most brilliant, eclectic thinkers in Victorian England, the Reverend Sabine Baring-Gould (1834–1924) was intrigued by the grotesque and often savage history of the Middle Ages. The noted author and folklorist’s fascination with the period resulted in this absorbing compilation of vintage tales surrounding such figures as William Tell and the Man in the Moon. ", "Twenty-four legendary figures — among others, Saint Patrick, the Pied Piper, knights of the Holy Grail, and St. George — are rejuvenated in this collection for a new audience. In addition to outlines of the myths, the author provides an objective analysis of their origins, relevance, and the extent of their basis in fact. Fascinating sources include Christian adaptations of prehistoric legends, misinterpretations of actual events, and outright fabrications. Accompanying illustrations provide a visual appreciation for these timeless classics. A marvelous introduction to age-old stories, this oft-cited work will be of value and interest to students, scholars, and other readers."], "author": "Sabine Baring-Gould", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-06-03 00:00:00", "ISBN": "0486439933"},
{"url": "https://www.goodreads.com/book/show/1061468.Charles_le_T_m_raire", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": [], "title": "Charles le Téméraire: Tome 2", "description": ["This Elibron Classics book is a facsimile reprint of a 1857 edition by Meline, Cans et Compagnie, Bruxelles."], "author": "Alexandre Dumas", "num_pages": "228", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2002-01-11 00:00:00", "ISBN": "1421226510"},
{"url": "https://www.goodreads.com/book/show/12013293-the-story-of-a-bad-boy", "num_ratings": "210", "num_reviews": "33", "avg_ratings": 3.76, "genres": ["Classics", "Fiction", "Childrens", "Adventure", "Historical", "Historical Fiction", "Humor"], "title": "The Story of a Bad Boy", "description": ["In a time when children's books were populated with well-behaved little gentlemen, Thomas Bailey Aldrich dared to present an alternative point of view - childhood as he remembered it. Tom Bailey is no angel. At times a bully, a vandal, and a troublemaker, he has a healthy zest for life and a perhaps over-developed love of mischief. The book follows Tom as he engages in a s", "In a time when children's books were populated with well-behaved little gentlemen, Thomas Bailey Aldrich dared to present an alternative point of view - childhood as he remembered it. Tom Bailey is no angel. At times a bully, a vandal, and a troublemaker, he has a healthy zest for life and a perhaps over-developed love of mischief. The book follows Tom as he engages in a series of adventures which take him from his New Hampshire hometown to New Orleans and beyond. A fictionalized account of the author's own childhood, The Story of a Bad Boy was controversial when it first appeared in 1869, but is now hailed as the precursor to other 'bad boy' stories such as Tom Sawyer and Huckleberry Finn. It stands in its own right as a hugely enjoyable tale."], "author": "Thomas Bailey Aldrich", "num_pages": "253", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1927-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/27253.Pope_Joan", "num_ratings": "801", "num_reviews": "55", "avg_ratings": 3.92, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics"], "title": "Pope Joan: Translated & Adapted from the Greek", "description": ["In this brilliant adaptation of a novel by the 19th century Greek author Emmanuel Royidis, Lawrence Durrell traces the remarkable history of a young woman who travelled across Europe in the ninth century disguised as a monk, acquired great learning, and ruled over Christendom for two years as Pope John VIII before her sudden and surprising death. When ", " was fi", "In this brilliant adaptation of a novel by the 19th century Greek author Emmanuel Royidis, Lawrence Durrell traces the remarkable history of a young woman who travelled across Europe in the ninth century disguised as a monk, acquired great learning, and ruled over Christendom for two years as Pope John VIII before her sudden and surprising death. When ", " was first published in Athens in 1886 it created a sensation. The book was banned and its author excommunicated. It nevertheless brought him immediate fame and the work established itself securely in the history of modern Greek literature. Subsequently Durrell, one of the most important British writers of the 20th century, created a masterpiece in its own right—a dazzling concoction presented with the deftest touch."], "author": "Emmanuel Rhoides", "num_pages": "200", "awards": [], "places": [], "character_names": ["Pope Joan"], "language": "English", "publish_date": "2000-03-01 00:00:00", "ISBN": "0720610656"},
{"url": "https://www.goodreads.com/book/show/2422823.The_Book_of_Were_Wolves_by_Sabine_Baring_Gould_Fiction_Horror", "num_ratings": "1,003", "num_reviews": "98", "avg_ratings": 3.47, "genres": ["Shapeshifters", "Werewolves", "Nonfiction", "History", "Folklore", "Horror", "Fantasy", "Mythology"], "title": "The Book of Were-Wolves by Sabine Baring-Gould, Fiction, Horror", "description": ["The author (Sabine Baring-Gould, a parson of the Church of England, an archaeologist, a historian, and a prolific author best known for writing the hymn \"Onward Christian Soldiers\") takes a typically nineteenth century approach to the mythology, methodical, rational, and almost mechanistic. He details the legend in many permutations as it exists in a diversity of cultures", "The author (Sabine Baring-Gould, a parson of the Church of England, an archaeologist, a historian, and a prolific author best known for writing the hymn \"Onward Christian Soldiers\") takes a typically nineteenth century approach to the mythology, methodical, rational, and almost mechanistic. He details the legend in many permutations as it exists in a diversity of cultures and includes sensational chapters with case studies of cannibals, grave desecrators, and blood fetishists, which have a connection to lycanthropy. Also included is an extended treatment of the case of Giles de Rais, the notorious confederate of Joan of Arc who was convicted and executed for necrosadistic crimes."], "author": "Sabine Baring-Gould", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-08-01 00:00:00", "ISBN": "1587156105"},
{"url": "https://www.goodreads.com/book/show/115309.The_Whites_and_the_Blues", "num_ratings": "47", "num_reviews": "5", "avg_ratings": 3.79, "genres": ["Cultural", "France", "Fiction", "Historical", "Historical Fiction", "Literature"], "title": "The Whites and the Blues", "description": ["Dans la trilogie romanesque des Sainte-Hermine, Les Blancs et les Bleus précède, selon la stricte chronologie historique, Les Compagnons de Jéhu et Le Chevalier de Sainte-Hermine – le grand roman de Dumas perdu et retrouvé en 2005… cent trente-six ans après sa première parution en feuilleton dans la presse. (Il est vrai que Dumas, fin raconteur, s’est arrangé pour qu’on pu", "Dans la trilogie romanesque des Sainte-Hermine, Les Blancs et les Bleus précède, selon la stricte chronologie historique, Les Compagnons de Jéhu et Le Chevalier de Sainte-Hermine – le grand roman de Dumas perdu et retrouvé en 2005… cent trente-six ans après sa première parution en feuilleton dans la presse. (Il est vrai que Dumas, fin raconteur, s’est arrangé pour qu’on puisse lire les trois récits, indifféremment, dans l’ordre ou dans le désordre.) Suivant cette fois la grande histoire pas à pas, le romancier nous fait vivre, de la fin de 1793 à l’été de 1799, sur fond de rivalité sanglante entre royalistes (les Blancs) et républicains (les Bleus), l’irrésistible ascension d’un jeune officier corse qui tour à tour s’illustre au siège de Toulon ; puis se laisse oublier jusqu’à douter de sa fortune, avant que la Convention thermidorienne ne le charge de mater les royalistes de retour en force à Paris (13 vendémiaire 95) ; puis sauve la République en dépêchant d’Italie le fidèle Augereau auprès d’un Directoire chancelant, déjà tout près de rendre les clés aux Bourbons ; puis part pour l’Égypte et s’en revient sans trop tarder pour passer aux choses sérieuses…"], "author": "Alexandre Dumas", "num_pages": "680", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-05-18 00:00:00", "ISBN": "1589632524"},
{"url": "https://www.goodreads.com/book/show/20512344-howard-s-book-of-conundrums-and-riddles", "num_ratings": "1", "num_reviews": "0", "avg_ratings": 5.0, "genres": [], "title": "Howard's Book of Conundrums and Riddles", "description": ["CONUNDRUMS, INGENIOUS ENIGMAS, CLEVER CHARADES, QUEER RIDDLES, PERPLEXING PUZZLES, CURIOUS CATCHES, AND AMUSING SELLS, ORIGINAL AND NEWLY DRESSED. ", "A LEARNED writer, when the world was \" slow,\"", "And ponderous moral essays were \" the go,\"", "Stung by a jester—so the story runs—", "Classed picking pockets with concocting puns.", "A fig for Johnson, and all by-gone seers", "Whose \" rounded peri", "CONUNDRUMS, INGENIOUS ENIGMAS, CLEVER CHARADES, QUEER RIDDLES, PERPLEXING PUZZLES, CURIOUS CATCHES, AND AMUSING SELLS, ORIGINAL AND NEWLY DRESSED. ", "A LEARNED writer, when the world was \" slow,\"", "And ponderous moral essays were \" the go,\"", "Stung by a jester—so the story runs—", "Classed picking pockets with concocting puns.", "A fig for Johnson, and all by-gone seers", "Whose \" rounded periods \" bored our grandsires' ears", "These times are jollier, thank the gods! than theirs,", "And puns more relished than pedantic airs.", "Our modern scholars sometimes condescend", "Humor with logic in their works to blend;", "Our lawyers pungently each other \" chaff\"", "Till judge and jury over-tickled, laugh ;", "Our politicians who for office strive,", "Like clowns, with jokes the canvass keep alive ;", "Our statesmen deal in stories quaint and queer,", "That tell, well told, upon the public ear,", "And e'en the merchant, leaning o'er his desk,", "Hums some light ditty from the last burlesque.", "In such an age, when men of every class", "Prefer \" ha! ha ! \" to lachrymose \" alas! \"", "A work like this, of gravity the foe,", "Will by the world be hailed as apropos.", "With humorous problems every page abounds", "Where double meaning lurks in single sounds", " And words are played on with such perfect art, ", "That each solution makes the solver start. ", "The \" dollar hunt,\" so strenuously pursued, ", "Would keep us all in a most dolorous mood, ", "But for the hours we borrow from the mart ", "And give to Momus, tickler of the heart! ", "The daily press, so leaden-paced of yore, ", "Aims with broad jokes to make the millions roar ", "The stage with equivoques convulsive rings, ", "And comic songs the muse of opera sings. ", "In short, to link with smiles our daily cares, ", "And dovetail laughter with our grave affairs, ", "Seems a main object—neither more nor less— ", "Of stage, bar, party and the public press. ", "To give new impulse to the merry din, ", "This merry book appropriately comes in. ", "Conundrums rich, upon these leaves of ours, ", "Like sunlit rain, have fallen in golden showers, ", "With riddles, of their puzzling tribe the pinks, ", "That take the shine out of old Egypt's Sphynx. ", "Open, and read and solve—pray don't repress ", "The sovereign Yankee privilege to guess, ", "But twist the meaning out, by hook or crook. ", "Of every pleasant mystery in our \" Book.\"", "BOOK OF CONUNDRUMS AND RIDDLES,"], "author": "Clarence Howard", "num_pages": "162", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/49672.The_Wyvern_Mystery", "num_ratings": "155", "num_reviews": "20", "avg_ratings": 3.26, "genres": ["Classics", "Horror", "Gothic", "Mystery", "Fiction", "Historical", "Victorian", "Historical", "Historical Fiction", "Literature", "19th Century"], "title": "The Wyvern Mystery", "description": [" combines all the elements of nail-biting horror, romantic fairy tale, psychological thriller and rich period drama to create a compelling story. When young Alice Maybell is orphaned she is taken in by Squire Fairfield, a widower with two dashing sons, Charles and Harry. As Alice blossoms into a beautiful young woman she attracts the attentions of not one", " combines all the elements of nail-biting horror, romantic fairy tale, psychological thriller and rich period drama to create a compelling story. When young Alice Maybell is orphaned she is taken in by Squire Fairfield, a widower with two dashing sons, Charles and Harry. As Alice blossoms into a beautiful young woman she attracts the attentions of not one but two of the men she lives with. The blissful happiness that ensues, however, is short-lived as she finds herself embroiled in the dark secrets of the Fairfield family's past and the evil ambitions of its present.In a world that is nightmarish and malevolent, nothing and no one is quite what they seem. What is the dark secret in Charles Fairfield's past? Who - or what - is the malignant presence that haunts Carwell Grange?"], "author": "J. Sheridan Le Fanu", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-06-01 00:00:00", "ISBN": "0750906871"},
{"url": "https://www.goodreads.com/book/show/13226419-the-notting-hill-mystery", "num_ratings": "364", "num_reviews": "102", "avg_ratings": 3.36, "genres": ["Mystery", "Classics", "Fiction", "Mystery", "Crime"], "title": "The Notting Hill Mystery", "description": ["Can you name the first detective novel ever published? For years, many believed it to be Wilkie Collins’s ", ", published in 1868. Others speculated it might be Émile Gaboriau’s first Monsieur Lecoq novel, ", ". Actually, the first modern detective novel predates both of these by several years—Charles Warren Adams’s ", ", originall", "Can you name the first detective novel ever published? For years, many believed it to be Wilkie Collins’s ", ", published in 1868. Others speculated it might be Émile Gaboriau’s first Monsieur Lecoq novel, ", ". Actually, the first modern detective novel predates both of these by several years—Charles Warren Adams’s ", ", originally published as an eight-part serial in ", "magazine in 1862 under the pseudonym Charles Felix, then as a single-volume novel in 1863 by Bradbury & Evans, is considered to truly be the first.", "begins in London, where the wife of the sinister Baron R__ dies after drinking from a bottle of acid, apparently while sleepwalking in her husband’s home laboratory. It looks like an accident, until insurance investigator Ralph Henderson learns that Baron R__ took out numerous life insurance policies on his wife. As Henderson investigates the case, he discovers not one, but three murders. Presented as Henderson’s evidential findings—diary entries, family letters, chemical analysis reports, interviews with witnesses, along with a crime scene map—the novel displays innovative techniques that would not become common features of detective fiction until the 1920s.", "To the delight of all fans of detective fiction, the British Library makes this landmark text available once again. This handsome new edition also includes George du Maurier’s illustrations, the first edition to do so since the original publication in serial form. "], "author": "Charles Warren Adams", "num_pages": "284", "awards": [], "places": [], "character_names": ["Ralph Henderson"], "language": "English", "publish_date": "2012-04-15 00:00:00", "ISBN": "0712358595"},
{"url": "https://www.goodreads.com/book/show/182915.The_Trail_of_the_Serpent", "num_ratings": "163", "num_reviews": "27", "avg_ratings": 3.66, "genres": ["Classics", "Mystery", "Literature", "19th Century", "Fiction", "Historical", "Victorian", "European Literature", "British Literature"], "title": "The Trail of the Serpent", "description": ["Mary Elizabeth Braddon (1837–1915), Victorian England’s bestselling woman writer, blends Dickensian humor with chilling suspense in this “exuberantly campy” (", ") mystery. The novel features Jabez North, a manipulative orphan who becomes a ruthless killer; Valerie de Cevennes, a stunning heiress who falls into North’s diabolical trap; and Mr. Peters, a mute dete", "Mary Elizabeth Braddon (1837–1915), Victorian England’s bestselling woman writer, blends Dickensian humor with chilling suspense in this “exuberantly campy” (", ") mystery. The novel features Jabez North, a manipulative orphan who becomes a ruthless killer; Valerie de Cevennes, a stunning heiress who falls into North’s diabolical trap; and Mr. Peters, a mute detective who communicates his brilliant reasoning through sign language. ", "This edition includes a critical Afterword and endnotes by Victorian scholar Dr. Chris Willis."], "author": "Mary Elizabeth Braddon", "num_pages": "496", "awards": [], "places": ["England", "Paris"], "character_names": ["Jabez North", "Richard Marwood", "Montague Harding", "Joseph Peters", "Kuppins", "Jim Lomax", "Valerie de Cevennes", "Gaston de Lancy", "Augustus Darley", "Sloshy", "Agnes Marwood", "Laurent Blurosset", "Egerton Lansdown", "Isabel Darley", "Sillikens"], "language": "English", "publish_date": "2003-02-11 00:00:00", "ISBN": "0812966783"},
{"url": "https://www.goodreads.com/book/show/15306732-considerations-on-representative-government", "num_ratings": "181", "num_reviews": "10", "avg_ratings": 3.75, "genres": ["Philosophy", "Politics", "Nonfiction", "Classics", "History"], "title": "Considerations on Representative Government", "description": ["1861. John Stuart Mill is one of the foremost representatives of utilitarian thought as well as one of the most influential of nineteenth century liberals. Influenced by his wife, Harriet Taylor, Mill developed a very humane version of utilitarianism that was sympathetic to women's rights, labor unions, proportional representation, and other liberal themes. Contents: To Wh", "1861. John Stuart Mill is one of the foremost representatives of utilitarian thought as well as one of the most influential of nineteenth century liberals. Influenced by his wife, Harriet Taylor, Mill developed a very humane version of utilitarianism that was sympathetic to women's rights, labor unions, proportional representation, and other liberal themes. Contents: To What Extent Forms of Government are a Matter of Choice; The Criterion of a Good Form of Government; That the Ideally Best Form of Government is Representative Government; Under What Social Conditions Representative Government is Inapplicable; Of the Proper Functions of Representative Bodies; Of the Infirmities and Dangers to Which Representative Government is Liable; Of True and False Democracy; Representation of All and Representation of the Majority Only; Of the Extension of the Suffrage; Should There be Two Stages of Election?; Of the Mode of Voting; Of the Duration of Parliaments; Ought Pledges to be Required from Members of Parliament?; Of a Second Chamber; Of the Executive in a Representative Government; Of Local Representative Bodies; Of Nationality, as Connected with Representative Government; Of Federal Representative Governments; and Of the Government of Dependencies by a Free State. See other works by this author available from Kessinger Publishing."], "author": "John Stuart Mill", "num_pages": "365", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1962-01-01 00:00:00", "ISBN": "0895269422"},
{"url": "https://www.goodreads.com/book/show/5677794-miss-ravenel-s-conversion-from-secession-to-loyalty", "num_ratings": "71", "num_reviews": "9", "avg_ratings": 3.27, "genres": ["History", "Military History", "Civil War", "Literature", "American History", "American Civil War", "Literature", "19th Century", "Literature", "American"], "title": "Miss Ravenel's Conversion from Secession to Loyalty", "description": [" is important in American literary history as the first novel to depict the Civil War with realism. Its battlefield scenes owe much to John De Forest’s own experience as a captain in that conflict. But in 1867 genteel readers were affronted by De Forest’s frank view of war and sex. Though praised by William Dean Howells, the novel was forgotten aft", " is important in American literary history as the first novel to depict the Civil War with realism. Its battlefield scenes owe much to John De Forest’s own experience as a captain in that conflict. But in 1867 genteel readers were affronted by De Forest’s frank view of war and sex. Though praised by William Dean Howells, the novel was forgotten after De Forest’s death in 1906. It was later rediscovered by Van Wyck Brooks and other critics. Modern readers will enjoy this story of a southern woman who comes to New Boston with her father in 1861, opposes his views on secession and abolition, and is changed forever by the great war. Some critics have called the charming Lillie Ravenel the first realistic heroine in American fiction."], "author": "John William De Forest", "num_pages": "466", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-10-01 00:00:00", "ISBN": "0803266154"},
{"url": "https://www.goodreads.com/book/show/842799.The_Semi_Attached_Couple_The_Semi_Detached_House", "num_ratings": "359", "num_reviews": "44", "avg_ratings": 3.82, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Historical", "Victorian", "European Literature", "British Literature", "Literature", "19th Century"], "title": "The Semi-Attached Couple & The Semi-Detached House", "description": ["Born the daughter of Lord Auckland in 1797, Emily Eden was a witty nineteenth-century aristocrat whose two delightful novels were first presented to an admiring world one hundred and fifty years ago. These matching masterpieces satirize the social world Eden knew, loved, and laughed at. Like Jane Austen she is concerned with love and marriage, money and manners. But her vo", "Born the daughter of Lord Auckland in 1797, Emily Eden was a witty nineteenth-century aristocrat whose two delightful novels were first presented to an admiring world one hundred and fifty years ago. These matching masterpieces satirize the social world Eden knew, loved, and laughed at. Like Jane Austen she is concerned with love and marriage, money and manners. But her voice is distinct. Eden's charm and humor - both above- and belowstairs - and her sharp social commentary make her work enduringly captivating."], "author": "Emily Eden", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-01-01 00:00:00", "ISBN": "0385272170"},
{"url": "https://www.goodreads.com/book/show/157685.Maldoror_Les_Chants_de_Maldoror_together_with_a_translation_of_Lautre_amont_s_Poe_sies", "num_ratings": "2,770", "num_reviews": "154", "avg_ratings": 4.19, "genres": ["Poetry", "Fiction", "Cultural", "France", "Classics"], "title": "Maldoror = Les Chants de Maldoror, together with a translation of Lautréamont's Poésies", "description": [" is a long narrative prose poem which celebrates the principle of Evil in an elaborate style and with a passion akin to religions fanaticism. The French poet-critic Georges Hugnet has written of Lautréamont: \"He terrifies, stupefies, strikes dumb. He could look squarely at that which others had merely given a passing glance.\" When first published in 1868-69, ", " is a long narrative prose poem which celebrates the principle of Evil in an elaborate style and with a passion akin to religions fanaticism. The French poet-critic Georges Hugnet has written of Lautréamont: \"He terrifies, stupefies, strikes dumb. He could look squarely at that which others had merely given a passing glance.\" When first published in 1868-69, ", " went almost unnoticed. But in the 1890s the book was rediscovered and hailed as a work of genius by such eminent writers as Huysmans, Léon Block, Maeterlinck, and Rémy de Gourmont. Later still, Lautréamont was to be canonized as one of their principal \"ancestors\" by the Paris surrealists. This edition, translated by Guy Wernham, includes also a long introduction to a never-written, or now lost, volume of poetry. Thus, except for a few letters, it gives all the surviving literary work of Lautréamont."], "author": "Comte de Lautréamont", "num_pages": "342", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1965-01-17 00:00:00", "ISBN": "0811200825"},
{"url": "https://www.goodreads.com/book/show/4567006-lost-sir-massingberd", "num_ratings": "4", "num_reviews": "2", "avg_ratings": 3.25, "genres": ["Fiction", "Historical", "Regency", "Historical", "Victorian"], "title": "Lost Sir Massingberd: A Romance of Real Life", "description": ["This work has been selected by scholars as being culturally important, and is part of the knowledge base of civilization as we know it. This work was reproduced from the original artifact, and remains as true to the original work as possible. Therefore, you will see the original copyright references, library stamps (as most of these works have been housed in our most impor", "This work has been selected by scholars as being culturally important, and is part of the knowledge base of civilization as we know it. This work was reproduced from the original artifact, and remains as true to the original work as possible. Therefore, you will see the original copyright references, library stamps (as most of these works have been housed in our most important libraries around the world), and other notations in the work. This work is in the public domain in the United States of America, and possibly other nations. Within the United States, you may freely copy and distribute this work, as no entity (individual or corporate) has a copyright on the body of the work.As a reproduction of a historical artifact, this work may contain missing or blurred pages, poor pictures, errant marks, etc. Scholars believe, and we concur, that this work is important enough to be preserved, reproduced, and made generally available to the public. We appreciate your support of the preservation process, and thank you for being an important part of keeping this knowledge alive and relevant."], "author": "James Payn", "num_pages": "328", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1976-01-01 00:00:00", "ISBN": "0405078919"},
{"url": "https://www.goodreads.com/book/show/2168808.Monsieur_Lecoq", "num_ratings": "216", "num_reviews": "30", "avg_ratings": 3.77, "genres": ["Mystery", "Classics", "Mystery", "Crime", "Cultural", "France", "Fiction"], "title": "Monsieur Lecoq", "description": ["1905. Gaboriau was the first French novelist to write detective novels. His character Monsieur Lecoq, private detective, first appeared in the novel, The Widow Lerouge. The novel begins: On February 20, 18-, a Sunday that chanced to be Shrove Sunday, about eleven o'clock in the evening, a party of agents of the safety-service left the police-station at the old Barriere d'I", "1905. Gaboriau was the first French novelist to write detective novels. His character Monsieur Lecoq, private detective, first appeared in the novel, The Widow Lerouge. The novel begins: On February 20, 18-, a Sunday that chanced to be Shrove Sunday, about eleven o'clock in the evening, a party of agents of the safety-service left the police-station at the old Barriere d'Italie. The mission of this party was to explore that vast precinct which extends from the road to Fontainebleau to the Seine, and from the outer boulevards to the fortifications. See other titles by this author available from Kessinger Publishing."], "author": "Émile Gaboriau", "num_pages": "278", "awards": [], "places": [], "character_names": ["Monsieur Lecoq", "Père Absinthe"], "language": "English", "publish_date": "1975-12-28 00:00:00", "ISBN": "0486225704"},
{"url": "https://www.goodreads.com/book/show/13605193-siberian-journey", "num_ratings": "4", "num_reviews": "1", "avg_ratings": 3.75, "genres": ["Cultural", "Russia", "History", "Autobiography", "Memoir"], "title": "Siberian Journey: Down the Amur to the Pacific, 1856-1857", "author": "Perry McDonough Collins", "num_pages": "370", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1962-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/682742.The_Golden_Key", "num_ratings": "1,991", "num_reviews": "184", "avg_ratings": 4.07, "genres": ["Fantasy", "Fiction", "Classics", "Childrens", "Fantasy", "Fairy Tales"], "title": "The Golden Key", "description": ["The adventurous wanderings of a boy and girl to find the keyhole which fits the rainbow's golden key."], "author": "George MacDonald", "num_pages": "96", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1984-12-01 00:00:00", "ISBN": "0374425906"},
{"url": "https://www.goodreads.com/book/show/2426030.The_Man_Who_Kept_His_Money_in_a_Box", "num_ratings": "41", "num_reviews": "3", "avg_ratings": 3.44, "genres": ["Classics", "Fiction", "Short Stories", "Novella"], "title": "The Man Who Kept His Money in a Box", "description": ["This scarce antiquarian book is a facsimile reprint of the original. Due to its age, it may contain imperfections such as marks, notations, marginalia and flawed pages. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern", "This scarce antiquarian book is a facsimile reprint of the original. Due to its age, it may contain imperfections such as marks, notations, marginalia and flawed pages. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions that are true to the original work."], "author": "Anthony Trollope", "num_pages": "48", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-06-17 00:00:00", "ISBN": "1419171658"},
{"url": "https://www.goodreads.com/book/show/1931757.The_Uncommercial_Traveller", "num_ratings": "256", "num_reviews": "30", "avg_ratings": 3.5, "genres": ["Classics", "Fiction", "Travel"], "title": "The Uncommercial Traveller", "description": ["No landlord is my friend and brother, no chambermaid loves me, no waiter worships me, no boots admires and envies me. No round of beef or tongue or ham is expressly cooked for me, no pigeon-pie is especially made for me, no hotel-advertisement is personally addressed to me, no hotel-room tapestried with great-coats and railway wrappers is set apart for me, no house of publ", "No landlord is my friend and brother, no chambermaid loves me, no waiter worships me, no boots admires and envies me. No round of beef or tongue or ham is expressly cooked for me, no pigeon-pie is especially made for me, no hotel-advertisement is personally addressed to me, no hotel-room tapestried with great-coats and railway wrappers is set apart for me, no house of public entertainment in the United Kingdom greatly cares for my opinion of its brandy or sherry."], "author": "Charles Dickens", "num_pages": "328", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-01 00:00:00", "ISBN": "1428053867"},
{"url": "https://www.goodreads.com/book/show/24601.Paris_Spleen", "num_ratings": "8,824", "num_reviews": "275", "avg_ratings": 4.31, "genres": ["Poetry", "Cultural", "France", "Classics", "European Literature", "French Literature", "Fiction", "Literature"], "title": "Paris Spleen", "description": ["Set in a modern, urban Paris, the prose pieces in this volume constitute a further exploration of the terrain Baudelaire had covered in his verse masterpiece, ", ": the city and its squalor and inequalities, the pressures of time and mortality, and the liberation provided by the sensual delights of intoxication, art, and women. Published posthumously in 1869", "Set in a modern, urban Paris, the prose pieces in this volume constitute a further exploration of the terrain Baudelaire had covered in his verse masterpiece, ", ": the city and its squalor and inequalities, the pressures of time and mortality, and the liberation provided by the sensual delights of intoxication, art, and women. Published posthumously in 1869, ", " was a landmark publication in the development of the genre of prose poetry—a format which Baudelaire saw as particularly suited for expressing the feelings of uncertainty, flux, and freedom of his age—and one of the founding texts of literary modernism."], "author": "Charles Baudelaire", "num_pages": "118", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1970-01-17 00:00:00", "ISBN": "0811200078"},
{"url": "https://www.goodreads.com/book/show/104262.Consuelo", "num_ratings": "1,162", "num_reviews": "38", "avg_ratings": 4.06, "genres": ["Classics", "Fiction", "Cultural", "France", "Historical", "Historical Fiction", "European Literature", "French Literature", "Romance", "Novels", "Historical", "Literature", "Music"], "title": "Consuelo", "description": ["A novel of musical life set in the 18th century. The story of Consuelo, a Gypsy singer, and her adventures in Venice, Austria and Bohemia, narrated by the most eminent of French female writers. Sand was a prolific (nearly 60 novels) writer who shocked Paris with her own sexual escapades, but in her writing dealt with the serious issues of her time and was identified with t", "A novel of musical life set in the 18th century. The story of Consuelo, a Gypsy singer, and her adventures in Venice, Austria and Bohemia, narrated by the most eminent of French female writers. Sand was a prolific (nearly 60 novels) writer who shocked Paris with her own sexual escapades, but in her writing dealt with the serious issues of her time and was identified with the Romantic literary movement. Sand's strong, independent women characters would win her both the adoration of many other writers (mostly women) and the wrath of many reviewers (mostly men). She and her characters are enthusiastic, outspoken, sententious, with a bold manifesto of women's independence and a legitimate claim to emotional and sexual fulfillment. She was unique in her approach as a woman who refused to trivialize her craft because of her gender. Sand became known more for her eccentric lifestyle and love affairs with famous contemporaries, such as Alfred de Musset and Frederic Chopin, than her career as a writer."], "author": "George Sand", "num_pages": "808", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-11-01 00:00:00", "ISBN": "1410107558"},
{"url": "https://www.goodreads.com/book/show/2488299.Mark_the_Match_Boy_Or_Richard_Hunter_s_Ward", "num_ratings": "59", "num_reviews": "4", "avg_ratings": 3.76, "genres": ["Fiction", "Childrens", "Literature", "American"], "title": "Mark the Match Boy, Or, Richard Hunter's Ward", "description": ["After leaving the ill-tempered woman with whom he lives, ten-year-old matchboy Mark Manton meets a man who recognizes something of himself in the young orphan and helps him rise above his lowly circumstances."], "author": "Horatio Alger Jr.", "num_pages": "195", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-08-12 00:00:00", "ISBN": "1411500253"},
{"url": "https://www.goodreads.com/book/show/10595699-fame-and-fortune", "num_ratings": "135", "num_reviews": "8", "avg_ratings": 3.9, "genres": ["Fiction", "Classics"], "title": "Fame and Fortune: or, The Progress of Richard Hunter", "author": "Horatio Alger Jr.", "num_pages": "279", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1896-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1413520.The_Magic_Fishbone", "num_ratings": "252", "num_reviews": "40", "avg_ratings": 3.49, "genres": ["Classics", "Childrens", "Childrens", "Picture Books", "Fiction", "Fantasy", "Short Stories"], "title": "The Magic Fishbone", "description": ["This is the extraordinary story of a very nearly ordinary princess named Alicia. Given a magic fish-bone by a good fairy, Alicia can have whatever she wishes--provided she wishes for it at the right time. But it's never clear when the right time is, and sometimes the best magic is no magic at all...."], "author": "Charles Dickens", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1961-08-12 00:00:00", "ISBN": "0880200391"},
{"url": "https://www.goodreads.com/book/show/117272.William_Shakespeare", "num_ratings": "36", "num_reviews": "7", "avg_ratings": 3.67, "genres": ["European Literature", "French Literature", "Classics", "Nonfiction", "History", "Writing", "Essays", "Poetry", "Biography"], "title": "William Shakespeare", "description": ["The true title of this work should be 'Concerning Shakespeare.' The author's original incentive was the desire to \"introduce,\" as they say in England, the new translation of Shakespeare to the public. The tie that binds him so closely to the translator need not deprive him of the privilege of commending the translation. From another side, and still more closely, his consci", "The true title of this work should be 'Concerning Shakespeare.' The author's original incentive was the desire to \"introduce,\" as they say in England, the new translation of Shakespeare to the public. The tie that binds him so closely to the translator need not deprive him of the privilege of commending the translation. From another side, and still more closely, his conscience was engaged by the subject itself. In contemplating Shakespeare, all the questions relating to art have arisen in the author's mind. To deal with these questions is to set forth the mission of art; to deal with these questions is to set forth the duty of human thought toward man. Such an opportunity for speaking some true words imposes an obligation that is not to be shirked, especially in time like ours. This, the author has understood. He has not hesitated to take every avenue of approach to these complex questions of art and of civilization, varying the horizon as the perspective shifted, and accepting every hint supplied by the urgency of the task. From such an enlarged conception of the subject this book has sprung. "], "author": "Victor Hugo", "num_pages": "452", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-05-18 00:00:00", "ISBN": "0898753392"},
{"url": "https://www.goodreads.com/book/show/17555.Behind_a_Mask", "num_ratings": "811", "num_reviews": "112", "avg_ratings": 3.74, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Literature", "19th Century"], "title": "Behind a Mask", "description": ["When demure Scottish governess Jean Muir arrives at the wealthy Coventry household, the family couldn't be more thrilled with their new young resident. But Jean proves to be no meek and mild governess, but rather a proud and passionate woman with a mysterious past. As she begins to weave her duplicitous spell, the Coventrys quickly surrender one by one to her 'innocent' ch", "When demure Scottish governess Jean Muir arrives at the wealthy Coventry household, the family couldn't be more thrilled with their new young resident. But Jean proves to be no meek and mild governess, but rather a proud and passionate woman with a mysterious past. As she begins to weave her duplicitous spell, the Coventrys quickly surrender one by one to her 'innocent' charms, all quite beguiled by her grace and beauty. Soon the men are quarrelling for her attention, and the women beside themselves with jealousy. Delighted with her success, Miss Muir sets her sights on the highest prize--an association which will secure her future and put an end to her scheming; but she has only three days to claim her victory before the truth, behind her mask, will be exposed."], "author": "A.M. Barnard", "num_pages": "111", "awards": [], "places": ["England"], "character_names": ["Jean Muir", "Gerald Coventry", "Edward Coventry", "Bella Coventry", "Lucia Beaufort", "John Coventry", "Hester Dean"], "language": "English", "publish_date": "2004-05-01 00:00:00", "ISBN": "1843910861"},
{"url": "https://www.goodreads.com/book/show/13509264-biographies-contributed-to-the-encyclopaedia-britannica", "num_ratings": "3", "num_reviews": "0", "avg_ratings": 3.67, "genres": ["Biography"], "title": "Biographies Contributed to the Encyclopaedia Britannica", "description": ["Collection of short biographies originally written for the Encyclopedia Britannica. Includes Francis Atterbury, John Bunyan, Oliver Goldsmith, Samuel Johnson, William Pitt the Younger."], "author": "Thomas Babington Macaulay", "num_pages": "316", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1860-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/9386880-wild-apples", "num_ratings": "178", "num_reviews": "20", "avg_ratings": 3.57, "genres": ["Nonfiction", "Classics", "Writing", "Essays", "Environment", "Nature", "Literature"], "title": "Wild Apples", "description": ["Henry David Thoreau was an American author, poet, naturalist, tax resister, surveyor, historian, philosopher, and leading transcendentalist. He is best known for his book Walden. He was deeply interested in the idea of survival in the face of hostile elements, historical change, and natural decay. He was a strong abolitionist and his belief in a philosophy of civil disobed", "Henry David Thoreau was an American author, poet, naturalist, tax resister, surveyor, historian, philosopher, and leading transcendentalist. He is best known for his book Walden. He was deeply interested in the idea of survival in the face of hostile elements, historical change, and natural decay. He was a strong abolitionist and his belief in a philosophy of civil disobedience influenced the political thoughts and actions of such later figures as Leo Tolstoy, Mahatma Gandhi, and Martin Luther King, Jr. First published in \"The Atlantic Monthly\" in 1862, Thoreau's essay begins with a history of the apple tree, and ends with a meditation on parallels between the wild apple and humanity."], "author": "Henry David Thoreau", "num_pages": "48", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-10-08 00:00:00", "ISBN": "1438526652"},
{"url": "https://www.goodreads.com/book/show/104266.The_Black_City", "num_ratings": "56", "num_reviews": "8", "avg_ratings": 3.41, "genres": ["Classics", "Fiction", "Cultural", "France", "Literature", "European Literature", "French Literature"], "title": "The Black City", "author": "George Sand", "num_pages": "183", "awards": [], "places": ["France"], "character_names": [], "language": "English", "publish_date": "2004-03-11 00:00:00", "ISBN": "0786713240"},
{"url": "https://www.goodreads.com/book/show/3920908-the-signalman", "num_ratings": "125", "num_reviews": "15", "avg_ratings": 3.8, "genres": ["Short Stories", "Classics", "Fiction", "Fantasy"], "title": "The Signalman", "description": ["Stories in the Travelman Short Stories series take the reader to places of mystery, fantasy, horror, romance, and corners of the universe yet unexplored. In turn, readers take them on the bus or subway, slip them into briefcases and lunchboxes, and send them from Jersey to Juneau.Each classic or original short story is printed on one sheet of paper and folded like a map. T", "Stories in the Travelman Short Stories series take the reader to places of mystery, fantasy, horror, romance, and corners of the universe yet unexplored. In turn, readers take them on the bus or subway, slip them into briefcases and lunchboxes, and send them from Jersey to Juneau.Each classic or original short story is printed on one sheet of paper and folded like a map. This makes it simple to read while commuting, convenient to carry when not, and easy to give or send to a friend. A paper envelope is provided for mailing or gift-giving, and both are packaged in a clear plastic envelope for display. The cost is not much more than a greeting card."], "author": "Charles Dickens", "num_pages": "26", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-04-01 00:00:00", "ISBN": "1860920381"},
{"url": "https://www.goodreads.com/book/show/389469.Tales_of_a_Wayside_Inn", "num_ratings": "166", "num_reviews": "29", "avg_ratings": 4.0, "genres": ["Poetry", "Classics", "Fiction", "Historical", "Historical Fiction", "Short Stories", "Literature", "American"], "title": "Tales of a Wayside Inn", "description": ["1872. Probably the best loved of American poets the world over is Henry Wadsworth Longfellow; he is loved for his gift of easy rhyme written with a natural grace and melody centered around themes with universal appeal. Longfellow's Wayside Inn in Sudbury, Massachusetts, originally known as Howe's Tavern, was the inspiration for Longfellow's widely read book of poems, Tales", "1872. Probably the best loved of American poets the world over is Henry Wadsworth Longfellow; he is loved for his gift of easy rhyme written with a natural grace and melody centered around themes with universal appeal. Longfellow's Wayside Inn in Sudbury, Massachusetts, originally known as Howe's Tavern, was the inspiration for Longfellow's widely read book of poems, Tales of a Wayside Inn. He based his works on a group of fictitious characters that regularly gathered at the old Sudbury tavern. Lyman Howe was the character featured in The Landlord's Tale, and where Longfellow penned the immortal phrase listen my children and you shall hear, of the midnight ride of Paul Revere. See other titles by this author available from Kessinger Publishing."], "author": "Henry Wadsworth Longfellow", "num_pages": "237", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2006-12-28 00:00:00", "ISBN": "1402179049"},
{"url": "https://www.goodreads.com/book/show/3865708-deutsche-sagen", "num_ratings": "116", "num_reviews": "5", "avg_ratings": 4.14, "genres": ["European Literature", "German Literature"], "title": "Deutsche Sagen", "description": ["\"Heмcки cкaзaния\" нa извecтнитe нeмcки пиcaтeли и фoлклopиcти Якoб и Вилхeлм Гpим ca публикувaни пpeз 1816-1818. Toзи cбopник c лeгeнди, cъбpaни oт paзлични изтoчници и публикувaни в двa тoмa, ce oбoбщaвa към нaй-cтapитe eпичecки тpaдиции нa гepмaнцитe. Иcтopиитe пpeтeндиpaт дa oпиcвaт peaлни иcтopичecки cъбития, paзпoлoжeни пpиблизитeлнo във вpeмeтo. Cбopникът e oкaзaл зн", "\"Heмcки cкaзaния\" нa извecтнитe нeмcки пиcaтeли и фoлклopиcти Якoб и Вилхeлм Гpим ca публикувaни пpeз 1816-1818. Toзи cбopник c лeгeнди, cъбpaни oт paзлични изтoчници и публикувaни в двa тoмa, ce oбoбщaвa към нaй-cтapитe eпичecки тpaдиции нa гepмaнцитe. Иcтopиитe пpeтeндиpaт дa oпиcвaт peaлни иcтopичecки cъбития, paзпoлoжeни пpиблизитeлнo във вpeмeтo. Cбopникът e oкaзaл знaчитeлнo влияниe въpху худoжecтвeнaтa литepaтуpa и фoлклopиcтикaтa. Cpeднoвeкoвнитe лeгeнди ca чecтo пъти шoкиpaщи и cтpaнни дopи зa cъвpeмeнния пpeзaдoвoлeн читaтeл. Иcтopичecкoтo и пpикaзнoтo, oчapoвaниeтo и ужacът бивaт нepaзpивнo пpeплeтeни. Кaзaнo нaкpaткo, тoвa нe ca \"дeтcки и ceмeйни пpикaзки\" нa Бpaтя Гpим."], "author": "Jacob Grimm", "num_pages": "1073", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1994-12-12 00:00:00", "ISBN": "3618620209"},
{"url": "https://www.goodreads.com/book/show/830205.Sylvia_s_Lovers", "num_ratings": "3,552", "num_reviews": "154", "avg_ratings": 3.72, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Historical", "Victorian", "Literature", "19th Century", "European Literature", "British Literature"], "title": "Sylvia's Lovers", "description": ["A very powerfully moving novel of a young woman caught between the attractions of two very different men, Sylvia’s Lovers is set in the 1790s in an English seaside town. England is at war with France, and press-gangs wreak havoc by seizing young men for service. One of their victims is a whaling harpooner named Charley Kinraid, whose charm and vivacity have captured the he", "A very powerfully moving novel of a young woman caught between the attractions of two very different men, Sylvia’s Lovers is set in the 1790s in an English seaside town. England is at war with France, and press-gangs wreak havoc by seizing young men for service. One of their victims is a whaling harpooner named Charley Kinraid, whose charm and vivacity have captured the heart of Sylvia Robson. But Sylvia’s devoted cousin, Philip Hepburn, hopes to marry her himself and, in order to win her, deliberately withholds crucial information—with devastating consequences.", "The introduction discusses the novel's historical and geographical authenticity, as well as its innovative treatment of gender and human relationships", "Includes a new chronology, updated further reading, notes, and appendices"], "author": "Elizabeth Gaskell", "num_pages": "484", "awards": [], "places": ["Whitby, Yorkshire, England"], "character_names": [], "language": "English", "publish_date": "1996-11-28 00:00:00", "ISBN": "0140434224"},
{"url": "https://www.goodreads.com/book/show/2987.Hospital_Sketches", "num_ratings": "1,692", "num_reviews": "146", "avg_ratings": 3.63, "genres": ["Classics", "History", "Nonfiction", "Military History", "Civil War", "Autobiography", "Memoir"], "title": "Hospital Sketches", "description": ["Large Format for easy reading. By the author of Little Women. A collection of letters written when Alcott was a Civil War army nurse, they garnered Alcott's first critical recognition for her observations and humour."], "author": "Louisa May Alcott", "num_pages": "80", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-10-25 00:00:00", "ISBN": "1406501026"},
{"url": "https://www.goodreads.com/book/show/12907156-the-history-of-england-from-the-accession-of-james-the-second-vol-v", "num_ratings": "42", "num_reviews": "3", "avg_ratings": 3.81, "genres": ["History", "European Literature", "British Literature", "Classics"], "title": "The History of England from the Accession of James the Second Vol. V", "author": "Thomas Babington Macaulay", "num_pages": "565", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1879-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/918352.Ragged_Dick", "num_ratings": "1,882", "num_reviews": "201", "avg_ratings": 3.28, "genres": ["Fiction", "Classics", "Young Adult", "Historical", "Historical Fiction", "Literature", "19th Century", "Academic", "School"], "title": "Ragged Dick: Or, Street Life in New York with the Boot Blacks", "description": ["A plucky street boy who smokes, gambles, and speaks ungrammatically, Dick is also honest and hardworking. A quintessential novel of adventure, romance, and coming-of-age, it is also an exhilarating tale of one boy's metamorphosis from dirty street urchin to gentleman."], "author": "Horatio Alger Jr.", "num_pages": "186", "awards": [], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "2005-09-06 00:00:00", "ISBN": "0451529839"},
{"url": "https://www.goodreads.com/book/show/2426004.Paris_in_the_Twentieth_Century", "num_ratings": "1,616", "num_reviews": "171", "avg_ratings": 3.38, "genres": ["Science Fiction", "Fiction", "Classics", "Cultural", "France", "Science Fiction", "Dystopia"], "title": "Paris in the Twentieth Century", "description": ["In 1863 Jules Verne, famed author of ", " and ", ", wrote a novel that his literary agent deemed too farfetched to be published. More than one hundred years later, his great-grandson found the handwritten, never-before published manuscript in a safe. That manuscript was ", ", an astonishingly prop", "In 1863 Jules Verne, famed author of ", " and ", ", wrote a novel that his literary agent deemed too farfetched to be published. More than one hundred years later, his great-grandson found the handwritten, never-before published manuscript in a safe. That manuscript was ", ", an astonishingly prophetic view into the future by one of the most renowned science fiction writers of our time."], "author": "Jules Verne", "num_pages": "222", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-12-15 00:00:00", "ISBN": "0679444343"},
{"url": "https://www.goodreads.com/book/show/326280.Max_Havelaar", "num_ratings": "5,061", "num_reviews": "307", "avg_ratings": 3.49, "genres": ["Classics", "Fiction", "European Literature", "Dutch Literature", "Literature"], "title": "Max Havelaar: Or the Coffee Auctions of the Dutch Trading Company", "description": ["Max Havelaar - a Dutch civil servant in Java - burns with an insatiable desire to end the ill treatment and oppression inflicted on the native peoples by the colonial administration. Max is an inspirational figure, but he is also a flawed idealist whose vow to protect the Javanese from cruelty ends in his own downfall. In Max Havelaar, Multatuli (the pseudonym for Eduard D", "Max Havelaar - a Dutch civil servant in Java - burns with an insatiable desire to end the ill treatment and oppression inflicted on the native peoples by the colonial administration. Max is an inspirational figure, but he is also a flawed idealist whose vow to protect the Javanese from cruelty ends in his own downfall. In Max Havelaar, Multatuli (the pseudonym for Eduard Douwes Dekker) vividly recreated his own experiences in Java and tellingly depicts the hypocrisy of those who gained from the corrupt coffee trade. Sending shockwaves through the Dutch nation when it was published in 1860, this damning exposé of the terrible conditions in the colonies led to welfare reforms in Java and continues to inspire the fairtrade movement today.", "Roy Edwards's vibrant translation conveys the satirical and innovative style of Multatuli's autobiographical polemic. In his introduction, R. P. Meijer discusses the author's tempestuous life and career, the controversy the novel aroused and its unusual narrative structure."], "author": "Multatuli", "num_pages": "352", "awards": [], "places": ["Java"], "character_names": ["Saijah", "Adinda", "Max Havelaar"], "language": "English", "publish_date": "1987-08-27 00:00:00", "ISBN": "0140445161"},
{"url": "https://www.goodreads.com/book/show/1104192.Running_a_Thousand_Miles_for_Freedom", "num_ratings": "445", "num_reviews": "50", "avg_ratings": 3.92, "genres": ["History", "Nonfiction", "Historical", "Autobiography", "Memoir", "Biography"], "title": "Running a Thousand Miles for Freedom: The Escape of William and Ellen Craft from Slavery", "description": ["Husband and wife William and Ellen Craft's break from slavery in 1848 was perhaps the most extraordinary in American history. Numerous newspaper reports in the United States and abroad told of how the two -- fair-skinned Ellen disguised as a white slave master and William posing as her servant -- negotiated heart-pounding brushes with discovery while fleeing Macon, Georgia", "Husband and wife William and Ellen Craft's break from slavery in 1848 was perhaps the most extraordinary in American history. Numerous newspaper reports in the United States and abroad told of how the two -- fair-skinned Ellen disguised as a white slave master and William posing as her servant -- negotiated heart-pounding brushes with discovery while fleeing Macon, Georgia, for Philadelphia and eventually Boston. No account, though, conveyed the ingenuity, daring, good fortune, and love that characterized their flight for freedom better than the couple's own version, published in 1860, a remarkable authorial accomplishment only twelve years beyond illiteracy. Now their stirring first-person narrative and Richard Blackett's excellent interpretive pieces are brought together in one volume to tell the complete story of the Crafts."], "author": "Ellen Craft", "num_pages": "120", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-01-01 00:00:00", "ISBN": "080712320X"},
{"url": "https://www.goodreads.com/book/show/3284885-the-celebrated-jumping-frog-of-calaveras-county", "num_ratings": "5,735", "num_reviews": "166", "avg_ratings": 3.75, "genres": ["Classics", "Short Stories", "Fiction", "Humor"], "title": "The Celebrated Jumping Frog of Calaveras County", "description": ["The Celebrated Jumping Frog of Calaveras County” is a wild yarn involving a case of mistaken identity, a gambler who’d bet on anything, and a very unusual frog named Daniel Webster."], "author": "Mark Twain", "num_pages": "202", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1965-10-01 00:00:00", "ISBN": "0318518899"},
{"url": "https://www.goodreads.com/book/show/677591.The_Subjection_of_Women", "num_ratings": "2,158", "num_reviews": "139", "avg_ratings": 3.86, "genres": ["Philosophy", "Feminism", "Nonfiction", "Politics", "Classics", "History", "Gender"], "title": "The Subjection of Women", "description": ["..\".John Mill disagrees with the argument that women are naturally less good at some things than men, and should therefore be discouraged or forbidden from doing them. Mill Thought that men simply don't know what women are capable of, because we have never let them try - nobody can not make a statement without evidence. We can't stop women from trying things because they m", "..\".John Mill disagrees with the argument that women are naturally less good at some things than men, and should therefore be discouraged or forbidden from doing them. Mill Thought that men simply don't know what women are capable of, because we have never let them try - nobody can not make a statement without evidence. We can't stop women from trying things because they might not be able to do them. An argument based on speculative physiology is just that, speculation...\""], "author": "John Stuart Mill", "num_pages": "136", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-03-15 00:00:00", "ISBN": "1594625328"},
{"url": "https://www.goodreads.com/book/show/8125962-poems-and-ballads", "num_ratings": "52", "num_reviews": "5", "avg_ratings": 4.19, "genres": ["Poetry", "Classics", "Historical", "Victorian"], "title": "Poems and Ballads", "description": ["1884. The poet Swinburne is one of the very few, since the days of Raleigh and Sidney, to come from the aristocracy. He was also well-known for his sexual proclivities and debauched lifestyle. This volume contains a collection of his verse and sonnets. See other titles by this author available from Kessinger Publishing."], "author": "Algernon Charles Swinburne", "num_pages": "216", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-04-01 00:00:00", "ISBN": "1417910143"},
{"url": "https://www.goodreads.com/book/show/832761.Mrs_Beeton_s_Book_of_Household_Management", "num_ratings": "1,000", "num_reviews": "78", "avg_ratings": 3.81, "genres": ["Nonfiction", "History", "Classics", "Food and Drink", "Cookbooks", "Reference", "Food and Drink", "Cooking"], "title": "Mrs Beeton's Book of Household Management", "author": "Isabella Beeton", "num_pages": "672", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-05-18 00:00:00", "ISBN": "0192833456"},
{"url": "https://www.goodreads.com/book/show/267071.In_Search_of_the_Castaways_or_the_Children_of_Captain_Grant", "num_ratings": "8,977", "num_reviews": "186", "avg_ratings": 4.07, "genres": ["Classics", "Adventure", "Fiction", "Cultural", "France", "Science Fiction"], "title": "In Search of the Castaways; or the Children of Captain Grant", "description": ["ALL that could be discovered, however, on these pieces of paper was a few words here and there, the remainder of the lines being almost completely obliterated by the action of the water. Lord Glenarvan examined them attentively for a few minutes, turning them over on all sides, holding them up to the light, and trying to decipher the least scrap of writing, while the other", "ALL that could be discovered, however, on these pieces of paper was a few words here and there, the remainder of the lines being almost completely obliterated by the action of the water. Lord Glenarvan examined them attentively for a few minutes, turning them over on all sides, holding them up to the light, and trying to decipher the least scrap of writing, while the others looked on with anxious eyes."], "author": "Jules Verne", "num_pages": "432", "awards": [], "places": ["Luss, Argyll, Scotland", "Scotland"], "character_names": [], "language": "English", "publish_date": "2006-11-03 00:00:00", "ISBN": "1406923117"},
{"url": "https://www.goodreads.com/book/show/45205.No_Name", "num_ratings": "7,542", "num_reviews": "360", "avg_ratings": 3.91, "genres": ["Classics", "Fiction", "Historical", "Victorian", "Mystery", "Literature", "19th Century"], "title": "No Name", "description": ["Magdalen Vanstone and her sister Norah learn the true meaning of social stigma in Victorian England only after the traumatic discovery that their dearly loved parents, whose sudden deaths have left them orphans, were not married at the time of their birth. Disinherited by law and brutally ousted from Combe-Raven, the idyllic", "Magdalen Vanstone and her sister Norah learn the true meaning of social stigma in Victorian England only after the traumatic discovery that their dearly loved parents, whose sudden deaths have left them orphans, were not married at the time of their birth. Disinherited by law and brutally ousted from Combe-Raven, the idyllic country estate which has been their peaceful home since childhood, the two young women are left to fend for themselves. While the submissive Norah follows a path of duty and hardship as a governess, her high-spirited and rebellious younger sister has made other decisions. Determined to regain her rightful inheritance at any cost, Magdalen uses her unconventional beauty and dramatic talent in recklessly pursuing her revenge. Aided by the audacious swindler Captain Wragge, she braves a series of trials leading up to the climactic test: can she trade herself in marriage to the man she loathes?", "Written in the early 1860s, between ", " and ", ", ", " was rejected as immoral by critics of its time, but is today regarded as a novel of outstanding social insight, showing Collins at the height of his powers."], "author": "Wilkie Collins", "num_pages": "748", "awards": [], "places": ["England"], "character_names": ["Magdalen Vanstone", "Norah Vanstone", "Noel Vanstone", "Harriet Garth", "Virginie Lecount", "Horatio Wragge", "Matilda Wragge", "Andrew Vanstone", "Norah Blake Vanstone", "George Bartram", "Francis Clare", "William Pendril", "Robert Kirke"], "language": "English", "publish_date": "1998-06-25 00:00:00", "ISBN": "019283388X"},
{"url": "https://www.goodreads.com/book/show/777108.Armadale", "num_ratings": "5,215", "num_reviews": "288", "avg_ratings": 3.89, "genres": ["Classics", "Fiction", "Mystery", "Historical", "Victorian", "Literature", "19th Century"], "title": "Armadale", "description": ["The novel has a convoluted plot about two distant cousins both named Allan Armadale. The father of one had murdered the father of the other (the two fathers are also named Allan Armadale). The story starts with a deathbed confession by the murderer in the form of a letter to be given to his baby son when he grows up. Many years are skipped over. The son, mistreated at home", "The novel has a convoluted plot about two distant cousins both named Allan Armadale. The father of one had murdered the father of the other (the two fathers are also named Allan Armadale). The story starts with a deathbed confession by the murderer in the form of a letter to be given to his baby son when he grows up. Many years are skipped over. The son, mistreated at home, runs away from his mother and stepfather, and takes up a wandering life under the assumed name of Ozias Midwinter."], "author": "Wilkie Collins", "num_pages": "721", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-01-26 00:00:00", "ISBN": "0140434119"},
{"url": "https://www.goodreads.com/book/show/514761.Miss_Marjoribanks", "num_ratings": "2,146", "num_reviews": "109", "avg_ratings": 3.76, "genres": ["Classics", "Fiction", "Historical", "Victorian", "Literature", "19th Century", "Literature"], "title": "Miss Marjoribanks", "description": ["Returning home to tend her widowed father Dr. Marjoribanks, Lucilla soon launches herself into Carlingford society, aiming to raise the tone with her select Thursday evening parties.", "Optimistic, resourceful and blithely unimpeded by self-doubt, Lucilla is a superior being in every way, not least in relation to men."], "author": "Mrs. Oliphant", "num_pages": "512", "awards": [], "places": ["Carlingford, England"], "character_names": ["Lucilla Marjoribanks", "Dr. Marjoribanks"], "language": "English", "publish_date": "1998-10-29 00:00:00", "ISBN": "0140436308"},
{"url": "https://www.goodreads.com/book/show/31171.The_Life_of_Charlotte_Bront_", "num_ratings": "5,794", "num_reviews": "210", "avg_ratings": 3.89, "genres": ["Biography", "Nonfiction", "Classics", "Literature", "19th Century", "Historical", "Victorian"], "title": "The Life of Charlotte Brontë", "author": "Elizabeth Gaskell", "num_pages": "587", "awards": [], "places": [], "character_names": ["Charlotte Brontë"], "language": "English", "publish_date": "2002-06-20 00:00:00", "ISBN": "0192838059"},
{"url": "https://www.goodreads.com/book/show/703653.Autumnal_Tints", "num_ratings": "141", "num_reviews": "23", "avg_ratings": 3.99, "genres": ["Classics", "Philosophy", "Environment", "Nature", "Nonfiction", "Writing", "Essays"], "title": "Autumnal Tints", "description": ["Two institutions of New England, our fall colors and Henry David Thoreau, are brought together in this posthumously published rumination on Nature. Autumnal Tints was originally published in the October 1862 Atlantic Monthly. \"October is the month for painted leaves. Their rich glow now flashes round the world. As fruits and leaves and the day itself acquire a bright tint", "Two institutions of New England, our fall colors and Henry David Thoreau, are brought together in this posthumously published rumination on Nature. Autumnal Tints was originally published in the October 1862 Atlantic Monthly. \"October is the month for painted leaves. Their rich glow now flashes round the world. As fruits and leaves and the day itself acquire a bright tint just before they fall, so the year near its setting. October is its sunset sky; November the later twilight.\""], "author": "Henry David Thoreau", "num_pages": "64", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-10-01 00:00:00", "ISBN": "155709442X"},
{"url": "https://www.goodreads.com/book/show/267102.Framley_Parsonage", "num_ratings": "2,953", "num_reviews": "250", "avg_ratings": 4.02, "genres": ["Classics", "Fiction", "Historical", "Victorian", "Literature", "19th Century", "Literature"], "title": "Framley Parsonage", "description": ["Fourth in the Barsetshire Chronicles, FRAMLEY PARSONAGE was published in 1860. In it the values of a Victorian gentleman, the young clergyman Mark Robarts, are put to the test.", "Like much fiction of 19th century England, FRAMLEY PARSONAGE concerns property, status, family and the conventions. In it Trollope captures the essence of Victorian England."], "author": "Anthony Trollope", "num_pages": "573", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2006-11-03 00:00:00", "ISBN": "1406954098"},
{"url": "https://www.goodreads.com/book/show/18681475-first-love", "num_ratings": "7,552", "num_reviews": "499", "avg_ratings": 3.79, "genres": ["Classics", "Fiction", "Cultural", "Russia", "Literature", "Russian Literature", "Romance"], "title": "First Love", "description": ["When the down-at-heel Princess Zasyekin moves next door to the country estate of Vladimir Petrovich's parents, he instantly and overwhelmingly falls in love with his new neighbour's daughter, Zinaida. But the capricious young woman already has many admirers and as she plays her suitors against each other, Vladimir's unrequ", "When the down-at-heel Princess Zasyekin moves next door to the country estate of Vladimir Petrovich's parents, he instantly and overwhelmingly falls in love with his new neighbour's daughter, Zinaida. But the capricious young woman already has many admirers and as she plays her suitors against each other, Vladimir's unrequited youthful passion soon turns to torment and despair - although he remains unaware of his true rival for Zinaida's affections.", "Set in the world of nineteenth-century Russia's fading aristocracy, Turgenev's story depicts a boy's growth of knowledge and mastery over his own heart as he awakens to the complex nature of adult love."], "author": "Ivan Turgenev", "num_pages": "107", "awards": [], "places": ["Moscow"], "character_names": ["Vladimir Petrovich Woldemar", "Zinaida Zasyekin", "Princess Zasyekin", "Count Malevsky", "Looshin", "Maidanov", "Nirmatsky", "Byelovzorov", "Pyotr Vassilitch Woldemar"], "language": "English", "publish_date": "1979-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/782095.The_Midnight_Ride_of_Paul_Revere", "num_ratings": "2,198", "num_reviews": "114", "avg_ratings": 4.07, "genres": ["Poetry", "Classics", "Childrens", "Picture Books", "History", "Childrens", "Nonfiction"], "title": "The Midnight Ride of Paul Revere", "description": ["Longfellow's tribute to the famous revolutionary hero begins with a stirring cadence that American school children have committed to memory for over a century. Illustrator Christoper Bing adds luminous paintings, historically rich engravings, and other enrichments to Longfellow's poem, tying the fiction into the fact of what really happened on that April night."], "author": "Henry Wadsworth Longfellow", "num_pages": "40", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-10-01 00:00:00", "ISBN": "1929766130"},
{"url": "https://www.goodreads.com/book/show/146943.The_Toilers_of_the_Sea", "num_ratings": "2,592", "num_reviews": "217", "avg_ratings": 4.08, "genres": ["Classics", "Fiction", "Cultural", "France", "European Literature", "French Literature", "Literature"], "title": "The Toilers of the Sea", "description": ["A new translation by Scot James Hogarth for the first unabridged English edition of the novel, which tells the story of a reculsive fisherman from the Channel Islands who must free a ship that has run aground in order to win the hand of the woman he loves, a shipowner's daughter."], "author": "Victor Hugo", "num_pages": "480", "awards": ["French-American Foundation Translation Prize for Fiction (2002)"], "places": [], "character_names": ["Gilliatt"], "language": "English", "publish_date": "2002-09-10 00:00:00", "ISBN": "0375761322"},
{"url": "https://www.goodreads.com/book/show/7361019-value-price-and-profit", "num_ratings": "308", "num_reviews": "16", "avg_ratings": 4.09, "genres": ["Economics", "Politics", "Nonfiction", "Philosophy", "Sociology"], "title": "Value, Price and Profit", "description": ["Marxism is an economic and sociopolitical worldview and method of socioeconomic inquiry based upon a materialist interpretation of historical development, a dialectical view of social change, and an analysis of class-relations within society and their application in the analysis and critique of the development of capitalism. In the mid-to-late 19th century, the intellectua", "Marxism is an economic and sociopolitical worldview and method of socioeconomic inquiry based upon a materialist interpretation of historical development, a dialectical view of social change, and an analysis of class-relations within society and their application in the analysis and critique of the development of capitalism. In the mid-to-late 19th century, the intellectual development of Marxism was pioneered by two German philosophers, Karl Marx and Friedrich Engels. Marxist analyses and methodologies have influenced multiple political ideologies and social movements throughout history. Marxism encompasses an economic theory, a sociological theory, a philosophical method and a revolutionary view of social change."], "author": "Karl Marx", "num_pages": "64", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-03-30 00:00:00", "ISBN": "1434463117"},
{"url": "https://www.goodreads.com/book/show/67503.The_Maine_Woods", "num_ratings": "931", "num_reviews": "69", "avg_ratings": 3.88, "genres": ["Nonfiction", "Environment", "Nature", "Classics", "Philosophy", "Travel", "Autobiography", "Memoir", "Nature", "Outdoors", "Literature", "Environment", "Biography"], "title": "The Maine Woods (Writings of Henry D. Thoreau)", "description": ["Henry D. Thoreau traveled to the backwoods of Maine in 1846, 1853, and 1857. Originally published in 1864, and published now with a new introduction by Paul Theroux, this volume is a powerful telling of those journeys through a rugged and largely unspoiled land. It presents Thoreau's fullest account of the wilderness.", " is classic Thoreau: a personal story of", "Henry D. Thoreau traveled to the backwoods of Maine in 1846, 1853, and 1857. Originally published in 1864, and published now with a new introduction by Paul Theroux, this volume is a powerful telling of those journeys through a rugged and largely unspoiled land. It presents Thoreau's fullest account of the wilderness.", " is classic Thoreau: a personal story of exterior and interior discoveries in a natural setting--all conveyed in taut, masterly prose. Thoreau's evocative renderings of the life of the primitive forest--its mountains, waterways, fauna, flora, and inhabitants--are timeless and valuable on their own. But his impassioned protest against the despoilment of nature in the name of commerce and sport, which even by the 1850s threatened to deprive Americans of the \"tonic of wildness,\" makes ", " an especially vital book for our own time."], "author": "Henry David Thoreau", "num_pages": "347", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-06-13 00:00:00", "ISBN": "0691118779"},
{"url": "https://www.goodreads.com/book/show/227113.Walking", "num_ratings": "4,234", "num_reviews": "315", "avg_ratings": 3.93, "genres": ["Philosophy", "Nonfiction", "Classics", "Environment", "Nature", "Writing", "Essays"], "title": "Walking", "description": ["The philosophies of HENRY DAVID THOREAU (1817-1862)-hero to environmentalists and ecologists, profound thinker on humanity's happiness-have greatly influenced the American character, and his writings on human nature, materialism, and the natural world continue to be of profound import today. In this essay, first published in the Atlantic Monthly in 1862 and vital to any ap", "The philosophies of HENRY DAVID THOREAU (1817-1862)-hero to environmentalists and ecologists, profound thinker on humanity's happiness-have greatly influenced the American character, and his writings on human nature, materialism, and the natural world continue to be of profound import today. In this essay, first published in the Atlantic Monthly in 1862 and vital to any appreciation of the great man's work, Thoreau explores: . the joys and necessities of long afternoon walks . how spending time in untrammeled fields and woods soothes the spirit . how Nature guides us on our walks . the lure of the wild for writers and artists . why \"all good things are wild and free\" . and more. ALSO FROM COSIMO: Thoreau's Walden and Civil Disobedience"], "author": "Henry David Thoreau", "num_pages": "60", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-07-01 00:00:00", "ISBN": "1596058811"},
{"url": "https://www.goodreads.com/book/show/2102463.Lady_Macbeth_de_Mtsensk", "num_ratings": "2,780", "num_reviews": "116", "avg_ratings": 3.94, "genres": ["Cultural", "Russia", "Classics", "Literature", "Russian Literature", "Short Stories", "Fiction"], "title": "Lady Macbeth de Mtsensk", "description": ["La selección que aquí ofrecemos contiene ocho relatos de diversa extensión y ofrece una muestra representativa de arte narrativo, desde la crónica de un drama rústico brutal en Lady Macbeth de Mtsensk (relato en que se basó la conocida ópera de Shostakovich) hasta algunos episodios del \"ambiente de Petersburgo\", como La mujer belicosa o sombríos como A propósito de La sona", "La selección que aquí ofrecemos contiene ocho relatos de diversa extensión y ofrece una muestra representativa de arte narrativo, desde la crónica de un drama rústico brutal en Lady Macbeth de Mtsensk (relato en que se basó la conocida ópera de Shostakovich) hasta algunos episodios del \"ambiente de Petersburgo\", como La mujer belicosa o sombríos como A propósito de \u0093La sonata de Kreutzer\u0094."], "author": "Nikolai Leskov", "num_pages": "484", "awards": [], "places": [], "character_names": [], "language": "Spanish", "publish_date": "2003-02-27 00:00:00"},
{"url": "https://www.goodreads.com/book/show/631035.Letters_from_My_Windmill", "num_ratings": "4,555", "num_reviews": "119", "avg_ratings": 3.7, "genres": ["Classics", "Cultural", "France", "Short Stories", "Fiction", "European Literature", "French Literature"], "title": "Letters from My Windmill", "description": ["Alphonse Daudet's novels established him as the most successful writer in France by the end of the XIX century; but it was the LETTERS, first published in book form in 1869, which remained his favourite creation and has proved his most lasting.", "Throughout his working life in Paris Daudet never lost his almost umbilical attachment to Provence. These tales of that region are", "Alphonse Daudet's novels established him as the most successful writer in France by the end of the XIX century; but it was the LETTERS, first published in book form in 1869, which remained his favourite creation and has proved his most lasting.", "Throughout his working life in Paris Daudet never lost his almost umbilical attachment to Provence. These tales of that region are characterised by a tenderness and delicacy, a wistfulness and wry humour, which give moving substance to his claim that to invent, for him, was to remember."], "author": "Alphonse Daudet", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1978-06-29 00:00:00", "ISBN": "0140443347"},
{"url": "https://www.goodreads.com/book/show/1452319.Carmilla", "num_ratings": "29,640", "num_reviews": "2,058", "avg_ratings": 3.84, "genres": ["Classics", "Horror", "Paranormal", "Vampires", "Gothic", "Fiction", "Fantasy", "Lgbt"], "title": "Carmilla", "description": ["A classic Victorian vampire novella, which influenced Bram Stoker's later treatment of the vampire mythos in ", "."], "author": "J. Sheridan Le Fanu", "num_pages": "124", "awards": [], "places": ["Austria"], "character_names": [], "language": "French", "publish_date": "2004-08-01 00:00:00", "ISBN": "2253087793"},
{"url": "https://www.goodreads.com/book/show/374352.Phineas_Finn", "num_ratings": "5,616", "num_reviews": "262", "avg_ratings": 3.97, "genres": ["Classics", "Fiction", "Literature", "19th Century", "Historical", "Victorian"], "title": "Phineas Finn", "description": ["The second of Trollope's \"Palliser\" novels introduces its title character, Phineas Finn, a talented but naive doctor's son from Ireland with Parliamentary aspirations. He must make numerous practical and ethical choices regarding his career, his political beliefs, and his romantic life, in hopes of emerging with his character, reputation, and prospects intact."], "author": "Anthony Trollope", "num_pages": "752", "awards": [], "places": [], "character_names": ["Phineas Finn", "Laurence Fitzgibbon", "Violet Effingham", "Glencora Palliser", "Quintus Slide", "Marie Goesler", "Frederick, Lord Fawn", "Adelaide Palliser", "Gerard Maule", "Oswald Standish, Lord Chiltern", "Plantagenet Palliser"], "language": "English", "publish_date": "1977-09-29 00:00:00", "ISBN": "0140430857"},
{"url": "https://www.goodreads.com/book/show/242589.Orley_Farm", "num_ratings": "1,820", "num_reviews": "83", "avg_ratings": 3.92, "genres": ["Classics", "Fiction", "Historical", "Victorian", "European Literature", "British Literature", "Literature", "19th Century"], "title": "Orley Farm", "description": ["With its concern for social issues and its extensive coverage of middle-class and landed life, 'Orley Farm' is a novel that demands attention in the rich field of nineteenth-century fiction."], "author": "Anthony Trollope", "num_pages": "825", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-06-07 00:00:00", "ISBN": "0192838563"},
{"url": "https://www.goodreads.com/book/show/868385.Smoke", "num_ratings": "862", "num_reviews": "89", "avg_ratings": 3.82, "genres": ["Literature", "Russian Literature", "Cultural", "Russia", "Classics", "Fiction", "Literature"], "title": "Smoke", "description": ["Set in Baden-Baden, Smoke is Ivan Turgenev's most cosmopolitan novel. It is an exquisite study of politics and society and an enduringly poignant love story. Smoke, with its European setting, barbed wit, and visionary call for Russia to look west, became the center of a famous philosophical breach between Turgenev and Dostoevsky."], "author": "Ivan Turgenev", "num_pages": "220", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-04-19 00:00:00", "ISBN": "188598300X"},
{"url": "https://www.goodreads.com/book/show/835508.Romola", "num_ratings": "3,577", "num_reviews": "168", "avg_ratings": 3.76, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Literature", "19th Century", "Historical", "Victorian", "Cultural", "Italy"], "title": "Romola", "description": ["One of George Eliot's most ambitious and imaginative novels, Romola is set in Renaissance Florence during the turbulent years following the expulsion of the powerful Medici family during which the zealous religious reformer Savonarola rose to control the city. At its heart is Romola, the devoted daughter of a blind scholar, married to the clever but ultimately treacherous", "One of George Eliot's most ambitious and imaginative novels, Romola is set in Renaissance Florence during the turbulent years following the expulsion of the powerful Medici family during which the zealous religious reformer Savonarola rose to control the city. At its heart is Romola, the devoted daughter of a blind scholar, married to the clever but ultimately treacherous Tito whose duplicity in both love and politics threatens to destroy everything she values, and she must break away to find her own path in life. Described by Eliot as 'written with my best blood', the story of Romola's intellectual and spiritual awakening is a compelling portrayal of a Utopian heroine, played out against a turbulent historical backdrop."], "author": "George Eliot", "num_pages": "840", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-08-12 00:00:00", "ISBN": "0140434704"},
{"url": "https://www.goodreads.com/book/show/1292105.Alice_s_Adventures_Under_Ground", "num_ratings": "1,302", "num_reviews": "104", "avg_ratings": 4.16, "genres": ["Classics", "Fantasy", "Fiction", "Childrens"], "title": "Alice's Adventures Under Ground", "description": ["Source of legend and lyric, reference and conjecture, ", " is for most children pure pleasure in prose. While adults try to decipher Lewis Carroll's putative use of complex mathematical codes in the text, or debate his alleged use of opium, young readers simply dive with Alice through the rabbit hole, pursuing \"The dream-child moving through a l", "Source of legend and lyric, reference and conjecture, ", " is for most children pure pleasure in prose. While adults try to decipher Lewis Carroll's putative use of complex mathematical codes in the text, or debate his alleged use of opium, young readers simply dive with Alice through the rabbit hole, pursuing \"The dream-child moving through a land / Of wonders wild and new.\" There they encounter the White Rabbit, the Queen of Hearts, the Mock Turtle, and the Mad Hatter, among a multitude of other characters--extinct, fantastical, and commonplace creatures. Alice journeys through this Wonderland, trying to fathom the meaning of her strange experiences. But they turn out to be \"curiouser and curiouser,\" seemingly without moral or sense."], "author": "Lewis Carroll", "num_pages": "128", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1965-06-01 00:00:00", "ISBN": "0486214826"},
{"url": "https://www.goodreads.com/book/show/42573.The_Water_Babies", "num_ratings": "6,159", "num_reviews": "433", "avg_ratings": 3.36, "genres": ["Classics", "Fantasy", "Fiction", "Childrens"], "title": "The Water Babies", "description": ["Tom, a poor orphan, is employed by the villainous chimney-sweep, Grimes, to climb up inside flues to clear away the soot. While engaged in this dreadful task, he loses his way and emerges in the bedroom of Ellie, the young daughter of the house who mistakes him for a thief. He runs away, and, hot and bothered, he slips into a cooling stream, falls fast asleep, and becomes", "Tom, a poor orphan, is employed by the villainous chimney-sweep, Grimes, to climb up inside flues to clear away the soot. While engaged in this dreadful task, he loses his way and emerges in the bedroom of Ellie, the young daughter of the house who mistakes him for a thief. He runs away, and, hot and bothered, he slips into a cooling stream, falls fast asleep, and becomes a water baby.", "In this new life, he meets all sorts of aquatic creatures, including an engaging old lobster, other water babies, and at last reaches St Branden's Isle where he encounters the fierce Mrs Bedonbyasyoudid and the motherly Mrs Doasyouwouldbedoneby. After a long and arduous quest to the Other-end-of-Nowhere young Tom achieves his heart's desire."], "author": "Charles Kingsley", "num_pages": "224", "awards": ["Lewis Carroll Shelf Award (1963)"], "places": [], "character_names": ["Tom", "Mr Grimes", "Mrs Bedonebyasyoudid", "Mrs Doasyouwouldbedoneby", "Miss Ellie"], "language": "English", "publish_date": "1994-12-05 00:00:00", "ISBN": "1853261483"},
{"url": "https://www.goodreads.com/book/show/144463.The_Small_House_at_Allington", "num_ratings": "3,692", "num_reviews": "251", "avg_ratings": 4.04, "genres": ["Classics", "Fiction", "Historical", "Victorian", "Literature", "19th Century", "Literature", "Historical", "Historical Fiction"], "title": "The Small House at Allington", "description": [" is the fifth book in Anthony Trollope's Barchester series. As with all of Trollope, it is beautifully written and draws the reader into its many interwoven tales.", " is the fifth book in Anthony Trollope's Barchester series. As with all of Trollope, it is beautifully written and draws the reader into its many interwoven tales."], "author": "Anthony Trollope", "num_pages": "695", "awards": [], "places": [], "character_names": ["Adolphus Crosbie", "Lily Dale", "Isabella Dale", "John Eames", "Mrs. Dale", "Christopher Dale", "Bernard Dale", "Amelia Roper", "Mrs. Lupex", "Mr. Lupex", "Lady Dumbello", "Alexandrina De Courcy", "Plantagenet Palliser", "Earl De Guest", "Dr. James Crofts", "Joseph Cradell", "Amelia Gazebee", "Mortimer Gazebee", "Earl De Courcy"], "language": "English", "publish_date": "1991-01-31 00:00:00", "ISBN": "0140433252"},
{"url": "https://www.goodreads.com/book/show/866301.Felix_Holt", "num_ratings": "3,315", "num_reviews": "105", "avg_ratings": 3.68, "genres": ["Classics", "Fiction", "Literature", "19th Century", "Historical", "Victorian", "European Literature", "British Literature", "Historical", "Historical Fiction"], "title": "Felix Holt: The Radical", "description": ["When the young nobleman Harold Transome returns to England from the colonies with a self-made fortune, he scandalizes the town of Treby Magna with his decision to stand for Parliament as a Radical. But after the idealistic Felix Holt also returns to the town, the difference between Harold's opportunistic values and Holt's profound beliefs becomes apparent. Forthright, brus", "When the young nobleman Harold Transome returns to England from the colonies with a self-made fortune, he scandalizes the town of Treby Magna with his decision to stand for Parliament as a Radical. But after the idealistic Felix Holt also returns to the town, the difference between Harold's opportunistic values and Holt's profound beliefs becomes apparent. Forthright, brusque and driven by a firm desire to educate the working-class, Felix is at first viewed with suspicion by many, including the elegant but vain Esther Lyon, the daughter of the local clergyman. As she discovers, however, his blunt words conceal both passion and deep integrity. Soon the romantic and over-refined Esther finds herself overwhelmed by a heart-wrenching decision: whether to choose the wealthy Transome as a husband, or the impoverished but honest Felix Holt."], "author": "George Eliot", "num_pages": "545", "awards": [], "places": [], "character_names": ["Felix Holt", "Esther Lyon", "Harold Transome"], "language": "English", "publish_date": "1995-12-01 00:00:00", "ISBN": "0140434356"},
{"url": "https://www.goodreads.com/book/show/32827.From_the_Earth_to_the_Moon", "num_ratings": "19,577", "num_reviews": "660", "avg_ratings": 3.78, "genres": ["Science Fiction", "Classics", "Fiction", "Adventure"], "title": "From the Earth to the Moon", "description": ["Verne's 1865 tale of a trip to the moon is (as you'd expect from Verne) great fun, even if bits of it now seem, in retrospect, a little strange. Our rocket ship gets shot out of a cannon? To the moon? Goodness! But in other ways it's full of eerie bits of business that turned out to be very near reality: he had the cost, when you adjust for inflation, almost exactly right.", "Verne's 1865 tale of a trip to the moon is (as you'd expect from Verne) great fun, even if bits of it now seem, in retrospect, a little strange. Our rocket ship gets shot out of a cannon? To the moon? Goodness! But in other ways it's full of eerie bits of business that turned out to be very near reality: he had the cost, when you adjust for inflation, almost exactly right. There are other similarities, too. Verne's cannon was named the Columbiad; the Apollo 11 command module was named Columbia. Apollo 11 had a three-person crew, just as Verne's did; and both blasted off from the American state of Florida. Even the return to earth happened in more-or-less the same place. Coincidence -- or fact!? We say you'll have to read this story yourself to judge."], "author": "Jules Verne", "num_pages": "136", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-10-01 00:00:00", "ISBN": "1598184547"},
{"url": "https://www.goodreads.com/book/show/588747.Lady_Audley_s_Secret", "num_ratings": "17,308", "num_reviews": "945", "avg_ratings": 3.74, "genres": ["Classics", "Mystery", "Historical", "Victorian", "Fiction", "Gothic", "Literature", "19th Century"], "title": "Lady Audley's Secret", "description": ["This Victorian bestseller, along with Braddon's other famous novel, Aurora Floyd, established her as the main rival of the master of the sensational novel, Wilkie Collins. A protest against the passive, insipid 19th-century heroine, Lady Audley was described by one critic of the time as \"high-strung, full of passion, purpose, and movement.\" Her crime (the secret of the tit", "This Victorian bestseller, along with Braddon's other famous novel, Aurora Floyd, established her as the main rival of the master of the sensational novel, Wilkie Collins. A protest against the passive, insipid 19th-century heroine, Lady Audley was described by one critic of the time as \"high-strung, full of passion, purpose, and movement.\" Her crime (the secret of the title) is shown to threaten the apparently respectable middle-class world of Victorian England."], "author": "Mary Elizabeth Braddon", "num_pages": "455", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1987-08-12 00:00:00", "ISBN": "0192835203"},
{"url": "https://www.goodreads.com/book/show/47059.The_Marble_Faun", "num_ratings": "2,559", "num_reviews": "148", "avg_ratings": 3.5, "genres": ["Classics", "Fiction"], "title": "The Marble Faun", "description": ["The fragility-and the durability-of human life and art dominate this story of American expatriates in Italy in the mid-nineteenth century. Befriended by Donatello, a young Italian with the classical grace of the \"Marble Faun,\" Miriam, Hilda, and Kenyon find their pursuit of art taking a sinister turn as Miriam's unhappy past precipitates the present into tragedy. ", " Hawthorn", "The fragility-and the durability-of human life and art dominate this story of American expatriates in Italy in the mid-nineteenth century. Befriended by Donatello, a young Italian with the classical grace of the \"Marble Faun,\" Miriam, Hilda, and Kenyon find their pursuit of art taking a sinister turn as Miriam's unhappy past precipitates the present into tragedy. ", " Hawthorne's 'International Novel' dramatizes the confrontation of the Old World and the New and the uncertain relationship between the 'authentic' and the 'fake' in life as in art. The author's evocative descriptions of classic sites made The Marble Faun a favorite guidebook to Rome for Victorian tourists, but this richly ambiguous symbolic romance is also the story of a murder, and a parable of the Fall of Man. As the characters find their civilized existence disrupted by the awful consequences of impulse, Hawthorne leads his readers to question the value of Art and Culture and addresses the great evolutionary debate which was beginning to shake Victorian society."], "author": "Nathaniel Hawthorne", "num_pages": "432", "awards": [], "places": ["Italy", "Rome"], "character_names": [], "language": "English", "publish_date": "2002-03-07 00:00:00", "ISBN": "0192839764"},
{"url": "https://www.goodreads.com/book/show/17698.The_Cossacks", "num_ratings": "5,203", "num_reviews": "348", "avg_ratings": 3.79, "genres": ["Classics", "Fiction", "Cultural", "Russia", "Literature", "Russian Literature", "Literature"], "title": "The Cossacks", "description": ["This 1862 novel, in a vibrant new translation by Peter Constantine, is Tolstoy’s semiautobiographical story of young Olenin, a wealthy, disaffected Muscovite who joins the Russian army and travels to the untamed frontier of the Caucasus in search of a more authentic life. While striving to adopt the rough and ready lifestyle of the local Cossacks, Olenin falls in love with", "This 1862 novel, in a vibrant new translation by Peter Constantine, is Tolstoy’s semiautobiographical story of young Olenin, a wealthy, disaffected Muscovite who joins the Russian army and travels to the untamed frontier of the Caucasus in search of a more authentic life. While striving to adopt the rough and ready lifestyle of the local Cossacks, Olenin falls in love with a free-spirited girl whose fiancé turns out to be a formidable opponent. Showcasing the philosophical insight that would characterize Tolstoy’s later masterpieces, this long overdue translation is a revelation."], "author": "Leo Tolstoy", "num_pages": "161", "awards": [], "places": ["Caucasus", "Russian Empire"], "character_names": [], "language": "English", "publish_date": "2006-02-14 00:00:00", "ISBN": "0812975049"},
{"url": "https://www.goodreads.com/book/show/221597.Salammb_", "num_ratings": "3,800", "num_reviews": "226", "avg_ratings": 3.74, "genres": ["Classics", "Fiction", "Cultural", "France", "Historical", "Historical Fiction", "European Literature", "French Literature", "Literature", "19th Century", "Literature"], "title": "Salammbô", "description": ["An epic story of lust, cruelty, and sensuality, this historical novel is set in Carthage in the days following the First Punic War with Rome. Few French historical novels can stand comparison with ", "."], "author": "Gustave Flaubert", "num_pages": "282", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1977-04-28 00:00:00", "ISBN": "0140443282"},
{"url": "https://www.goodreads.com/book/show/49190.Uncle_Silas", "num_ratings": "5,119", "num_reviews": "378", "avg_ratings": 3.73, "genres": ["Classics", "Gothic", "Horror", "Fiction", "Mystery", "Literature", "19th Century"], "title": "Uncle Silas", "description": ["One of the most significant and intriguing Gothic novels of the Victorian period and is enjoyed today as a modern psychological thriller. In UNCLE SILAS (1864) Le Fanu brought up to date Mrs Radcliffe's earlier tales of virtue imprisoned and menacedby unscrupulous schemers. The narrator, Maud Ruthyn, is a 17 year old orphan left in the care of her fearful uncle, Silas. Tog", "One of the most significant and intriguing Gothic novels of the Victorian period and is enjoyed today as a modern psychological thriller. In UNCLE SILAS (1864) Le Fanu brought up to date Mrs Radcliffe's earlier tales of virtue imprisoned and menacedby unscrupulous schemers. The narrator, Maud Ruthyn, is a 17 year old orphan left in the care of her fearful uncle, Silas. Together with his boorish son and a sinister French governess, Silas plots to kill Maud and claim her fortune. The novel established Le Fanu as a master of horror fiction."], "author": "J. Sheridan Le Fanu", "num_pages": "477", "awards": [], "places": ["Derbyshire, England", "England"], "character_names": ["Maud Ruthyn", "Austyn Ruthyn", "Silas Ruthyn", "Madame de la Rougierre", "Lady Monica", "Dudley Ruthyn", "Dr. Bryerly", "Dickon Hawkes", "Milly Ruthyn"], "language": "English", "publish_date": "2001-06-01 00:00:00", "ISBN": "0140437460"},
{"url": "https://www.goodreads.com/book/show/78960.Good_Wives", "num_ratings": "17,858", "num_reviews": "515", "avg_ratings": 3.93, "genres": ["Classics", "Fiction", "Romance", "Historical", "Historical Fiction"], "title": "Good Wives", "description": ["Amy looked relieved, but naughty Jo took her at her word, for during the first call she sat with every limb gracefully composed, every fold correctly draped, calm as a summer sea, cool as a snowbank, and as silent as the sphinx. In vain Mrs. Chester alluded to her 'charming novel", "Amy looked relieved, but naughty Jo took her at her word, for during the first call she sat with every limb gracefully composed, every fold correctly draped, calm as a summer sea, cool as a snowbank, and as silent as the sphinx. In vain Mrs. Chester alluded to her 'charming novel', and the Misses Chester introduced parties, picnics, the opera, and the fashions. Each and all were answered by a smile, a bow, and a demure \"Yes\" or \"No\" with the chill on."], "author": "Louisa May Alcott", "num_pages": "248", "awards": [], "places": [], "character_names": ["Marmee", "Jo March", "Meg March", "Beth March", "Amy March"], "language": "English", "publish_date": "2004-06-17 00:00:00", "ISBN": "1419122126"},
{"url": "https://www.goodreads.com/book/show/329803.The_Insulted_and_Humiliated", "num_ratings": "10,796", "num_reviews": "729", "avg_ratings": 4.22, "genres": ["Classics", "Cultural", "Russia", "Literature", "Russian Literature", "Fiction"], "title": "The Insulted and Humiliated", "description": ["The Insulted & Injured, published soon after Dostoevsky's political imprisonment, clearly foreshadows his later preoccupation with unconscious psychological drives & their external effects on the lives of his characters. Where his later works carry these drives to inevitably dramatic conclusions, The Insulted & Injured confines them within the smaller boundarie", "The Insulted & Injured, published soon after Dostoevsky's political imprisonment, clearly foreshadows his later preoccupation with unconscious psychological drives & their external effects on the lives of his characters. Where his later works carry these drives to inevitably dramatic conclusions, The Insulted & Injured confines them within the smaller boundaries of everyday event.", " In this story the impulse toward self-abnegation in love, which appears so markedly in both Vanya & Natasha, isn't itself enough to direct their lives; instead, it combines with their social world & the mundane ambitions of Prince Valkovsky to defeat their hope of happiness. Of all the characters in the novel, only Natasha's lover, the Prince's son Alyosha-the person least driven to mold life to his own terms-emerges untouched.", " Here are, to a greater extent than in Dostoevsky's more familiar works, flesh-&-blood people as we see them around every day. They are made up of both good & evil, of will & acceptance. Unfailingly they command interest & illuminate understanding."], "author": "Fyodor Dostoyevsky", "num_pages": "460", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-10-20 00:00:00", "ISBN": "0898751047"},
{"url": "https://www.goodreads.com/book/show/620790.A_Long_Fatal_Love_Chase", "num_ratings": "5,206", "num_reviews": "766", "avg_ratings": 3.64, "genres": ["Classics", "Fiction", "Romance", "Gothic"], "title": "A Long Fatal Love Chase", "description": ["\"I'd gladly sell my soul to Satan for a year of freedom,\" cries Rosamond Vivian to her callous grandfather. A brooding stranger seduces her from the remote island onto his yacht. Trapped in a web of intrigue, cruelty, and deceit, she flees to Italy, France, Germany, from Paris garret to mental asylum, from convent to chateau - stalked by obsessed Phillip Tempest.", "Two years", "\"I'd gladly sell my soul to Satan for a year of freedom,\" cries Rosamond Vivian to her callous grandfather. A brooding stranger seduces her from the remote island onto his yacht. Trapped in a web of intrigue, cruelty, and deceit, she flees to Italy, France, Germany, from Paris garret to mental asylum, from convent to chateau - stalked by obsessed Phillip Tempest.", "Two years before ", ", serialized in a magazine under the alias A.M. Barnard in 1866, this was buried among the author's papers over a century."], "author": "Louisa May Alcott", "num_pages": "356", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-12-02 00:00:00", "ISBN": "0440223016"},
{"url": "https://www.goodreads.com/book/show/157687.Maldoror_and_the_Complete_Works", "num_ratings": "2,851", "num_reviews": "102", "avg_ratings": 4.27, "genres": ["Poetry", "Fiction", "Cultural", "France", "Classics", "Literature"], "title": "Maldoror and the Complete Works", "description": ["Andre Breton described ", "as -the expression of a revelation so complete it seems to exceed human potential.- Little is known about its pseudonymous author, aside from his real name (Isidore Ducasse), birth in Uruguay (1846) and early death in Paris (1870). Lautreamont bewildered his contemporaries, but the Surrealists modeled their efforts after his black humor and", "Andre Breton described ", "as -the expression of a revelation so complete it seems to exceed human potential.- Little is known about its pseudonymous author, aside from his real name (Isidore Ducasse), birth in Uruguay (1846) and early death in Paris (1870). Lautreamont bewildered his contemporaries, but the Surrealists modeled their efforts after his black humor and poetic leaps of logic, exemplified by the oft-quoted line, -As beautiful as the chance meeting on a dissecting table of a sewing machine and an umbrella.- ", " 's shocked first publisher refused to bind the sheets of the original edition--and perhaps no better invitation exists to this book, which warns the reader, -Only the few may relish this bitter fruit without danger.- This is the only complete annotated collection of Lautreamont's writings available in English, in Alexis Lykiard's superior translation. For this latest edition, Lykiard updates his introduction to include recent scholarship."], "author": "Comte de Lautréamont", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-04-30 00:00:00", "ISBN": "187897212X"},
{"url": "https://www.goodreads.com/book/show/149789.The_Last_Chronicle_of_Barset", "num_ratings": "4,626", "num_reviews": "237", "avg_ratings": 4.14, "genres": ["Classics", "Fiction", "Literature", "Literature", "19th Century"], "title": "The Last Chronicle of Barset", "description": ["When Reverend Josiah Crawley, the impoverished curate of Hogglestock, is accused of theft it causes a public scandal, sending shockwaves through the world of Barsetshire. The Crawleys desperately try to remain dignified while they are shunned by society, but the scandal threatens to tear them, and the community, apart.", "Drawing on his own childhood experience of genteel pove", "When Reverend Josiah Crawley, the impoverished curate of Hogglestock, is accused of theft it causes a public scandal, sending shockwaves through the world of Barsetshire. The Crawleys desperately try to remain dignified while they are shunned by society, but the scandal threatens to tear them, and the community, apart.", "Drawing on his own childhood experience of genteel poverty, Trollope gives a painstakingly realistic depiction of the trials of a family striving to maintain its standards at all costs. With its sensitive portrayal of the proud and self-destructive figure of Crawley, this final volume is the darkest and most complex of all the Barsetshire novels."], "author": "Anthony Trollope", "num_pages": "890", "awards": [], "places": [], "character_names": ["Josiah Crawley", "Mrs Proudie", "Mary Walker"], "language": "English", "publish_date": "2002-08-29 00:00:00", "ISBN": "0140437525"},
{"url": "https://www.goodreads.com/book/show/63038.The_Man_Who_Laughs", "num_ratings": "7,873", "num_reviews": "459", "avg_ratings": 4.22, "genres": ["Classics", "Fiction", "Cultural", "France", "Historical", "Historical Fiction", "European Literature", "French Literature"], "title": "The Man Who Laughs", "description": ["Victor Hugo's ", " (first published under the French title ", " in April 1869) is a sad and sordid tale -- not the sort of tale of the moment Hugo was known for. It starts on the night of January 29, 1690, a ten-year-old boy abandoned -- the stern men who've kept him since infancy have wearied of him. The boy wanders, barefoot and starving, through", "Victor Hugo's ", " (first published under the French title ", " in April 1869) is a sad and sordid tale -- not the sort of tale of the moment Hugo was known for. It starts on the night of January 29, 1690, a ten-year-old boy abandoned -- the stern men who've kept him since infancy have wearied of him. The boy wanders, barefoot and starving, through a snowstorm to reach a gibbet bearing the corpse of a hanged criminal. Beneath the gibbet is a ragged woman, frozen to death. The boy is about to move onward when he hears a sound within the woman's garments: He discovers an infant girl, barely alive, clutching the woman's breast. A single drop of frozen milk, resembling a pearl, is on the woman's lifeless breast..."], "author": "Victor Hugo", "num_pages": "672", "awards": [], "places": [], "character_names": ["Dea", "Gwynplaine", "Ursus"], "language": "English", "publish_date": "2006-08-19 00:00:00", "ISBN": "1934169005"},
{"url": "https://www.goodreads.com/book/show/279221.Peer_Gynt", "num_ratings": "4,397", "num_reviews": "204", "avg_ratings": 3.72, "genres": ["Plays", "Classics", "Drama", "Fiction", "Plays", "Theatre", "Poetry"], "title": "Peer Gynt", "description": ["Among the masterpieces of world literature, this early verse drama by the celebrated Norwegian playwright humorously yet profoundly explores the virtues, vices, and follies common to all humanity — as represented in the person of Peer Gynt, a charming but irresponsible young peasant. Based on Norwegian folklore and Ibsen’s own imaginative inventions, the play relates the r", "Among the masterpieces of world literature, this early verse drama by the celebrated Norwegian playwright humorously yet profoundly explores the virtues, vices, and follies common to all humanity — as represented in the person of Peer Gynt, a charming but irresponsible young peasant. Based on Norwegian folklore and Ibsen’s own imaginative inventions, the play relates the roguish life of the world-wandering Peer, who finds wealth and fame — but never happiness — although he is redeemed by love in the end.", "As the play opens the young farmer attends a wedding and meets Solveig, the woman who is eventually to be his salvation. However, the rascally Peer then kidnaps the bride and later abandons her in the wilderness. This dismal performance is followed by a string of adventures (many of which do not reflect well on Peer) in many lands. After these soul-chilling exploits, an old and embittered Peer returns to Norway, eventually finding solace in the arms of the faithful Solveig.", "Like other early Ibsen plays, such as ", " (1866) and ", " (1874), the work is imbued with poetic mysticism and romanticism, and in Peer we find a rebellious central character in search of an ultimate truth that always seems just out of reach. In this sense Peer can be seen as an alter ego of Ibsen himself, whose lifelong search for artistic and moral certainties resulted in the great later plays (", " etc.) upon which his reputation chiefly rests. This rich, poetic version of ", " is considered the standard translation."], "author": "Henrik Ibsen", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-05-07 00:00:00", "ISBN": "0486426866"},
{"url": "https://www.goodreads.com/book/show/24213.Alice_s_Adventures_in_Wonderland_Through_the_Looking_Glass", "num_ratings": "408,000", "num_reviews": "9,088", "avg_ratings": 4.07, "genres": ["Classics", "Fantasy", "Fiction", "Childrens"], "title": "Alice's Adventures in Wonderland & Through the Looking-Glass", "description": ["Weary of her storybook, one \"without pictures or conversations,\" the young and imaginative Alice follows a hasty hare underground--to come face-to-face with some of the strangest adventures and most fantastic characters in all of literature. ", "The Ugly Duchess, the Mad Hatter, the weeping Mock Turtle, the diabolical Queen of Hearts, the Cheshire Cat--each more eccentric than", "Weary of her storybook, one \"without pictures or conversations,\" the young and imaginative Alice follows a hasty hare underground--to come face-to-face with some of the strangest adventures and most fantastic characters in all of literature. ", "The Ugly Duchess, the Mad Hatter, the weeping Mock Turtle, the diabolical Queen of Hearts, the Cheshire Cat--each more eccentric than the last--could only have come from that master of sublime nonsense, Lewis Carroll. ", "In penning this brilliant burlesque of children's literature, Carroll has written a farcical satire of rigid Victorian society, an arresting parody of the fears, anxieties, and complexities of growing up. ", "Carroll was one of the few adult writers to successfully enter the children's world of make-believe: where the impossible becomes possible, the unreal--real, and where the height of adventure is limited only by the depths of imagination."], "author": "Lewis Carroll", "num_pages": "239", "awards": [], "places": ["United Kingdom", "England", "Wonderland"], "character_names": ["The Hatter", "The Queen of Hearts", "The Cheshire Cat", "White Rabbit", "Humpty Dumpty", "Tweedledum and Tweedledee", "The Dormouse", "The Red Queen", "The White Queen", "The White Knight", "The Mock Turtle", "The Jabberwock", "The Caterpillar", "Alice", "Dinah (Alice's cat)", "The March Hare (Zenescope)"], "language": "English", "publish_date": "2000-12-01 00:00:00", "ISBN": "0451527747"},
{"url": "https://www.goodreads.com/book/show/6448672-the-celebrated-jumping-frog-of-calaveras-county-and-other-sketches", "num_ratings": "628", "num_reviews": "56", "avg_ratings": 3.72, "genres": ["Short Stories", "Fiction", "Humor", "Classics"], "title": "The Celebrated Jumping Frog of Calaveras County, and Other Sketches", "description": ["This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally importan", "This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally important and have elected to bring the book back into print as part of our continuing commitment to the preservation of printed works worldwide."], "author": "Mark Twain", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-02-11 00:00:00", "ISBN": "1103337637"},
{"url": "https://www.goodreads.com/book/show/374371.Can_You_Forgive_Her_", "num_ratings": "5,613", "num_reviews": "500", "avg_ratings": 3.94, "genres": ["Classics", "Fiction", "Historical", "Victorian", "Literature", "19th Century", "Historical", "Historical Fiction", "Literature"], "title": "Can You Forgive Her?", "description": ["Alice Vavasor cannot decide whether to marry her ambitious but violent cousin George or the upright and gentlemanly John Grey - and finds herself accepting and rejecting each of them in turn. ", "Increasingly confused about her own feelings and unable to forgive herself for such vacillation, her situation is contrasted with that of her friend Lady Glencora - forced to marry th", "Alice Vavasor cannot decide whether to marry her ambitious but violent cousin George or the upright and gentlemanly John Grey - and finds herself accepting and rejecting each of them in turn. ", "Increasingly confused about her own feelings and unable to forgive herself for such vacillation, her situation is contrasted with that of her friend Lady Glencora - forced to marry the rising politician Plantagenet Palliser in order to prevent the worthless Burgo Fitzgerald from wasting her vast fortune.", "In asking his readers to pardon Alice for her transgression of the Victorian moral code, Trollope created a telling and wide-ranging account of the social world of his day."], "author": "Anthony Trollope", "num_pages": "847", "awards": [], "places": [], "character_names": ["John Grey", "Alice Vavasor", "Kate Vavasor", "George Vavasor", "Glencora Palliser", "Plantagenet Palliser"], "language": "English", "publish_date": "1974-06-27 00:00:00", "ISBN": "0140430865"},
{"url": "https://www.goodreads.com/book/show/430788.Goblin_Market", "num_ratings": "9,380", "num_reviews": "295", "avg_ratings": 4.08, "genres": ["Poetry", "Classics", "Fantasy", "Literature", "Female Authors", "Academic", "School"], "title": "Goblin Market", "description": ["Experience the temptation, pleasure, punishment, and redemption of Christina Rossetti's brilliant poetic masterpiece in this classic keepsake edition, gorgeously illustrated with Pre-Raphaelite paintings by Christina's brother, Dante Gabriel Rossetti. Published in 1862, this phantasmagoric tale of two maidens seduced by lewd goblin men provides a startling glimpse into the", "Experience the temptation, pleasure, punishment, and redemption of Christina Rossetti's brilliant poetic masterpiece in this classic keepsake edition, gorgeously illustrated with Pre-Raphaelite paintings by Christina's brother, Dante Gabriel Rossetti. Published in 1862, this phantasmagoric tale of two maidens seduced by lewd goblin men provides a startling glimpse into the depths of the Victorian psyche. Full color throughout ."], "author": "Christina Rossetti", "num_pages": "70", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-10-01 00:00:00", "ISBN": "0811816494"},
{"url": "https://www.goodreads.com/book/show/73960.Lorna_Doone", "num_ratings": "13,588", "num_reviews": "546", "avg_ratings": 3.72, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Romance"], "title": "Lorna Doone", "description": ["A romantic adventure story set in south-west England in the 1600s. John Ridd swears revenge upon the evil Carver Doone who murdered his father. But who is the beautiful young girl he meets in Doone Valley?"], "author": "R.D. Blackmore", "num_pages": "750", "awards": [], "places": ["Exmoor"], "character_names": ["John Ridd", "Lorna Doone", "Carver Doone"], "language": "English", "publish_date": "2006-09-28 00:00:00", "ISBN": "0143039326"},
{"url": "https://www.goodreads.com/book/show/152519.Incidents_in_the_Life_of_a_Slave_Girl", "num_ratings": "35,558", "num_reviews": "1,911", "avg_ratings": 4.09, "genres": ["Nonfiction", "History", "Classics", "Biography", "Autobiography", "Memoir", "Cultural", "African American", "Historical", "Biography", "Autobiography", "Academic", "School", "North American Hi...", "American History"], "title": "Incidents in the Life of a Slave Girl", "description": ["The true story of an individual's struggle for self-identity, self-preservation, and freedom, ", " remains among the few extant slave narratives written by a woman. This autobiographical account chronicles the remarkable odyssey of Harriet Jacobs (1813–1897) whose dauntless spirit and faith carried her from a life of servitude and degradati", "The true story of an individual's struggle for self-identity, self-preservation, and freedom, ", " remains among the few extant slave narratives written by a woman. This autobiographical account chronicles the remarkable odyssey of Harriet Jacobs (1813–1897) whose dauntless spirit and faith carried her from a life of servitude and degradation in North Carolina to liberty and reunion with her children in the North.", "Written and published in 1861 after Jacobs' harrowing escape from a vile and predatory master, the memoir delivers a powerful and unflinching portrayal of the abuses and hypocrisy of the master-slave relationship. Jacobs writes frankly of the horrors she suffered as a slave, her eventual escape after several unsuccessful attempts, and her seven years in self-imposed exile, hiding in a coffin-like \"garret\" attached to her grandmother's porch.", "A rare firsthand account of a courageous woman's determination and endurance, this inspirational story also represents a valuable historical record of the continuing battle for freedom and the preservation of family."], "author": "Harriet Ann Jacobs", "num_pages": "176", "awards": [], "places": ["North Carolina"], "character_names": ["Harriet Ann Jacobs"], "language": "English", "publish_date": "2001-11-09 00:00:00", "ISBN": "0486419312"},
{"url": "https://www.goodreads.com/book/show/33507.Twenty_Thousand_Leagues_Under_the_Sea", "num_ratings": "162,566", "num_reviews": "5,254", "avg_ratings": 3.87, "genres": ["Classics", "Science Fiction", "Fiction", "Adventure", "Fantasy", "Literature", "Cultural", "France", "Science Fiction", "Steampunk", "Novels", "Literature", "19th Century"], "title": "Twenty Thousand Leagues Under the Sea", "description": ["French naturalist Dr. Aronnax embarks on an expedition to hunt down a sea monster, only to discover instead the ", " a remarkable submarine built by the enigmatic Captain Nemo. Together Nemo and Aronnax explore the underwater marvels, undergo a transcendent experience amongst the ruins of Atlantis, and plant a black flag at the South Pole. But Nemo's mission is one of", "French naturalist Dr. Aronnax embarks on an expedition to hunt down a sea monster, only to discover instead the ", " a remarkable submarine built by the enigmatic Captain Nemo. Together Nemo and Aronnax explore the underwater marvels, undergo a transcendent experience amongst the ruins of Atlantis, and plant a black flag at the South Pole. But Nemo's mission is one of revenge-and his methods coldly efficient."], "author": "Jules Verne", "num_pages": "394", "awards": [], "places": ["Antarctica", "Bahamas", "Indian Ocean", "Pacific Ocean"], "character_names": ["Captain Nemo", "Pierre Aronnax", "Ned Land"], "language": "English", "publish_date": "2002-04-01 00:00:00", "ISBN": "076072850X"},
{"url": "https://www.goodreads.com/book/show/2443.The_Innocents_Abroad", "num_ratings": "9,804", "num_reviews": "817", "avg_ratings": 3.86, "genres": ["Travel", "Classics", "Nonfiction", "Humor"], "title": "The Innocents Abroad", "description": ["is one of the most prominent and influential travel books ever written about Europe and the Holy Land."], "author": "Mark Twain", "num_pages": "560", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-02-11 00:00:00", "ISBN": "0812967054"},
{"url": "https://www.goodreads.com/book/show/12857.The_Gambler", "num_ratings": "38,847", "num_reviews": "1,803", "avg_ratings": 3.88, "genres": ["Classics", "Fiction", "Cultural", "Russia", "Literature", "Russian Literature", "Literature"], "title": "The Gambler", "description": ["In this dark and compelling short novel, Fyodor Dostoevsky tells the story of Alexey Ivanovitch, a young tutor working in the household of an imperious Russian general. Alexey tries to break through the wall of the established order in Russia, but instead becomes mired in the endless downward spiral of betting and loss. His intense and inescapable addiction is accentuated", "In this dark and compelling short novel, Fyodor Dostoevsky tells the story of Alexey Ivanovitch, a young tutor working in the household of an imperious Russian general. Alexey tries to break through the wall of the established order in Russia, but instead becomes mired in the endless downward spiral of betting and loss. His intense and inescapable addiction is accentuated by his affair with the General’s cruel yet seductive niece, Polina. In ", ", Dostoevsky reaches the heights of drama with this stunning psychological portrait."], "author": "Fyodor Dostoyevsky", "num_pages": "188", "awards": ["National Book Award Finalist for Translation (1973)"], "places": [], "character_names": ["Alexei Ivanovich", "Polina Aleksandrovna"], "language": "English", "publish_date": "2003-04-08 00:00:00", "ISBN": "0812966937"},
{"url": "https://www.goodreads.com/book/show/17877.The_House_of_the_Dead", "num_ratings": "14,356", "num_reviews": "990", "avg_ratings": 4.04, "genres": ["Classics", "Fiction", "Cultural", "Russia", "Literature", "Russian Literature", "Literature", "Novels", "Literature", "19th Century", "Classics", "Classic Literature", "Literary Fiction", "Historical", "Historical Fiction"], "title": "The House of the Dead", "description": ["Accused of political subversion as a young man, Fyodor Dostoyevsky was sentenced to four years of hard labor at a Siberian prison camp — a horrifying experience from which he developed this astounding semi-autobiographical memoir of a man condemned to ten years of servitude for murdering his wife.", "As with a number of the author's other works, this profoundly influential nov", "Accused of political subversion as a young man, Fyodor Dostoyevsky was sentenced to four years of hard labor at a Siberian prison camp — a horrifying experience from which he developed this astounding semi-autobiographical memoir of a man condemned to ten years of servitude for murdering his wife.", "As with a number of the author's other works, this profoundly influential novel brilliantly explores his characters' thoughts while probing the depths of the human soul. Describing in relentless detail the physical and mental suffering of the convicts, Dostoyevsky's character never loses faith in human qualities and the goodness of man.", "A haunting and remarkable work filled with wonder and resignation, ", " ranks among the Russian novelist's greatest masterpieces. Of this powerful autobiographical novel, Tolstoy wrote, \"I know no better book in all modern literature.\""], "author": "Fyodor Dostoyevsky", "num_pages": "247", "awards": [], "places": ["Russian Federation", "Siberia"], "character_names": ["Aleksandr Petrovich Goryanchikov"], "language": "English", "publish_date": "2004-04-22 00:00:00", "ISBN": "0486434095"},
{"url": "https://www.goodreads.com/book/show/23660930-the-flowers-of-evil", "num_ratings": "39,337", "num_reviews": "1,065", "avg_ratings": 4.26, "genres": ["Poetry", "Classics", "Cultural", "France", "European Literature", "French Literature"], "title": "The Flowers of Evil", "description": ["Charles Baudelaire’s Les Fleurs du Mal marked an important turning point in the history of world poetry, providing a crucial link between romanticism and modernism. This brand new translation, completed in 2014, preserves the metre and rhyme scheme of each original poem. Some of the poems are very beautiful, while others are not for the faint-hearted. Taken as a whole, the", "Charles Baudelaire’s Les Fleurs du Mal marked an important turning point in the history of world poetry, providing a crucial link between romanticism and modernism. This brand new translation, completed in 2014, preserves the metre and rhyme scheme of each original poem. Some of the poems are very beautiful, while others are not for the faint-hearted. Taken as a whole, they convey the 'spleen' or 'ennui' which Baudelaire felt so keenly, a state of mind that echoes the 'mal du siècle' of early 19th century France."], "author": "Charles Baudelaire", "num_pages": "346", "awards": ["National Book Award for Translation (1983)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-11-22 00:00:00", "ISBN": "1503217701"},
{"url": "https://www.goodreads.com/book/show/1519706.Po_mes_Saturniens", "num_ratings": "1,832", "num_reviews": "28", "avg_ratings": 4.14, "genres": ["Poetry", "Cultural", "France", "Classics", "European Literature", "French Literature"], "title": "Poèmes Saturniens", "description": ["Des Poèmes saturniens, entendons qu’ils sont placés sous le signe de Saturne. Ils seront donc inspirés : il n’était pas inutile de l’affirmer alors que régnaient encore des versificateurs parnassiens. Ils seront aussi baignés d’une rêverie douce et savante, tandis que le poète tournera son regard vers l’intérieur. Point ou peu de récits ou d’anecdotes. Ici l’on se souvient", "Des Poèmes saturniens, entendons qu’ils sont placés sous le signe de Saturne. Ils seront donc inspirés : il n’était pas inutile de l’affirmer alors que régnaient encore des versificateurs parnassiens. Ils seront aussi baignés d’une rêverie douce et savante, tandis que le poète tournera son regard vers l’intérieur. Point ou peu de récits ou d’anecdotes. Ici l’on se souvient, l’espace d’un sonnet, sur un air de chanson grise. Tout semble simple. Tout est savant, mais d’une technique si maîtrisée qu’elle a cessé d’être visible, au point que beaucoup s’y sont trompés. Verlaine est un poète à la fois immédiat et difficile. Il exige donc une annotation riche et précise, une attention à la langue et à la prosodie, alors, mais alors seulement, comme l’avait dit à peu près Ovide : « Maintenant, va, mon Livre, où le hasard te mène ! »", "Édition commentée et annotée par Martine Bercot."], "author": "Paul Verlaine", "num_pages": "222", "awards": [], "places": [], "character_names": [], "language": "French", "publish_date": "1996-10-01 00:00:00", "ISBN": "2253098302"},
{"url": "https://www.goodreads.com/book/show/31244.Our_Mutual_Friend", "num_ratings": "22,934", "num_reviews": "1,221", "avg_ratings": 4.06, "genres": ["Classics", "Fiction", "Literature"], "title": "Our Mutual Friend", "description": ["A satiric masterpiece about the allure and peril of money, ", " revolves around the inheritance of a dust-heap where the rich throw their trash. When the body of John Harmon, the dust-heap’s expected heir, is found in the Thames, fortunes change hands surprisingly, raising to new heights “Noddy” Boffin, a low-born but kindly clerk who becomes “the Golden Dustm", "A satiric masterpiece about the allure and peril of money, ", " revolves around the inheritance of a dust-heap where the rich throw their trash. When the body of John Harmon, the dust-heap’s expected heir, is found in the Thames, fortunes change hands surprisingly, raising to new heights “Noddy” Boffin, a low-born but kindly clerk who becomes “the Golden Dustman.” Charles Dickens’s last complete novel, ", " encompasses the great themes of his earlier works: the pretensions of the nouveaux riches, the ingenuousness of the aspiring poor, and the unfailing power of wealth to corrupt all who crave it. With its flavorful cast of characters and numerous subplots, ", " is one of Dickens’s most complex—and satisfying—novels."], "author": "Charles Dickens", "num_pages": "801", "awards": [], "places": [], "character_names": ["Jenny Wren", "Jesse Hexam", "Lizzie Hexam", "Charley Hexam", "Roger Riderhood", "Pleasant Riderhood", "John Harmon", "Bella Wilfer", "Hamilton Veneering", "Anastatia Veneering", "Melvin Twemlow", "Eugene Wrayburn", "Mortimer Lightwood", "Lady Tippins", "John Podsnap", "Mrs. Podsnap", "Georgiana Podsnap", "Nicodemus Boffin", "Henrietta Boffin", "Reginald Wilfer", "Mrs. Wilfer", "Lavinia Wilfer", "Alfred Lammle", "Sophronia Lammle", "Abbey Potterson", "Bob Gliddery", "Silas Wegg", "Mr. Venus", "George Sampson", "Bradley Headstone", "Emma Peecher", "Sloppy", "Betty Higden", "Mr. Fledgeby", "Mr. Riah"], "language": "English", "publish_date": "2002-09-10 00:00:00", "ISBN": "0375761144"},
{"url": "https://www.goodreads.com/book/show/110871.Th_r_se_Raquin", "num_ratings": "16,498", "num_reviews": "1,219", "avg_ratings": 3.71, "genres": ["Classics", "Fiction", "Cultural", "France", "European Literature", "French Literature"], "title": "Thérèse Raquin", "description": ["One of Zola's most famous realistic novels, ", " is a clinically observed, sinister tale of adultery and murder among the lower classes in nineteenth-century Parisian society.", "Set in the claustrophobic atmosphere of a dingy haberdasher's shop in the passage du Pont-Neuf in Paris, this powerful novel tells how the heroine and her lover, Laurent, kill her husband, C", "One of Zola's most famous realistic novels, ", " is a clinically observed, sinister tale of adultery and murder among the lower classes in nineteenth-century Parisian society.", "Set in the claustrophobic atmosphere of a dingy haberdasher's shop in the passage du Pont-Neuf in Paris, this powerful novel tells how the heroine and her lover, Laurent, kill her husband, Camille, but are subsequently haunted by visions of the dead man and prevented from enjoying the fruits of their crime.", "Zola's shocking tale dispassionately dissects the motivations of his characters--mere \"human beasts\", who kill in order to satisfy their lust--and stands as a key manifesto of the French Naturalist movement, of which the author was the founding father. Published in 1867, this is Zola's most important work before the Rougon-Macquart series and introduces many of the themes that can be traced through the later novel cycle."], "author": "Émile Zola", "num_pages": "201", "awards": [], "places": ["Paris"], "character_names": [], "language": "English", "publish_date": "2004-07-29 00:00:00", "ISBN": "0140449442"},
{"url": "https://www.goodreads.com/book/show/2183.Sentimental_Education", "num_ratings": "15,207", "num_reviews": "590", "avg_ratings": 3.83, "genres": ["Classics", "Fiction", "Cultural", "France", "European Literature", "French Literature", "Literature", "19th Century"], "title": "Sentimental Education", "description": ["Based on Flaubert’s own youthful passion for an older woman, Sentimental Education was described by its author as “the moral history of the men of my generation.” It follows the amorous adventures of Frederic Moreau, a law student who, returning home to Normandy from Paris, notices Mme Arnoux, a slender, dark woman several years older than himself. It is the beginning of a", "Based on Flaubert’s own youthful passion for an older woman, Sentimental Education was described by its author as “the moral history of the men of my generation.” It follows the amorous adventures of Frederic Moreau, a law student who, returning home to Normandy from Paris, notices Mme Arnoux, a slender, dark woman several years older than himself. It is the beginning of an infatuation that will last a lifetime. He befriends her husband, an influential businessman, and as their paths cross and re-cross over the years, Mme Arnoux remains the constant, unattainable love of Moreau’s life. Blending love story, historical authenticity, and satire, Sentimental Education is one of the great French novels of the nineteenth century."], "author": "Gustave Flaubert", "num_pages": "460", "awards": [], "places": ["France"], "character_names": ["Frédéric Moreau", "Mme Arnoux", "Marthe Arnoux", "Charles Deslauriers", "Mme Dambreuse"], "language": "English", "publish_date": "2004-02-05 00:00:00", "ISBN": "0140447970"},
{"url": "https://www.goodreads.com/book/show/49455.Notes_from_Underground", "num_ratings": "48,074", "num_reviews": "3,086", "avg_ratings": 4.17, "genres": ["Classics", "Fiction", "Cultural", "Russia", "Philosophy", "Literature", "Russian Literature", "Literature"], "title": "Notes from Underground", "description": ["Dostoevsky’s most revolutionary novel, Notes from Underground marks the dividing line between nineteenth- and twentieth-century fiction, and between the visions of self each century embodied. One of the most remarkable characters in literature, the unnamed narrator is a former official who has defiantly withdrawn into an underground existence. In full retreat from society,", "Dostoevsky’s most revolutionary novel, Notes from Underground marks the dividing line between nineteenth- and twentieth-century fiction, and between the visions of self each century embodied. One of the most remarkable characters in literature, the unnamed narrator is a former official who has defiantly withdrawn into an underground existence. In full retreat from society, he scrawls a passionate, obsessive, self-contradictory narrative that serves as a devastating attack on social utopianism and an assertion of man’s essentially irrational nature.", "Richard Pevear and Larissa Volokhonsky, whose Dostoevsky translations have become the standard, give us a brilliantly faithful edition of this classic novel, conveying all the tragedy and tormented comedy of the original."], "author": "Fyodor Dostoyevsky", "num_pages": "136", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-09-12 00:00:00", "ISBN": "067973452X"},
{"url": "https://www.goodreads.com/book/show/1066576.Max_and_Moritz", "num_ratings": "4,434", "num_reviews": "98", "avg_ratings": 3.85, "genres": ["European Literature", "German Literature", "Classics", "Childrens", "Fiction"], "title": "Max and Moritz: With Many More Mischief Makers", "description": ["Wilhelm Busch (1832-1908), endowed with an equipotent facility with sketch-pad and rhyming dictionary, created some of the most arresting sketches and drollest verses the world has yet seen.", "In addition to the title piece, this book reprints “Ker and Plunk” (Plisch und Plum), “The Egghead and the Two Cut-ups of Corinth” (Diogenes and die bösen Buben von Korinth), “The Raven", "Wilhelm Busch (1832-1908), endowed with an equipotent facility with sketch-pad and rhyming dictionary, created some of the most arresting sketches and drollest verses the world has yet seen.", "In addition to the title piece, this book reprints “Ker and Plunk” (Plisch und Plum), “The Egghead and the Two Cut-ups of Corinth” (Diogenes and die bösen Buben von Korinth), “The Raven-robbin’ Rascals” (Das Rabennest), “Deceitful Henry” (Der hinterlistige Heinrich), “The Boy and the Popgun” (Das Pusterrohr), “Ice-Peter” (Der Eispeter), “The Boy and the Pipe” (Krischan mit der Piepe), “Firm Faith” (Fester Glauben), “The Two Ducks and the Frog” (Die beiden Enten und der Frosch), and “Cat and Mouse” (Katze und Maus).", "By turns malevolent, jovial, sardonic, diabolical, and bloodthirsty, these verses tellingly castigate hypocrisy, stodginess, stupidity, egotism, drunkenness, and other human foibles. The English translations, printed opposite the original German, are ingenious and faithful, with spice and sense both intact."], "author": "Wilhelm Busch", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1962-06-01 00:00:00", "ISBN": "0486201813"},
{"url": "https://www.goodreads.com/book/show/6324090-alice-s-adventures-in-wonderland", "num_ratings": "131,454", "num_reviews": "6,370", "avg_ratings": 4.0, "genres": ["Classics", "Fantasy", "Fiction", "Childrens"], "title": "Alice's Adventures in Wonderland", "description": ["After a tumble down the rabbit hole, Alice finds herself far away from home in the absurd world of Wonderland. As mind-bending as it is delightful, Lewis Carroll’s 1865 novel is pure magic for young and old alike."], "author": "Lewis Carroll", "num_pages": "96", "awards": [], "places": [], "character_names": ["Alice"], "language": "English", "publish_date": "1997-05-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/383206.Wives_and_Daughters", "num_ratings": "37,315", "num_reviews": "2,060", "avg_ratings": 4.08, "genres": ["Classics", "Fiction", "Romance", "Historical", "Historical Fiction", "Literature", "19th Century"], "title": "Wives and Daughters", "description": ["Set in English society before the 1832 Reform Bill, ", " centres on the story of youthful Molly Gibson, brought up from childhood by her father. When he remarries, a new step-sister enters Molly's quiet life – loveable, but worldly and troubling, Cynthia. The narrative traces the development of the two girls into womanhood within the gossiping and watchful s", "Set in English society before the 1832 Reform Bill, ", " centres on the story of youthful Molly Gibson, brought up from childhood by her father. When he remarries, a new step-sister enters Molly's quiet life – loveable, but worldly and troubling, Cynthia. The narrative traces the development of the two girls into womanhood within the gossiping and watchful society of Hollingford.", " is far more than a nostalgic evocation of village life; it offers an ironic critique of mid-Victorian society. 'No nineteenth-century novel contains a more devastating rejection than this of the Victorian male assumption of moral authority', writes Pam Morris in her introduction to this new edition, in which she explores the novel's main themes – the role of women, Darwinism and the concept of Englishness – and its literary and social context."], "author": "Elizabeth Gaskell", "num_pages": "679", "awards": [], "places": ["United Kingdom"], "character_names": ["Molly Gibson", "Roger Hamley", "Cynthia Kirkpatrick"], "language": "English", "publish_date": "1996-05-30 00:00:00", "ISBN": "014043478X"},
{"url": "https://www.goodreads.com/book/show/32829.Journey_to_the_Center_of_the_Earth", "num_ratings": "122,029", "num_reviews": "3,939", "avg_ratings": 3.85, "genres": ["Classics", "Science Fiction", "Fiction", "Adventure", "Fantasy"], "title": "Journey to the Center of the Earth", "description": ["The intrepid Professor Liedenbrock embarks upon the strangest expedition of the nineteenth century: a journey down an extinct Icelandic volcano to the Earth's very core. In his quest to penetrate the planet's primordial secrets, the geologist--together with his quaking nephew Axel and their devoted guide, Hans--discovers an astonishing subterranean menagerie of prehistoric", "The intrepid Professor Liedenbrock embarks upon the strangest expedition of the nineteenth century: a journey down an extinct Icelandic volcano to the Earth's very core. In his quest to penetrate the planet's primordial secrets, the geologist--together with his quaking nephew Axel and their devoted guide, Hans--discovers an astonishing subterranean menagerie of prehistoric proportions. Verne's imaginative tale is at once the ultimate science fiction adventure and a reflection on the perfectibility of human understanding and the psychology of the questor."], "author": "Jules Verne", "num_pages": "240", "awards": [], "places": ["Hamburg", "Reykjavik (Reykjavík)", "Snæfellsjökull", "Inside Earth", "Stromboli"], "character_names": ["Axel", "Otto Liedenbrock", "Hans Bjelke", "Gräuben"], "language": "English", "publish_date": "2006-04-25 00:00:00", "ISBN": "0553213970"},
{"url": "https://www.goodreads.com/book/show/20564.The_Mill_on_the_Floss", "num_ratings": "42,738", "num_reviews": "1,620", "avg_ratings": 3.78, "genres": ["Classics", "Fiction", "Literature", "19th Century", "Literature"], "title": "The Mill on the Floss", "description": ["Brought up at Dorlcote Mill, Maggie Tulliver worships her brother Tom and is desperate to win the approval of her parents, but her passionate, wayward nature and her fierce intelligence bring her into constant conflict with her family. As she reaches adulthood, the clash between their expectations and her desires", "Brought up at Dorlcote Mill, Maggie Tulliver worships her brother Tom and is desperate to win the approval of her parents, but her passionate, wayward nature and her fierce intelligence bring her into constant conflict with her family. As she reaches adulthood, the clash between their expectations and her desires is painfully played out as she finds herself torn between her relationships with three very different men: her proud and stubborn brother, a close friend who is also the son of her family's worst enemy, and a charismatic but dangerous suitor. With its poignant portrayal of sibling relationships, The Mill on the Floss is considered George Eliot's most autobiographical novel; it is also one of her most powerful and moving.", "In this edition writer and critic A.S. Byatt provides full explanatory notes and an introduction relating ", " to George Eliot's own life and times.", "Edited with an introduction and notes by A.S. BYATT"], "author": "George Eliot", "num_pages": "579", "awards": [], "places": ["St. Ogg's"], "character_names": ["Maggie Tulliver", "Tom Tulliver"], "language": "English", "publish_date": "2003-02-27 00:00:00", "ISBN": "0141439629"},
{"url": "https://www.goodreads.com/book/show/6138.The_Moonstone", "num_ratings": "63,828", "num_reviews": "3,684", "avg_ratings": 3.9, "genres": ["Classics", "Mystery", "Fiction"], "title": "The Moonstone", "description": ["\"The Moonstone is a page-turner,\" writes Carolyn Heilbrun. \"It catches one up and unfolds its amazing story through the recountings of its several narrators, all of them enticing and singular.\" Wilkie Collins’s spellbinding tale of romance, theft, and murder inspired a hugely popular genre–the detective mystery. Hinging on the theft of an enormous diamond originally stolen", "\"The Moonstone is a page-turner,\" writes Carolyn Heilbrun. \"It catches one up and unfolds its amazing story through the recountings of its several narrators, all of them enticing and singular.\" Wilkie Collins’s spellbinding tale of romance, theft, and murder inspired a hugely popular genre–the detective mystery. Hinging on the theft of an enormous diamond originally stolen from an Indian shrine, this riveting novel features the innovative Sergeant Cuff, the hilarious house steward Gabriel Betteridge, a lovesick housemaid, and a mysterious band of Indian jugglers.", "This Modern Library Paperback Classic is set from the definitive 1871 edition."], "author": "Wilkie Collins", "num_pages": "528", "awards": [], "places": ["United Kingdom"], "character_names": ["Franklin Blake", "Rachel Verinder", "Godfrey Ablewhite", "Gabriel Betteredge", "Rosanna Spearman", "Drusilla Clack", "Mathew Bruff", "Lady Verinder", "Sergeant Cuff", "Dr. Candy", "Ezra Jennings", "Octavius Guy", "Penelope Betteredge"], "language": "English", "publish_date": "2001-09-11 00:00:00", "ISBN": "0375757856"},
{"url": "https://www.goodreads.com/book/show/54539.Silas_Marner", "num_ratings": "61,027", "num_reviews": "2,965", "avg_ratings": 3.61, "genres": ["Classics", "Fiction", "Literature", "Historical", "Historical Fiction"], "title": "Silas Marner", "description": ["George Eliot's tale of a solitary miser gradually redeemed by the joy of fatherhood, ", " is edited with an introduction and notes by David Carroll in Penguin Classics.", "Wrongly accused of theft and exiled from a religious community many years before, the embittered weaver Silas Marner lives alone in Raveloe, living only for work and his precious hoard of money. But", "George Eliot's tale of a solitary miser gradually redeemed by the joy of fatherhood, ", " is edited with an introduction and notes by David Carroll in Penguin Classics.", "Wrongly accused of theft and exiled from a religious community many years before, the embittered weaver Silas Marner lives alone in Raveloe, living only for work and his precious hoard of money. But when his money is stolen and an orphaned child finds her way into his house, Silas is given the chance to transform his life. His fate, and that of Eppie, the little girl he adopts, is entwined with Godfrey Cass, son of the village Squire, who, like Silas, is trapped by his past. ", ", George Eliot's favourite of her novels, combines humour, rich symbolism and pointed social criticism to create an unsentimental but affectionate portrait of rural life.", "This text uses the Cabinet edition, revised by George Eliot in 1878. David Carroll's introduction is complemented by the original Penguin Classics edition introduction by Q.D. Leavis.", "Mary Ann Evans (1819-80) began her literary career as a translator, and later editor, of the Westminster Review. In 1857, she published ", ", the first of eight novels she would publish under the name of 'George Eliot', including ", ", ", ", and ", ".", "If you enjoyed ", ", you might like Nathaniel Hawthorne's ", ", also available in Penguin Classics.", "'I think ", " holds a higher place than any of the author's works. It is more nearly a masterpiece; it has more of that simple, rounded, consummate aspect ... which marks a classical work'", "Henry James"], "author": "George Eliot", "num_pages": "262", "awards": [], "places": ["United Kingdom"], "character_names": ["Silas Marner", "Eppie", "Godfrey Cass", "Dunstan Cass", "Dolly Winthrop", "Squire Cass", "Nancy Lammeter", "William Dane", "Priscilla Lammeter", "Aaron Winthrop"], "language": "English", "publish_date": "2005-07-01 00:00:00", "ISBN": "1416500340"},
{"url": "https://www.goodreads.com/book/show/19117.Fathers_and_Sons", "num_ratings": "54,834", "num_reviews": "1,742", "avg_ratings": 3.95, "genres": ["Classics", "Fiction", "Cultural", "Russia", "Literature", "Russian Literature", "Literature"], "title": "Fathers and Sons", "description": ["Bazarov—a gifted, impatient, and caustic young man—has journeyed from school to the home of his friend Arkady Kirsanov. But soon Bazarov’s outspoken rejection of authority and social conventions touches off quarrels, misunderstandings, and romantic entanglements that will utterly transform the Kirsanov household and reflect the changes taking place all across nineteenth-ce", "Bazarov—a gifted, impatient, and caustic young man—has journeyed from school to the home of his friend Arkady Kirsanov. But soon Bazarov’s outspoken rejection of authority and social conventions touches off quarrels, misunderstandings, and romantic entanglements that will utterly transform the Kirsanov household and reflect the changes taking place all across nineteenth-century Russia. ", "Fathers and Sons enraged the old and the young, reactionaries, romantics, and radicals alike when it was first published. At the same time, Turgenev won the acclaim of Flaubert, Maupassant, and Henry James for his craftsmanship as a writer and his psychological insight. Fathers and Sons is now considered one of the world’s greatest novels. ", "A timeless depiction of generational conflict during social upheaval, it vividly portrays the clash between the older Russian aristocracy and the youthful radicalism that foreshadowed the revolution to come—and offers modern-day readers much to reflect upon as they look around at their own tumultuous, changing world. ", "Introduction by Jane Costlow"], "author": "Ivan Turgenev", "num_pages": "244", "awards": [], "places": ["Russian Empire"], "character_names": ["Arkady Kirsanov", "Piyotr", "Nicolay Petroviç Kirsanov", "Agafokleya Kuzminishna Kirsanov", "Masha Kirsanov", "Prokofyic", "Fenicka Kirsanov", "Mitya Kirsanov", "Matyei Ilyic Kolyazin", "Sitnikov", "Yevdoksiya Kushkina", "Anna Sergeeyevna Odintson", "Katya Nikolayevic Lokten Kirsanov", "Arina Vlasyevna Bazarov", "Vasiliy Ivanovic Bazarov", "Porfiriy Dlatonyic", "Evgeny Bazarov"], "language": "English", "publish_date": "2005-02-01 00:00:00", "ISBN": "0451529693"},
{"url": "https://www.goodreads.com/book/show/5890.The_Woman_in_White", "num_ratings": "112,421", "num_reviews": "6,259", "avg_ratings": 3.99, "genres": ["Classics", "Mystery", "Fiction", "Gothic"], "title": "The Woman in White", "description": ["'In one moment, every drop of blood in my body was brought to a stop... There, as if it had that moment sprung out of the earth, stood the figure of a solitary Woman, dressed from head to foot in white'", " famously opens with Walter Hartright's eerie encounter on a moonlit London road. Engaged as a drawing master to the beautiful Laura Fairlie, Walter become", "'In one moment, every drop of blood in my body was brought to a stop... There, as if it had that moment sprung out of the earth, stood the figure of a solitary Woman, dressed from head to foot in white'", " famously opens with Walter Hartright's eerie encounter on a moonlit London road. Engaged as a drawing master to the beautiful Laura Fairlie, Walter becomes embroiled in the sinister intrigues of Sir Percival Glyde and his 'charming' friend Count Fosco, who has a taste for white mice, vanilla bonbons, and poison. Pursuing questions of identity and insanity along the paths and corridors of English country houses and the madhouse, ", " is the first and most influential of the Victorian genre that combined Gothic horror with psychological realism.", "Matthew Sweet's introduction explores the phenomenon of Victorian 'sensation' fiction, and discusses Wilkie Collins's biographical and societal influences. Included in this edition are appendices on theatrical adaptations of the novel and its serialisation history."], "author": "Wilkie Collins", "num_pages": "672", "awards": ["Audie Award for Classic (2011)"], "places": ["Cumberland, England", "London, England", "Hampshire, England"], "character_names": ["Walter Hartright", "Marian Halcombe", "Anne Catherick", "Sir Percival Glyde", "Count Fosco", "Frederick Fairlie", "Laura Fairlie", "Madame Fosco", "Mr. Gilmore"], "language": "English", "publish_date": "2003-02-27 00:00:00", "ISBN": "0141439610"},
{"url": "https://www.goodreads.com/book/show/17876.Notes_from_Underground_White_Nights_The_Dream_of_a_Ridiculous_Man_and_Selections_from_The_House_of_the_Dead", "num_ratings": "70,346", "num_reviews": "1,700", "avg_ratings": 4.17, "genres": ["Classics", "Fiction", "Cultural", "Russia", "Philosophy", "Literature", "Literature", "Russian Literature"], "title": "Notes from Underground, White Nights, The Dream of a Ridiculous Man, and Selections from The House of the Dead", "description": ["A collection of powerful stories by one of the masters of Russian literature, illustrating the author's thoughts on political philosophy, religion and above all, humanity: ", " (150th Anniversary Edition)", "The compelling works presented in this volume were written at dis", "A collection of powerful stories by one of the masters of Russian literature, illustrating the author's thoughts on political philosophy, religion and above all, humanity: ", " (150th Anniversary Edition)", "The compelling works presented in this volume were written at distinct periods in Dostoyevsky's life, at decisive moments in his groping for a political philosophy and a religious answer. From the primitive peasant who kills without understanding that he is destroying life to the anxious antihero of ", "—who both craves and despises affection—the writer's often-tormented characters showcase his evolving outlook on our fate.", "Thomas Mann described Dostoyevsky as \"an author whose Christian sympathy is ordinarily devoted to human misery, sin, vice, the depths of lust and crime, rather than to nobility of body and soul\" and ", " as \"an awe- and terror- inspiring example of this sympathy.\""], "author": "Fyodor Dostoyevsky", "num_pages": "233", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-11-02 00:00:00", "ISBN": "0451529553"},
{"url": "https://www.goodreads.com/book/show/12505.The_Idiot", "num_ratings": "101,961", "num_reviews": "3,831", "avg_ratings": 4.19, "genres": ["Classics", "Fiction", "Cultural", "Russia", "Literature", "Russian Literature", "Literature"], "title": "The Idiot", "description": ["Returning to Russia from a sanitarium in Switzerland, the Christ-like epileptic Prince Myshkin finds himself enmeshed in a tangle of love, torn between two women—the notorious kept woman Nastasya and the pure Aglaia—both involved, in turn, with the corrupt, money-hungry Ganya. In the end, Myshkin’s honesty, goodness, and integrity are shown to be unequal to the moral empti", "Returning to Russia from a sanitarium in Switzerland, the Christ-like epileptic Prince Myshkin finds himself enmeshed in a tangle of love, torn between two women—the notorious kept woman Nastasya and the pure Aglaia—both involved, in turn, with the corrupt, money-hungry Ganya. In the end, Myshkin’s honesty, goodness, and integrity are shown to be unequal to the moral emptiness of those around him. In her revision of the Garnett translation, Anna Brailovsky has corrected inaccuracies wrought by Garnett’s drastic anglicization of the novel, restoring as much as possible the syntactical structure of the original."], "author": "Fyodor Dostoyevsky", "num_pages": "667", "awards": [], "places": ["St. Petersburg, Russia"], "character_names": ["Prince Myshkin", "Nastasya Filippovna", "Rogozhin"], "language": "English", "publish_date": "2003-04-08 00:00:00", "ISBN": "0679642420"},
{"url": "https://www.goodreads.com/book/show/24280.Les_Mis_rables", "num_ratings": "604,962", "num_reviews": "14,653", "avg_ratings": 4.15, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Literature"], "title": "Les Misérables", "description": ["Introducing one of the most famous characters in literature, Jean Valjean—the noble peasant imprisoned for stealing a loaf of bread—Les Misérables ranks among the greatest novels of all time. In it, Victor Hugo takes readers deep into the Parisian underworld, immerses them in a battle between good and evil, and carries them to the barricades during the uprising of 1832 wit", "Introducing one of the most famous characters in literature, Jean Valjean—the noble peasant imprisoned for stealing a loaf of bread—Les Misérables ranks among the greatest novels of all time. In it, Victor Hugo takes readers deep into the Parisian underworld, immerses them in a battle between good and evil, and carries them to the barricades during the uprising of 1832 with a breathtaking realism that is unsurpassed in modern prose. Within his dramatic story are themes that capture the intellect and the emotions: crime and punishment, the relentless persecution of Valjean by Inspector Javert, the desperation of the prostitute Fantine, the amorality of the rogue Thénardier, and the universal desire to escape the prisons of our own minds. Les Misérables gave Victor Hugo a canvas upon which he portrayed his criticism of the French political and judicial systems, but the portrait that resulted is larger than life, epic in scope—an extravagant spectacle that dazzles the senses even as it touches the heart."], "author": "Victor Hugo", "num_pages": "1463", "awards": [], "places": ["Paris"], "character_names": ["Jean Valjean", "Javert", "Cosette", "Fantine", "Bishop Myriel", "M. & Mme. Thénardier", "Marius Pontmercy", "Enjolras", "Éponine", "Gavroche", "Azelma", "Champmathieu", "Fauchelevent", "Grantaire", "Mademoiselle Gillenorman", "Felix Tholomyès", "Toussaint", "Combeferre", "Jean Valjean, Javert, Fantine, Cosette, Marius Pontmercy"], "language": "English", "publish_date": "1987-03-03 00:00:00", "ISBN": "0451525264"},
{"url": "https://www.goodreads.com/book/show/656.War_and_Peace", "num_ratings": "219,811", "num_reviews": "9,025", "avg_ratings": 4.11, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Cultural", "Russia"], "title": "War and Peace", "description": ["From the award-winning translators of ", " and ", " comes this magnificent new translation of Tolstoy's masterwork. ", "broadly focuses on Napoleon’s invasion of Russia in 1812 and follows three of the most well-known characters in literature: Pierre Bezukhov, the illegitimate son of a count who is fighting for his inheritance and yearn", "From the award-winning translators of ", " and ", " comes this magnificent new translation of Tolstoy's masterwork. ", "broadly focuses on Napoleon’s invasion of Russia in 1812 and follows three of the most well-known characters in literature: Pierre Bezukhov, the illegitimate son of a count who is fighting for his inheritance and yearning for spiritual fulfillment; Prince Andrei Bolkonsky, who leaves his family behind to fight in the war against Napoleon; and Natasha Rostov, the beautiful young daughter of a nobleman who intrigues both men.", "A s Napoleon’s army invades, Tolstoy brilliantly follows characters from diverse backgrounds—peasants and nobility, civilians and soldiers—as they struggle with the problems unique to their era, their history, and their culture. And as the novel progresses, these characters transcend their specificity, becoming some of the most moving—and human—figures in world literature."], "author": "Leo Tolstoy", "num_pages": "1392", "awards": [], "places": ["Russia", "Slavkov u Brna (Austerlitz)", "Moscow, Russia", "Saint Petersburg", "Olomuc (Olmütz)"], "character_names": ["Napoleon Bonaparte", "Pierre Bezukhov", "Natasha Rostova", "Andrei Bolkonsky", "Nikolai Rostov", "Ilya Rostov", "Sonya Rostova", "Petya Rostov", "Helene Kuragina", "Anatole Kuragin", "Anna Scherer", "Maria Bolkonskaya", "Lise Bolkonskaya", "Platon Karataev", "Vasili Denisov", "Boris Drubetskoy", "Vera Rostova", "Anna Drubetskaya", "Mademoiselle Bourienne", "Nikolai Bolkonsky", "Kirill Bezukhov", "Mikhail Kutuzov", "Petr Bagration", "Dolgorukov", "Weyrother", "Tikhon", "Zherkov", "Suvorov", "Rostova", "Joseph Alexeevich", "Bezukhov"], "language": "English", "publish_date": "1998-06-25 00:00:00", "ISBN": "0192833987"},
{"url": "https://www.goodreads.com/book/show/2623.Great_Expectations", "num_ratings": "555,400", "num_reviews": "13,369", "avg_ratings": 3.76, "genres": ["Classics", "Fiction", "Literature", "Historical", "Historical Fiction"], "title": "Great Expectations", "description": ["In what may be Dickens's best novel, humble, orphaned Pip is apprenticed to the dirty work of the forge but dares to dream of becoming a gentleman — and one day, under sudden and enigmatic circumstances, he finds himself in possession of \"great expectations.\" In this gripping tale of crime and guilt, revenge and reward, the compelling characters include Magwitch, the fearf", "In what may be Dickens's best novel, humble, orphaned Pip is apprenticed to the dirty work of the forge but dares to dream of becoming a gentleman — and one day, under sudden and enigmatic circumstances, he finds himself in possession of \"great expectations.\" In this gripping tale of crime and guilt, revenge and reward, the compelling characters include Magwitch, the fearful and fearsome convict; Estella, whose beauty is excelled only by her haughtiness; and the embittered Miss Havisham, an eccentric jilted bride."], "author": "Charles Dickens", "num_pages": "505", "awards": ["Audie Award for Classic (2010)", "Премія імені Максима Рильського (1993)"], "places": [], "character_names": ["Miss Havisham", "Philip \"Pip\" Pirrip", "Joseph \"Joe\" Gargery", "Abel Magwitch", "Herbert Pocket", "John Wemmick", "Dolge Orlick", "Jaggers", "Estella", "Compeyson"], "language": "English", "publish_date": "1998-08-12 00:00:00", "ISBN": "0192833596"},
{"url": "https://www.goodreads.com/book/show/1934.Little_Women", "num_ratings": "1,413,087", "num_reviews": "18,759", "avg_ratings": 4.05, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Young Adult", "Romance", "Historical", "Literature", "Childrens", "Classics", "Classic Literature", "Literature", "19th Century"], "title": "Little Women", "description": ["Generations of readers young and old, male and female, have fallen in love with the March sisters of Louisa May Alcott’s most popular and enduring novel, ", ". Here are talented tomboy and author-to-be Jo, tragically frail Beth, beautiful Meg, and romantic, spoiled Amy, united in their devotion to each other and their struggles to survive in New England during the", "Generations of readers young and old, male and female, have fallen in love with the March sisters of Louisa May Alcott’s most popular and enduring novel, ", ". Here are talented tomboy and author-to-be Jo, tragically frail Beth, beautiful Meg, and romantic, spoiled Amy, united in their devotion to each other and their struggles to survive in New England during the Civil War."], "author": "Louisa May Alcott", "num_pages": "449", "awards": [], "places": ["Concord, Massachusetts", "Massachusetts", "London, England", "New England"], "character_names": ["Marmee", "Jo March", "Meg March", "Beth March", "Amy March", "Laurie Laurence", "Mr. Laurence", "Aunt March", "John Brooke", "Professor Bhaer", "Mr. March", "Hannah Brown"], "language": "English", "publish_date": "2004-04-06 00:00:00", "ISBN": "0451529308"},
{"url": "https://www.goodreads.com/book/show/7144.Crime_and_Punishment", "num_ratings": "498,746", "num_reviews": "14,209", "avg_ratings": 4.19, "genres": ["Classics", "Fiction", "Cultural", "Russia", "Literature", "Literature", "Russian Literature"], "title": "Crime and Punishment", "description": ["Raskolnikov, an impoverished student living in the St. Petersburg of the tsars, is determined to overreach his humanity and assert his untrammeled individual will. When he commits an act of murder and theft, he sets into motion a story that, for its excruciating suspense, its atmospheric vividness, and its depth of characterization and vision is almost unequaled in the lit", "Raskolnikov, an impoverished student living in the St. Petersburg of the tsars, is determined to overreach his humanity and assert his untrammeled individual will. When he commits an act of murder and theft, he sets into motion a story that, for its excruciating suspense, its atmospheric vividness, and its depth of characterization and vision is almost unequaled in the literatures of the world. The best known of Dostoevsky’s masterpieces, Crime and Punishment can bear any amount of rereading without losing a drop of its power over our imaginations.", "Dostoevsky’s drama of sin, guilt, and redemption transforms the sordid story of an old woman’s murder into the nineteenth century’s profoundest and most compelling philosophical novel.", "Award-winning translators Richard Pevear and Larissa Volokhonsky render this elusive and wildly innovative novel with an energy, suppleness, and range of voice that do full justice to the genius of its creator."], "author": "Fyodor Dostoyevsky", "num_pages": "671", "awards": [], "places": ["Russian Empire", "Siberia, Russian Empire", "Saint Petersburg, Russian Empire"], "character_names": ["Rodion Romanovich Raskolnikov", "Porfiry Petrovich", "Sofia Semyonovna Marmeladova", "Avdotya Romanovna Raskolnikova", "Arkady Ivanovich Svidrigailov", "Dmitri Prokofich Razumikhin", "Katerina Ivanovna Marmeladova", "Pyotr Petrovich Luzhin", "Raskolnikoff"], "language": "English", "publish_date": "2002-12-31 00:00:00", "ISBN": "0143058142"}
]